<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Beruf:
Auftragshacker</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Hacken aus
Leidenschaft - und im Kundenauftrag: Kein Widerspruch f&#252;r
Michael M&#252;lly, den wohl besten Hacker der Schweiz. Sein
Arbeitsort? Geheimsache. Seine Auftraggeber? Darf er nicht nennen.
Warum? Berufsgeheimnis.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 01.09.2000<br />
 <b>Rubrik:</b> Magazin Top 500/2000<br />
 <b>Autor:</b>&#160;<a href="../../impressum"
class="txt-link-red">Beat Schmid</a>, Daintry Duffy (Mitarbeiter
CIO)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Hacker stehen weit oben
in der Gunst der Informatikchefs. Niemand gibt es gern zu, aber ihr
Wissen ist von unsch&#228;tzbarem Wert f&#252;r eine Wirtschaft,
die sich immer st&#228;rker mit dem Internet vernetzt. Je
h&#246;her der Vernetzungsgrad der Gesch&#228;ftsprozesse, je
anf&#228;lliger sind Unternehmen auf Hacker-Angriffe. Dabei spielt
es meist &#252;berhaupt keine Rolle, wieviel Geld in die Sicherheit
eines Computer-Systems investiert wird. Ausgekl&#252;gelte
Antihackprogramme bieten wenig Schutz, wenn sie von schlecht
ausgebildetem und unterbezahltem Personal bedient werden. Das
schw&#228;chste Glied in der Verteidigungslinie ist der Mensch.
Mangelndes Wissen &#252;ber IT-Sicherheit wird von der
internationalen Hackerzunft kaltschn&#228;uzig ausgenutzt.<br />
<br />
 Was f&#252;r ein Gl&#252;ck, gibt es Hacker - einen wie Michael
M&#252;lly, der die schwarze Kunst des Computereinbruchs
beherrscht, sie aber nicht aus&#252;bt. Besser gesagt: nicht mehr.
Michael ist einer der besten Hacker der Schweiz, seit Januar 1999
Inhaber der Sicherheitsberatungsfirma Intradetect und im Nebenjob
Kantonssch&#252;ler in Pf&#228;ffikon, Schwyz.<br />
<br />
 Mit seiner spektakul&#228;rsten Attacke hat er sich auch in die
internationale Crackerelite hochgehackt: Wochenlang besass der
Schweizer Jungcracker einen sogenannten Backdoor-Account, der ihm
Zugriff auf einen IBM-Mainframerechner eines grossen
US-Computerunternehmens gew&#228;hrte.<br />
<br />
 Doch &#252;ber diese Zeiten will Michael lieber nicht mehr
sprechen. Erstens wird er bald 18 und kann dann auch vom Gesetz
h&#228;rter angefasst werden. Zweitens hat er jetzt ohnehin die
Fronten gewechselt. Er bezeichnet sich selbst als "Grey Hat"-Hacker
und legt wert auf diese Bezeichnung: Entgegen der landl&#228;ufigen
und von den meisten Medien geteilten Meinung denotiert Hacker in
der Insidersprache lediglich eine Person, die &#252;ber das Wissen
und die Neugierde verf&#252;gt, einem Computersystem auf den Grund
zu gehen. Ein Hacker ist in der komplexen Terminologie des
Untergrunds somit kein Krimineller. Es sind die sogenannten
Cracker, die Gefahr laufen, gegen geltendes Gesetz zu verstossen,
wenn sie unbefugt in Systeme eindringen, Daten manipulieren und
klauen oder Identit&#228;ten &#228;ndern. Die Hackerzunft spricht
in diesem Zusammenhang auch von weissen und schwarzen
Hackern.<br />
<br />
 Irgendwo in der Mitte stehen die grauen Hacker, die nicht mehr
unbefugt Systeme knacken, aber Kontakte zur illegalen Szene
aufrechterhalten, um stets mit den neuesten Tricks versorgt zu
werden. Zu dieser Gruppe z&#228;hlt auch Michael M&#252;lly. Sein
Vorbild sind die L0phant Heavy Industries, ein Unternehmen, das
sich aus schillernden Figuren der US-Hackerszene zusammensetzt und
k&#252;rzlich von der E-Commerce-Security-Firma At-Stake
&#252;bernommen wurde.<br />
<br />
 In den USA scheint das Klima hackerfreundlicher zu sein als in der
Schweiz. Die US-Industrie ist &#252;berzeugt, Hacker h&#228;tten
mehr drauf. Weld Pond, ein Computerexperte in den Diensten von
At-Stake, bringt es auf den Punkt: "Wenn Sie jemanden einstellen,
der das Unternehmensnetzwerk auf Sicherheitsl&#246;cher pr&#252;fen
soll, w&#252;rden Sie jemand einstellen, der Lockcrack (ein
Programm, das Passw&#246;rter knackt) bedienen kann, oder jemand,
der dieses Programm geschrieben hat?"<br />
<br />
 Michael M&#252;llys Sicherheitsfirma Intradetect ist noch eine
kleine Nummer und kann sich mit der riesigen L0phant nicht messen.
Aber immerhin, auf M&#252;llys Kundenliste stehen 20
schutzbed&#252;rftige Schweizer Firmen. Namen darf er nicht nennen.
Es sei aber auch eine grosse Bank darunter, sagt er mit typischem
Hackerunderstatement.<br />
<br />
 Neben Beratungsdiensten f&#252;hrt Michael f&#252;r seine Kunden
unter anderem sogenannte Penetrationstests durch. Was er genau
darunter versteht, f&#252;hrt er im Rahmen eines Testhacks auf
www.computerworld.ch vor. Nach wenigen Minuten scheint er bereits
eine Spur gefunden zu haben: "Ihr habt seltsame Ports offen",
murmelt er. "Hier &#252;ber diesen k&#246;nnten wir euer System mit
einer Denial-of-Service-Attacke lahmlegen." "P&#228;ng!" "Wenn du
deiner Firma mal schaden willst, dann weisst du jetzt wie",
triumphiert Michael, der bekehrte Cracker, im Server-Raum einer
Z&#252;rcher Webagentur, den er f&#252;r den Journalistenbesuch
kurzerhand in eine Hackzentrale umgewandelt hat. Die Webagentur
steht auch auf Michaels Kundenliste.<br />
<br />
 Ein offener Port ist immer schlecht, erkl&#228;rt Michael. Je mehr
Ports offen sind, umso schlechter - und umso mehr
M&#246;glichkeiten bieten sich einem Cracker, in ein Netzwerk
einzudringen. Ports sind Andockstationen, &#252;ber die vernetzte
Rechner unter Verwendung eines bestimmten Protokolls Services
austauschen. Hinter den Ports befinden sich immer auch
Applikationen. Und auf diese Applikationen sind Cracker besonders
scharf. In Computerprogrammen finden sich immer irgendwelche
Schwachstellen oder Bugs, die der Cracker geschickt ausnutzt, um
sich Zutritt in ein System zu verschaffen. Hinter dem Port 1032
beispielsweise steht die Applikation Notes der US-Softwarefirma
Lotus. Ist ein Systemadministrator schlampig und verfolgt nicht
peinlich genau die t&#228;glich im Internet publizierten
Softwarefehler-Reports, hat ein Cracker leichtes Spiel. Eiskalt
nutzt er die bekannten Schwachstellen aus. Der Einstieg ins System
wird von einem unvorsichtigen Netzverwalter wahrscheinlich nicht
bemerkt, und so hat der Cracker alle Zeit der Welt, sich im System
umzuschauen. Ist er einmal drin, ist es nur noch Routinearbeit, an
die wirklich heissen Informationen heranzukommen. Wer denkt, dass
Passw&#246;rter dabei eine besonders grosse Herausforderung
darstellen, irrt sich gewaltig. Die meisten Unternehmen haben
Software im Einsatz, die Passw&#246;rter im Klartext, also nicht
verschl&#252;sselt, vom Benutzer-PC auf den Server
&#252;bermittelt. Mit einem am richtigen Ort platzierten Sniffer
ist er im Handumdrehen im Besitz der Geheimcodes und Benutzernamen.
Und hat er erst einmal die, geht's richtig los: Jetzt kann er nach
belieben Schaden Anrichten, Daten herunterladen oder auf
Nimmerwiedersehen verschwinden lassen.<br />
<br />
 Soweit ist es bei seinem Hackangriff auf die Computerworld-Site
zum Gl&#252;ck nicht gekommen. Trotzdem, was Michael in weniger als
30 Minuten herausgefunden hat, ist beeindruckend. Er weiss nun, wie
viele und welche Ports offen sind, mit welcher Server-Software
(samt Bugliste) www.computerworld.ch betrieben wird, ob eine
Firewall zum Schutz eingesetzt wird, wenn ja, welche.<br />
<br />
 Er arbeitet mit einem handels&#252;blichen PC. Sein
Travelmate-Notebook betreibt er unter Suse-Linux, einer deutschen
Distribution des bekannten Gratis-Betriebssystems von Linus
Torwalds. "Die meisten Hacker arbeiten mit Linux", sagt Michael
M&#252;lly. "Weil es gratis ist." "In letzter Zeit benutzen aber
immer mehr das Unix-Betriebssystem Solaris von Sun". Grund: Sun hat
ihre Lizenzpolitik ge&#228;ndert und gibt f&#252;r sogenannt
nicht-kommerzielle Anwendungen das Betriebssystem umsonst ab.
Nichts anfangen k&#246;nnen Hacker im allgemeinen mit Windows, dem
Betriebssystem von Microsoft. "Es gibt keine interessante
Hackertools f&#252;r das Gates-Produkt, selbst harmlose Werkzeuge
wie Arp, Whois und Queso sucht man vergebens, ausserdem ist es
teuer", schn&#246;det Michael.<br />
<br />
 "Nur Lamers arbeiten mit Windows", weiss der Ex-Cracker. Lamers
sind M&#246;chtegern-Hacker, die aber &#252;berhaupt kein
technisches Hintergrundwissen haben. "Die sind einfach fasziniert
von den M&#246;glichkeiten der Hackerei." Von einschl&#228;gigen
Hacker-Sites laden sie sich die paar Hacker-Programme herunter, die
es f&#252;r Windows gibt, und versuchen so viel Schaden wie
m&#246;glich anzurichten. Zum bescheidenen Repertoire der Lamers
z&#228;hlen die in den letzten Monaten sprunghaft angestiegenen
Denial-of-Service-Attacken (DoS), bei denen das Zielsystem mit so
vielen Anfragen bombardiert wird, bis es den Dienst verweigert. Gut
m&#246;glich, dass beim spektakul&#228;ren DoS-Angriff auf die
Z&#252;rcher ETH vor ein paar Monaten ebenfalls Lamers ihre Finger
im Spiel hatten. Vieles deutet darauf hin. Die Art und Weise, wie
die Angriffe vorbereitet und ausge&#252;bt wurden, l&#228;sst auf
Lamers schliessen. H&#228;ufig wissen die Nichtsk&#246;nner gar
nicht, welche Site sie gerade im Begriff sind, mit TCP/IP-Anfragen
zu &#252;berfluten und zum Absturz zu bringen. Das war auch bei der
ETH der Fall. Wenig verwunderlich ist, dass die Lamers sich bei den
echten Hackern und Crackern mit solchen Aktionen wenig beliebt
machen. Wenig verwunderlich auch, dass die L&#228;mmer im Wolfspelz
auch schon oft das Ziel eines &#252;blen Hackerspasses geworden
sind, wenn sie unwissentlich ein Hackerwerkzeug von Internet
herunterladen, in dem eine Softwarewanze versteckt ist. Darin
l&#228;sst sich &#252;brigens ein wichtiger Charakterzug der
Cracker erkennen, die nur dann zuschlagen, wenn sie sich &#252;ber
etwas nerven. Und Lamers nerven gewaltig.<br />
<br />
 Michael M&#252;lly hat mit seinen 17 Jahren weit mehr Erfahrung
mit Computern als manch hochbezahlter Informatik- und
Netzwerkexperte mit Uniabschluss. Begonnen hat seine PC-Karriere im
Alter von sechs. Sein Vater schaffte sich damals f&#252;r die
Doktorarbeit einen 286er an. Der Rechner wurde bald seiner, und
seither hat er unz&#228;hlige Maschinen durchgearbeitet. Logisch,
dass Michael seit Jahren seine Freizeit vor dem Computer verbringt.
Wenn er um vier Uhr nachmittags von der Schule nach Hause kommt,
geht's los, und Michael sitzt bis tief in die Nacht hinein vor
seinem PC. Der junge Computerexperte ist mit seiner F&#228;higkeit
und Hartn&#228;ckigkeit, praktisch jedes System zu knacken,
nat&#252;rlich ein begehrter Mann. Die Mehrheit der Anfragen sind
seri&#246;ser Natur. "H&#228;ufig bekomme ich auch weniger
seri&#246;se Anfragen, im Stil: Besorgen Sie mir die
Buchhaltungszahlen der Firma X!, hier ist ein Couvert mit 10000
Franken", sagt Michael. Doch einen solchen Auftrag habe er noch nie
angenommen, beteuert er. Das l&#228;sst er auch besser sein. Wer
sich darauf einl&#228;sst, muss h&#246;llisch aufpassen, nicht
pl&#246;tzlich im Gef&#228;ngnis zu landen. Auf Besuche von der
Polizei hat er keinen Bock und schon gar nicht auf Knast. Jetzt
hackt er in legalen Bahnen wie viele seiner Kollegen auch.<br />
<br />
 Ex-Cracker sind in der Hackordnung der Informatiker zuoberst
anzutreffen. Entsprechend begehrt sind sie bei Firmen. 31 Prozent
von 191 k&#252;rzlich befragten US-Informatikchefs w&#252;rden
sogar Kevin Mitnick, einer der gef&#252;rchtetsten Hacker
&#252;berhaupt, als Sicherheitsberater sofort einstellen (siehe
Interview auf Seite 27). Mitnick ist nach seiner
f&#252;nfj&#228;hrigen Haftstrafe wieder auf freiem Fuss und nach
Lockerung der restriktiven Bew&#228;hrungsauflagen darf er auch
wieder einen PC bedienen und ungestraft mit seiner Mutter
telefonieren. Mitnick erkl&#228;rt sich seine Beliebtheit trotz
Eintrag im Strafregister damit, dass er im Gegensatz zu den meisten
klassisch ausgebildeten Sicherheitsexperten &#252;ber
einschl&#228;gige Berufserfahrung verf&#252;gt, die von
unsch&#228;tzbarem Wert ist. Und Firmen seien "mehr an Erfahrung
als an Uniabschl&#252;ssen interessiert".<br />
<br />
 Ein Ex-Cracker wie Mitnick mag der ideale Mann sein, der im
Auftrag einer Firma Penetrationstests durchf&#252;hrt. Sehr
wahrscheinlich st&#246;sst er nach langen N&#228;chten und Wochen
auf ein undokumentiertes Sicherheitsloch, das er dann geschickt zu
einer Hintert&#252;r ausbauen kann. Das mag beeindrucken, doch ob
der Cracker auch in der Lage ist, ein wasserdichtes
Sicherheitskonzept auf die Beine zu stellen, ist fraglich. Die
meisten Hacker sind relativ unge&#252;bt, wenn es darum geht,
Massnahmen zu entwickeln, die ein erneutes Eindringen verhindern.
Der Schritt vom Hacker zum Securityberater ist gross.<br />
<br />
 Das l&#252;ckenhafte Wissen tut der Beliebtheit der Hacker auf dem
Arbeitsmarkt aber keinen Abbruch. Besonders hackerfreundlich sind
Firmen, die sich von Berufs wegen mit Sicherheit besch&#228;ftigen.
Es geh&#246;rt zum guten Ton, Ex-Hacker auf der Gehaltsliste zu
f&#252;hren. Manche br&#252;sten sich gar damit. Der
Technologiechef eines finnischen Antiviren-Programmherstellers hat
an einer Presseveranstaltung vor einem Jahr &#246;ffentlich mit
seiner eher zweifelhaften Vergangenheit kokettiert.<br />
<br />
 Die Frage brennt: Wie weit kann man einem umgepolten Cracker
vertrauen? Was unterscheidet einen jugendlichen Ex-Cracker von
seinem gleichaltrigen Kumpel, der von seinem Elternheim
n&#228;chtliche Hackattacken startet? Nicht viel in manchen
F&#228;llen.<br />
<br />
 Eine US-Firma hat zugeben m&#252;ssen, einen Hacker wieder
gefeuert zu haben, nachdem in der Insiderpostille "Hacker's
Quarterly" ein Artikel publiziert wurde, der vertrauliche
Informationen &#252;ber das Netzwerk der Firma enthielt. Der Hacker
bestritt zwar, diese Informationen geliefert zu haben, doch der
Chef wollte keine weiteren Experimente und gab ihm den Laufpass.
Egal, ob umgepolt oder nicht, ein Hacker bleibt immer ein
Sicherheitsproblem.<br />
<br />
 <b>Kevin Mitnick, Starcracker</b><br />
 Kevin Mitnick ist wohl der ber&#252;hmteste Hacker, den die Welt
je gesehen hat. Wegen unz&#228;hligen Computerdelikten sass der
36-J&#228;hrige fast f&#252;nf Jahre im Knast. An seine Freilassung
im Januar 2000 wurden strenge Bew&#228;hrungsauflagen
gekn&#252;pft, die k&#252;rzlich per Gerichtsentscheid wieder
gelockert wurden. So darf Mitnick wieder Jobs annehmen, bei denen
er in Kontakt mit Computern kommt.<br />
<br />
 Duffy: Welche Abkl&#228;rungen sollte ein Unternehmen treffen,
bevor es einen Ex-Cracker einstellt?<br />
<br />
 Mitnick: Nur weil jemand sagt, er sei ein Cracker, bedeutet das
nicht, dass er auch das richtige R&#252;stzeug f&#252;r den Job
hat. Ein Cracker kennt vielleicht die Pfade, wie er sich unerkannt
durch ein Windows-NT-System zu schl&#228;ngeln hat, ob er auch
Ahnung von Sicherheitsregeln und -Prozeduren hat, die eine Firma
sch&#252;tzen, ist fraglich.<br />
<br />
 Was halten Sie von den Leuten, die die k&#252;rzlich massiert
aufgetretenen Denial-of-Service-Attacken durchgef&#252;hrt
haben?<br />
<br />
 Mitnick: Wenn die Medien solche Figuren als Hacker bezeichnen,
dann wird der Begriff Hacker und letztlich die Hacker selbst in den
Dreck gezogen. Viele wissen nicht, dass die Apple-Gr&#252;nder
Steve Jobs und Steve Wozniack sich als Hacker bezeichneten, aber
niemand w&#252;rde ernsthaft behaupten, die beiden h&#228;tten
jemals die Absicht gehabt, Schaden anzurichten.<br />
<br />
 Wie anf&#228;llig sind Unternehmen auf Hackangriffe?<br />
<br />
 Mitnick: Vorausgesetzt, ein Cracker verf&#252;gt &#252;ber
ausreichende Ressourcen, Zeit und Geld, so kann er jedes System
knacken. Deshalb ist es wichtig, dass Informatikchefs ihre Netze
nur so sicher machen, wie es wirtschaftlich Sinn macht. Das ist wie
beim Autoklau: Ist die Pr&#228;senz einer Alarmanlage schon von
aussen sichtbar, so ist es nicht unm&#246;glich, das Auto zu
knacken, aber viel wahrscheinlicher ist, dass ein Dieb sich davon
abschrecken l&#228;sst und am n&#228;chsten Wagen sein Gl&#252;ck
probiert.<br />
<br />
 Sollten sich Firmen davor h&#252;ten, vorbestrafte Cracker
einzustellen?<br />
<br />
 Mitnick: Nur weil jemand wegen eines Hacks verurteilt wurde,
heisst das noch nicht, dass er kriminell ist. In den USA wird man
schon wegen einer Bagatelle verurteilt. Es besteht doch ein grosser
Unterschied zwischen einem Bankangestellten, der im grossen Stil
Geld auf ein geheimes Konto transferiert, und einem Hacker, der aus
Neugierde in ein System eindringen will, dabei aber null Schaden
anrichtet.<br />
<br />
 Welches ist die empfindlichste Stelle in der
Unternehmensinformatik?<br />
<br />
 Mitnick: Schwachstelle Nummer eins ist immer der Mensch. Selbst
wenn Sie die besten und aktuellsten Sicherheitswerkzeuge besitzen,
macht Sie das nicht sicher. Da Sie m&#246;glicherweise von einer
schlechtausgebildeten Person bedient werden. Und genau dort setzen
Hacker an. Je weniger eine Person &#252;ber ein Tool Bescheid
weiss, desto einfacher ist es f&#252;r einen Hacker eine Loch zu
finden.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

