<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span
class="txt-xl-black">Sp&#252;rhunde am Werk</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Die Computerforensik
macht aus Gel&#246;schtem und Verborgenem Beweise, die vor Gericht
Hand und Fuss haben. Dass das bitter n&#246;tig ist, zeigt die
Kriminalit&#228;t innerhalb der Informationstechnik. Zahlreiche
alte und neue verbrecherische Bet&#228;tigungsfelder fordern heute
die Profis im Schn&#252;ffeln heraus. Allein das FBI hat die
Gr&#252;ndung von drei neuen Computerforensik-Zentren
angek&#252;ndigt.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 02.08.2002<br />
 <b>Rubrik:</b> Report<br />
 <b>Autor:</b>&#160;Michael Goldberg (CIO), Deborah Radcliff
(Computerworld USA)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Letzten Winter
berichteten die Revisoren der Firma Enron der emp&#246;rten Welt,
dass sie eine unbestimmte Menge Daten - Dokumente genauso wie
Emails - zerst&#246;rt h&#228;tten, die sich auf den finanziellen
Niedergang des Unternehmens bezogen. Andrew Rosen jedoch ist
&#252;berzeugt davon, dass er trotzdem herausfindet, was passiert
ist und erf&#228;hrt, wer was wann zerst&#246;rt hat.<br />
 Rosen ist Pr&#228;sident von ASR Data Acquisition and Analysis. Er
ist einer der Schn&#252;ffler, die die Systeme des Falls
durchw&#252;hlen, der eine der gr&#246;ssten computerforensischen
Untersuchungen aller Zeiten ausl&#246;ste. Jedenfalls sagen dies
Beobachter. Rosen will keine Einzelheiten &#252;ber seine Arbeit
mit den Enron-Systemen preisgeben. "Es ist viel einfacher, die
Computerforensik-Arbeiten durchzuf&#252;hren, die zeigen, was
gedruckt, was zerst&#246;rt, was versandt und was empfangen wurde,
als die Tausenden von Papierstreifen wieder zusammenzukleben, die
in den Aktenvernichtern stecken."<br />
<br />
 Das FBI k&#252;ndigte vor einiger Zeit die Gr&#252;ndung von drei
neuen Computerforensik-Zentren in den USA an. Diese Technik der
Spurensuche wird schon l&#228;ngere Zeit von den
Justizbeh&#246;rden eingesetzt. Die Werkzeuge daf&#252;r sind in
vielen grossen Unternehmen, bei Sicherheitsdienstleistern und in
Spezialfirmen wie der von Rosen zum allt&#228;glichen
Arbeitsmaterial geworden. Die Wissenschaft analysiert die Bits und
Bytes, welche auf einer Speicherplatte zur&#252;ckbleiben, und
sichert sie sorgf&#228;ltig, damit man die Daten in dem Zustand
sieht, bevor sie zuletzt ver&#228;ndert wurden. Sie ist ein
kraftvolles Werkzeug f&#252;r Untersuchungsbeamte wie f&#252;r
interne Sicherheitsleute, die mit der Durchsetzung von Vorschriften
der Computerverwendung betraut sind, das Online-Verhalten eines
ver&#228;rgerten Angestellten &#252;berpr&#252;fen oder die Autoren
eines b&#246;swilligen Codes aufsp&#252;ren m&#252;ssen.<br />
<br />
 Die Hersteller solcher forensischen Werkzeuge wie Access Data,
Guidance Software oder New Technologies arbeiten gemeinsam mit
Entwicklern der Universit&#228;tslabors und mit Sicherheitsberatern
wie @Stake. Diese Firmen geben den Untersuchungsbeamten
&#252;berdurchschnittliche und sehr leistungsf&#228;hige
M&#246;glichkeiten, um die Gigabytes zu analysieren, die auf den
Speichermedien verd&#228;chtiger Computer sitzen, was im Fall von
Enron mehrheitlich Windows-Server, PCs und Laptops waren.<br />
<br />
 Die modernen Werkzeuge f&#252;r Computerforensik halten mit der
wachsenden Anzahl von Orten Schritt, an denen digitale Beweismittel
versteckt werden. Beispielsweise konnte damit die holl&#228;ndische
Polizei mit Daten aus dem Navigationssystem eines Autos
Informationen aus einem Handheld fischen. Dies setzt allerdings
eine teure Ausbildung der Spezialisten voraus; aber nur dadurch
wird die Computerforensik f&#252;r Gesch&#228;ftswelt und Justiz
nutzbringend eingesetzt werden k&#246;nnen. Ohne diese Schulung
k&#246;nnte es Jahre dauern, bis ein Untersuchungsbeamter den
endg&#252;ltigen Test besteht und als Experte vor Gericht aussagen
kann.<br />
<br />
 CIOs sollten aufpassen. Wenn sie die Bildung eines internen
Computerforensik-Teams planen oder die Personalabteilung ein
solches vorschreiben will. Zuerst m&#252;ssen die Leute ausgebildet
werden, bevor man die Software einkaufen geht. Die gr&#246;ssten
Hersteller in diesem Bereich bieten Schulungskurse an. Hier finden
sich auch Polizisten und Privatdetektive unter den Sch&#252;lern.
Doch trotz internem Team sollten die Sicherheitsdienstleister und
ihre Angebote verglichen werden.<br />
<br />
 "Die Kenntnisse, Erfahrungen und das Wissen der Fachperson
reichern die Ergebnisse der Applikationen betr&#228;chtlich an",
sagt Bill Boni, Chief Information Security Officer bei Motorola.
"Ein Detektiv muss w&#228;hrend einer Untersuchung das menschliche
Verhalten und die Handlungen verstehen, Dinge miteinander in
Zusammenhang bringen und sie gegeneinander abw&#228;gen". F&#252;r
Unternehmen empfiehlt es sich, eine Kombination von intern
ausgebildeten Experten und Beratern, die auf Netzwerkeinbrecher und
andere Zwischenf&#228;lle spezialisiert sind. Die Nachfrage nach
forensischen Diensten ist bescheiden, w&#228;chst aber. Die
Marktforschungsfirma IDC sagt voraus, dass der Markt f&#252;r die
Dienste zur Verbrechensbek&#228;mpfung einschliesslich
Computerforensik-Services von 133 Millionen Dollar im Jahr 2001
schon in drei Jahren, bis 2004, auf 284 Millionen steigen
wird.<br />
<br />
 <b>Das richtige Werkzeug</b><br />
 Jedes Betriebssystem beschreibt eine Festplatte auf seine
spezielle Art und verwaltet auch Files unterschiedlich. Forensische
Werkzeuge m&#252;ssen diesen Methoden genau folgen, um Kopien von
Beweismitteln zur Analyse herzustellen und zu pr&#252;fen, was
jeweils vorliegt. Auch gel&#246;schte Files k&#246;nnen noch
&#252;ber eine PC-artige grafische Schnittstelle aufgezeichnet
werden. Die verbreitetsten Softwarepakete wie Forensic Toolkit von
Access Data Development, Encase von Guidance und Safeback von NTI
pr&#252;fen Windows-PC und -Server. Versprochen sind
Verbesserungen, die Linux-, Macintosh- und andere Versionen des
Forensic Toolkit umfassen sollen.<br />
<br />
 Eine forensische Untersuchung in einem Unix-Laden mit
Linux-Servern k&#246;nnte mit einem Open-Source-Programm wie The
Coroner's Toolkit (TCT) anfangen, erkl&#228;rt Brian Carrier,
Forschungswissenschaftler bei @Stake. Carriers Team hat ein eigenes
Toolkit entwickelt, das auf TCT aufbaut und dessen
Analysef&#228;higkeiten erweitert wurde. Seine Firma hat ausserdem
ein forensisches Werkzeug namens PDD (Palm Disk Duplicator)
entwickelt, um Daten aus Ger&#228;ten mit Palm-Betriebssystemen zu
fischen.<br />
<br />
 Derartige Analysem&#246;glichkeiten m&#252;ssen unbedingt
weiterwachsen. Eine bedeutende Aufgabe der Hersteller sei es, mit
den wachsenden Mengen von Gigabytes Schritt zu halten, die heute in
jedem PC oder Laptop Platz finden, sagen die Forensik-Fachleute.
Dabei sei es sehr wichtig, grosse Datenmengen ordnen und durchsehen
zu k&#246;nnen, sagt James E. Gordon, Vizepr&#228;sident der
Detektei Pinkerton Consulting and Investigations in Los
Angeles.<br />
<br />
 "Es bleibt Platz f&#252;r Feinabstimmungen. Es geht mehr um die
Menge von Informationen, die durchgesehen werden m&#252;ssen, wobei
das digitale Dokumentenmanagement am wesentlichsten ist", sagt er.
"Vor drei Jahren hatte ich eine 10-Gigabyte-Festplatte. Heute fasst
schon ein Laptop 40 Gigabyte. Die F&#228;higkeit, all diese
Informationen zu verarbeiten und zu analysieren, ist sehr
wichtig."<br />
<br />
 <b>Detektive im Netz</b><br />
 Die Suche nach Beweismitteln reicht aber &#252;ber die
Festplattenanalyse des Verd&#228;chtigen hinaus. Boni, der Leiter
des Forensikteams von Motorola, sagt, die Computerforensik habe
sich aus dem Bed&#252;rfnis der Justizbeh&#246;rde heraus
entwickelt, um kriminelle Machenschaften zu dokumentieren. Doch die
Forensik im Unternehmen muss sich darauf konzentrieren,
Netzwerkeinbr&#252;che zu untersuchen wie beispielsweise
Entstellungen von Websites. Um herauszufinden, wie jemand eine
solche Tat begangen haben k&#246;nnte, muss man zuerst
herausfinden, wer es war, und versuchen, solche Vorf&#228;lle in
Zukunft zu verhindern.<br />
<br />
 Sicherheitsexperten erkl&#228;ren, dass sie Software als
Wachtposten an den Netzwerkw&#228;nden einsetzen. Shimon Gruper,
Vizepr&#228;sident f&#252;r Internetsicherheitstechnologie bei der
Sicherheits- und Beratungsfirma Aladdin Knowledge Systems, meint,
seine Firma verwende Linux-Shareware und -Freewaretools, um die
Aktivit&#228;ten von Internetvandalen und W&#252;rmern zu
kontrollieren, und um an ihre Quellen zu gelangen.<br />
<br />
 Sicherheitsarchitekt Doug Barbin von Guardent kann mit derartigen
Netzwerk&#252;berwachungstools Zwischenf&#228;lle rekonstruieren
wie das Hacken eines Angestellten &#252;ber sein
Arbeits-Emailkonto. F&#252;r diesen Fall schaute sich Barbin eine
Reihe von Logs an (Email-Server, VPN-Verbindung und andere
Aufzeichnungen), um die Aktivit&#228;ten bis zu einem einzelnen
Angestellten zur&#252;ckzuverfolgen. Dann verfolgte er die Spur
weiter bis zum Arbeits- und Privat-PC des Angestellten.<br />
<br />
 "Netzwerkforensik ist ein Anfang, aber vor Gericht ist die
statische Forensik ausschlaggebend", die die Aktivit&#228;ten auf
dem Computer eines Verd&#228;chtigen aufzeichnet, wie Barbin sagt.
Klar, dass Forensikexperten bei der Frage lachen, ob ihre Arbeit
nur dann ins Spiel kommt, wenn auf guten Computersystemen schlechte
Dinge passieren. Tats&#228;chlich gehen ihre Aufgaben sehr viel
weiter. Sowohl Hersteller wie Praktiker geben an, dass sich
Forensikwerkzeuge auch in F&#228;llen eignen, in denen
versehentlich kritische Unternehmensdokumente gel&#246;scht wurden
und wiederhergestellt werden m&#252;ssen oder wenn in einem
Geb&#228;ude voller Computer Schaden entsteht, Informationen
verlorengehen oder kein ordentlicher Backup gemacht wurde.<br />
<br />
 <b>Mehrere Methoden</b><br />
 Hier erweist sich die Computerforensik als rettender Strohhalm.
Dennoch warnen gleichzeitig die Experten vor dem sich entwickelnden
Feld der Computerforensik. CIOs sollten den Mangel an Standards
f&#252;r das Sammeln digitaler Beweise und dem Mangel an
Zertifizierungsprozessen f&#252;r Untersucher zumindest
ber&#252;cksichtigen. "Wenn man st&#228;ndig &#252;berwachen muss,
mit Personalabteilungen und in einer feindlichen Arbeitswelt zu
arbeiten gezwungen ist, sind diese Werkzeuge ein Segen", sagt
Rosen, der Forensik-Detektiv. Aber es gibt einen Unterschied
zwischen der Ermittlung von internen Taten und der Vorlage von
Beweismitteln vor Gericht, die mit diesen Werkzeugen gefunden
werden. Beide Punkte zeigen, wie wichtig gemeinsame Bezugspunkte
f&#252;r die Produkte aller Hersteller sind, f&#252;r
Ausbildungskurse und f&#252;r Beraterdienste.<br />
<br />
 Informationen und Hinweise anderer CIOs und IT-Praktiker sind das
beste Hilfsmittel bei der Auswahl der Technik. Und bei Spuren der
digitalen Forensik, die bis vors Gericht f&#252;hren, ist es
wichtig, mit Juristen zu reden, die mit verschiedenen
Sicherheitsberatern und Forensikexperten zusammenarbeiten. So finde
man den besten Fachmann, sagt Matthew Schwartz, Partner der Firma
Bederson &amp; Co. "Man muss nicht &#252;ber einen spezifischen
Fall reden, man muss die Schuldigen nicht kennen, aber man muss
einen soliden Plan haben. Wie dokumentiert man seine
Vorgehensweisen, damit man sich vor Gericht nicht sagen lassen
muss, dass man alles erfunden habe," sagt er.<br />
<br />
 <b>Steganografie - verborgene Daten</b><br />
 Eine Ingenieurfirma vermutete, dass einer ihrer Mitarbeiter
wertvolles geistiges Eigentum aus ihrem Netzwerk stahl und
weitergab. Als die Forensik-Beratungsfirma Electronic Evidence
Discovery (EED) den Fall im Juni 2000 untersuchte, fand sie keine
Beweise auf der lokalen Festplatte. Nach der Pr&#252;fung von
Mail-Logs jedoch fanden die Detektive die rauchende Waffe. Es
handelte sich um zwei Emails mit harmlos scheinenden
Bild-Attachments, die von einem Ingenieur versandt worden waren. Es
stellte sich heraus, dass hinter den Bildern zwei der wertvollsten
Spezifikationen der Firma versteckt waren.<br />
<br />
 Die Technik, die f&#252;r das Verbergen der Spezifikationen
innerhalb von Bildfiles eingesetzt wurde, ist die Hightech-Version
eines Prozesses namens Steganografie, der seit den Anf&#228;ngen
der aufgezeichneten Geschichte existiert, erkl&#228;rt Sayan
Chakraborty, Vizepr&#228;sident f&#252;r Engineering bei Sigaba. Im
R&#246;mischen Reich, sagt er, wurden Geheiminformationen auf den
geschorenen Kopf eines Boten t&#228;towiert. Sobald das Haar
nachgewachsen war, wurde der Bote mit seiner Nachricht auf dem
Skalp und einer irref&#252;hrenden Botschaft in der Hand
losgeschickt.<br />
<br />
 Im Reich der IT ersetzt die Steganografie ungebrauchte Bits in
einem Bild- oder Tonfile durch geheime Daten. Anstatt die Daten zu
sch&#252;tzen, wie es die Verschl&#252;sselung tut, verbirgt die
Steganografie ihre Existenz. In einer traditionellen
Verkehrsmusteranalyse erscheinen sie nicht.<br />
<br />
 Es gibt einige legitime Einsatzbereiche f&#252;r Steganografie,
sagen Forensikspezialisten. Berichte &#252;ber Terroristen, die die
Technik zur geheimen Kommunikation verwenden, werden von Experten
angezweifelt. "Die meisten Leute studieren die Steganografie
entweder als akademisches Spezialgebiet oder zur Befriedigung ihrer
Neugier, aber ich weiss von keiner Terroristengruppe, die sie
tats&#228;chlich einsetzen k&#246;nnte", sagt Chakraborty.<br />
<br />
 Nachdem er letztes Jahr in der Zeitung USA Today einen Artikel
&#252;ber Steganografie und Terrorismus gelesen hatte, beschloss
ein Student in Computerwissenschaften der Universit&#228;t
Michigan, seine Dissertation dar&#252;ber zu schreiben.<br />
<br />
 Neils Provos entwickelte Aufsp&#252;r- und Knacktools f&#252;r die
Analyse von Bildern nach Anzeichen von Steganografie wie
&#252;bergrosse Files und ungleichm&#228;ssiges Bitmapping. Er
testete die Tools und untersuchte mit ihnen zwei Millionen Bilder
auf der Website von Ebay, die als m&#246;glicher Ort f&#252;r das
Anbringen und Abrufen geheimer Botschaften gilt. Provos fand keinen
einzigen Fall von Steganografie. "Die Technik zieht viel
Aufmerksamkeit auf sich, das Feuer verglimmt und dann flackert
alles wieder auf", sagt Provos. "Aber sie wird sich nie
durchsetzen, weil nur geringe Mengen von Daten in Bildern versteckt
werden k&#246;nnen. Und wer geistiges Eigentum stehlen will,
kopiert die Daten besser auf eine Diskette und nimmt sie in der
Hosentasche mit."<br />
<br />
 Selbst wenn ein Fall von Steganografie vorliegt, ziehen es
Forensikexperten vor, mit der Untersuchung einfacherer Gebiete
anzufangen. Doch in einigen F&#228;llen k&#246;nnte der einzige
Beweis in einem Bild- oder Tonfile verborgen liegen. Darum
m&#252;ssen die Detektive auch auf Steganografie achten und die
Tools f&#252;r das Aufsp&#252;ren und Knacken mit sich f&#252;hren.
"Es stimmt, dass Steganografie wenig verwendet wird, aber wir
m&#252;ssen daran denken, wenn wir eine forensische Analyse
durchf&#252;hren", warnt Kenneth Shear, Vizepr&#228;sident bei
EED.<br />
<br />
 Steganografie entzieht dem digitalen Inhalt weniger wichtige
Informationen und injiziert an deren Stelle verborgene Daten. Dies
erfolgt &#252;ber das gesamte Bildfile. Hier eine Methode, wie das
durchgef&#252;hrt werden k&#246;nnte. Die Sequenz von 24 Bit
repr&#228;sentiert ein einzelnes Pixel in einem Bild. Seine drei
Bytes Farbinformation liefern insgesamt 256 verschiedene Werte
f&#252;r jede der Farben Rot, Gr&#252;n und Blau und kann darum
insgesamt 16,7 Millionen Farbt&#246;ne wiedergeben. Dieser
bestimmte Wert gibt ein dunkles Gr&#252;n wieder.<br />
<br />
 Nehmen wir elf dieser Pixel, die einen Teil eines einfarbigen
Hintergrundes wiedergeben. In der folgenden Sequenz wird das am
wenigsten wichtige Bit (das am weitesten rechte) eines jeden
acht-Bit-Bytes dazu benutzt, eine Textnachricht der vier Buchstaben
"Aha" in ASCII-Bin&#228;rcode zu verstecken. Sind die Bits hinter
elf Pixeln versteckt, belegt die Nachricht 32 dieser 264 Bits (rund
12 Prozent) und enth&#228;lt vier acht-Bit-Bytes. Nur 14 der 264
Bits (weniger als f&#252;nf Prozent) m&#252;ssen ge&#228;ndert
werden und nur sieben der 11 Pixels wurden ver&#228;ndert . Wenn
man statt 11 Pixel ein JPEG-File von 300 KByte hat, k&#246;nnte
eine Textnachricht von 36 KByte oder rund 6000 W&#246;rter
verborgen werden.<br />
<br />
 <b>Rechte und Pflichten beim Spionieren</b><br />
 Ken Segarnick, ehemals beratender Jurist f&#252;r United
Messaging, beantwortet Fragen zu den rechtlichen Folgen der
elektronischen &#220;berwachung am Arbeitsplatz.<br />
<br />
 Frage: Welche Rechte hat ein Angestellter beim Schutz seiner
Privatsph&#228;re am Arbeitsplatz?<br />
<br />
 Antwort: Was die Emails am Arbeitsplatz angeht, neigen
(amerikanische) Gerichte dazu, Anspr&#252;che der Mitarbeiter auf
Privatsph&#228;re bei &#220;berwachung durch den Arbeitgeber
abzuweisen. Eine Reihe von Gerichten haben festgestellt, dass ein
Angestellter kein Anrecht auf Privatsph&#228;re in der
Email-Kommunikation hat, die &#252;ber ein Email-System der Firma
l&#228;uft. Angestellte haben also gegen Arbeitgeber fast nichts in
der Hand, die ihre Emails durchschn&#252;ffeln. Ein
US-Bundesgericht ging sogar soweit zu sagen, dass ein Angestellter
&#252;berhaupt keine Privatsph&#228;re in seinem Arbeits-Email
habe, selbst wenn die Firma ihm versichere, dass eine solche
Kommunikation nicht untersucht werde. Fest steht allerdings, dass
ein Gericht h&#246;chst selten urteilen wird, ein Angestellter habe
ein Anrecht auf Privatsph&#228;re in seiner Email-Kommunikation,
wenn eine Vorschrift des Arbeitgebers klar festh&#228;lt, dass eine
solche Kommunikation &#252;berwacht wird. Arbeitgebern steht es
frei, die Verwendung der Netzwerke durch die Angestellten zu
&#252;berwachen, solange die Firma keine Arbeits- und
Diskriminierungsgesetze verletzt, beispielsweise indem sie
Gewerkschafter oder Minderheiten speziell beobachtet.<br />
<br />
 Frage: Meine Firma hat eine Vorschrift erlassen, die die
Verwendung von Unternehmens-Email f&#252;r pers&#246;nlichen
Gebrauch untersagt. Darf die Firma mein pers&#246;nliches AOL-Konto
lesen, wenn ich den Computer und den Internetanschluss im B&#252;ro
brauche, um den eigenen Briefkasten zu pr&#252;fen?<br />
<br />
 Antwort: Gerichtsentscheide halten fest, dass das Recht des
Arbeitgebers, Emails der Angestellten zu &#252;berwachen, auf der
Tatsache beruht, dass die Nachrichten &#252;ber Firmeneigene
Computerressourcen geleitet und gelagert werden. Die Tatsache, dass
die Nachrichten aus einem pers&#246;nlichen Konto wie Hotmail oder
AOL kommen, &#228;ndern die Begr&#252;ndungen f&#252;r diesen
Entscheid nicht, sofern eine Firmenvorschrift nicht explizit das
Gegenteil festh&#228;lt. In einem Entscheid hielt ein
Appellationsgericht fest, dass einem Angestellten keine Verletzung
der Privatsph&#228;re widerfuhr, als sein Arbeitgeber
Email-Nachrichten las, die in einem pers&#246;nlichen Ordner auf
seinem B&#252;rocomputer gelagert wurden. Das Urteil konzentrierte
sich auf die irrt&#252;mliche Vorstellung, dass der
pers&#246;nliche B&#252;ro-PC eines Angestellten gleichzusetzen sei
mit pers&#246;nlichem Eigentum.<br />
<br />
 Folgt man der Begr&#252;ndung dieses Gerichtes, scheint es keinen
Unterschied zu machen, ob der Arbeitgeber Nachrichten auf dem
Computer aus einem Arbeits-Emailkonto oder einem pers&#246;nlichen
Emailkonto las. Ein Angestellter hat kein Anrecht auf
Privatsph&#228;re f&#252;r die Inhalte einer Applikation oder eines
Files, die auf dem firmeneigenen Computer lagern. Weil die Firma
ausdr&#252;cklich die pers&#246;nliche Verwendung von Email
untersagt, tut man gut daran, die Firmencomputer und
-Internetanschl&#252;sse nicht f&#252;r den Zugriff auf den
pers&#246;nlichen elektronischen Briefkasten zu missbrauchen.<br />
<br />
 Frage: Firmen werden entweder wegen einer feindseligen
Arbeitsumgebung eingeklagt, wenn sie die Emailkonten der
Angestellten kontrollieren (Diskriminierung am Arbeitsplatz etc.)
oder wegen Verletzung der Privatsph&#228;re. Was ist die beste
Vorgehensweise?<br />
<br />
 Antwort: Die Risiken rund um Email werden in der heutigen
Informationsgesellschaft immer gr&#246;sser. Die Verantwortung
eines Arbeitgebers basiert auf dem juristischen Begriff des
"Responde at Superior". Hier liegt die Verantwortung f&#252;r das
Fehlverhalten der Angestellten beim Arbeitgeber, wenn es im Bereich
des Arbeitsumfeldes erfolgt. Ein Arbeitgeber kann auch direkt
verantwortlich sein f&#252;r Sch&#228;den, die aus einer
nachl&#228;ssigen &#220;berwachung der Aktivit&#228;ten der
Angestellten entstehen. Nach dieser Theorie ist der Arbeitgeber
direkt und nicht stellvertretend verantwortlich, auch bei
Handlungen ausserhalb des Arbeitsbereiches. Um eine solche Art der
Verantwortung nicht zu strapazieren, muss ein Arbeitgeber
vern&#252;nftige Vorsorge treffen und vermeiden, dass durch seine
Angestellten potenzieller Schaden entsteht. Ein Arbeitgeber also,
der Vorschriften und Prozeduren einf&#252;hrt, um diskriminierendes
oder bedrohendes Verhalten zu vermeiden und zu korrigieren, wird
eine wirksame Verteidigungswaffe gegen jede Klage haben, die wegen
indirekter Verantwortung oder nachl&#228;ssiger Kontrolle gegen ihn
erhoben wird. Um dies zu verst&#228;rken, haben viele Firmen
verschiedene Formen von Computer&#252;berwachungsprogrammen
eingef&#252;hrt, die vom Filtern des Inhalts bis zur Kontrolle der
Tastenhiebe reichen. Statistiken zeigen, dass der Anteil grosser
US-Firmen, die die Email-Nachrichten ihrer Angestellten
&#252;berwachen, von 14,9 Prozent in 1997 auf 46,5 Prozent in 2001
anwuchs, wie ein Umfrage der American Management Association
festh&#228;lt. Heute hat das Recht in diesem Punkt die Debatte
zugunsten der Firma entschieden. Angestellten bleibt wenig in der
Hand gegen Arbeitgeber, die Emails durchschn&#252;ffeln. Eine
&#252;berm&#228;ssige Kontrolle kann jedoch zu Problemen
f&#252;hren. Es k&#246;nnte sich f&#252;r eine Firma als sinnvoller
erweisen, sich das Recht der Email-&#220;berwachung zu jeder Zeit
und ohne weitere Benachrichtigung vorzubehalten, w&#228;hrend sie
die tats&#228;chliche Kontrolle auf Untersuchungen von
Email-Systemen konzentriert.<br />
<br />
 Frage: Ich schreibe gerade ein Dokument der besten Vorgehensweisen
f&#252;r die interne Email-Verteilung. Gibt es bereits eine
offizielle Vorschrift oder Richtlinie dazu?<br />
<br />
 Antwort: Ich habe eine Reihe von Artikeln gelesen &#252;ber
Email-Richtlinien, die vom Benutzer verlangen, dass er sich kurz
fasst, &#252;berlegt, bevor er eine Nachricht abschickt,
Email-Ketten vermeidet, die Verwendung von Grossbuchstaben
einschr&#228;nkt und die Verteilerlisten kurz h&#228;lt. Das Buch
"E-policy: How to Develop Computer-, Email- and Internet-
Guidelines to Protect your Company and Its Assets" von Michael
Overly, Verlag Amacom 1998, ist eine gute Ressource f&#252;r die
Email-Etikette und das Erstellen von Vorschriften. Das Einrichten
einer eigenen Politik ist jedoch nicht von der Hand zu weisen.
Heute gibt es keine unumst&#246;ssliche Vorschriftensammlung, die
die Arbeitgeber vor jedem Risiko und jeder Gefahr sch&#252;tzt.
Email-Vorschriften stecken noch in den Anf&#228;ngen. Gleichzeitig
verstricken sich Arbeitgeber immer tiefer in Klagen, die aus dem
Missbrauch entstehen. Angesichts des Flickenteppichs inkonsistenter
Vorschriften, die sich heute auf das Email am Arbeitsplatz
beziehen, ist es f&#252;r eine Firma am sichersten, ihre eigene
elektronische Infrastruktur und Arbeitsumgebung gut
einzusch&#228;tzen und Vorschriften f&#252;r das Versenden von
Botschaften an ihre spezifischen Bed&#252;rfnisse anzupassen.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

