<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span
class="txt-xl-black">Transatlantische Sammelwut</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Ein Jahr nach den
Terroranschl&#228;gen vom 11. September beginnen sich die
B&#252;rgerrechtler in den USA gegen die versch&#228;rften
&#220;berwachungsgesetze zu wehren. Tats&#228;chlich hat die
Sammelwut der Beh&#246;rden stark zugenommen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 13.09.2002<br />
 <b>Rubrik:</b> Hintergrund<br />
 <b>Autor:</b>&#160;<a href="../../impressum"
class="txt-link-red">Jens Stark</a><br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Die Abk&#252;rzung des
US-Gesetzes mit der Nummer 107-56 soll m&#246;gliche Kritiker
gleich mundtot machen:?USA-Patriot (Uniting and Strengthening
America by Providing Appropriate Tools Required to Intercept and
Obstruct Terrorism) heisst das 342 Seiten starke Paragraphenwerk,
das nur acht Tage nach den Terroranschl&#228;gen vom 11. September
2001 durchs Parlament gepeitscht wurde, bereits am 26. Oktober
desselben Jahres in Kraft getreten ist und zahlreiche
B&#252;rgerrechte aush&#246;hlt sowie den US-Datenschutz in Frage
stellt.<br />
<br />
 Obwohl sie Gefahr laufen, als unpatriotisch zu gelten, haben bald
ein Jahr nach dem Angriff auf die USA zwei Abgeordnete des
Repr&#228;sentantenhauses von ihrem Auskunftsrecht Gebrauch gemacht
und den Generalstaatsanwalt John Ashcroft um Informationen
&#252;ber die Anwendung der neuen &#220;berwachungsrechte
angegangen. Dem Republikaner James Sensenbrenner und dem Demokraten
John Conyers wurde bislang nur ein Teil ihrer insgesamt 50 Fragen
von der US-Regierung beantwortet. Jetzt versuchen die beiden, eine
Auskunft zu erzwingen.<br />
<br />
 Mittlerweile haben sich auch die B&#252;rgerrechtsgruppen in den
USA zu Wort gemeldet, allen voran die ACLU (American Civil
Liberties Union) und die EFF (Electronic Frontier Foundation). Nach
Ansicht von Barry Steinhardt, der bei der ACLU den Bereich "Technik
und Freiheit" betreut, hat Ashcroft einem Kongress den Patriot-Act
aufgetischt, der noch unter dem Schock des 11. September stand.
"Deshalb muss die Nation wissen, ob die zus&#228;tzliche Macht der
Regierung unser Leben sicherer macht oder einfach nur unfreier",
sagt Steinhardt und bezieht sich damit auf die Anfragen von
Sensenbrenner und Conyers. Das Schweigen der Regierung etwa zur
Frage, wie oft der Patriot-Act bereits angewendet wurde, k&#246;nne
doch nur bedeuten, dass er sehr oft angewendet w&#252;rde, folgert
er.<br />
<br />
 <b>Schn&#252;ffeln was das Zeug h&#228;lt</b><br />
 Tats&#228;chlich erlaubt der Patriot-Act das Anzapfen zahlreicher
Datensammlungen und die &#220;berwachung jeglichen Internet- und
E-Mail-Verkehrs - dies ohne das Plazet eines Richters. "Pass auf,
was Du als Suchbegriff bei Google eintippst", warnt dehalb die EFF
in ihrer Patriot-Analyse. Zudem k&#246;nnen Netzwerkadministratoren
und Internetprovider bei vermeintlichen "Computerverbrechern" ohne
Durchsuchungsbefehl die &#220;berwachung des elektronischen
Anschlusses des Betroffenen anordnen. Schliesslich sind Methoden,
wie das heimliche Durchsuchen von B&#252;ros und Wohnungen durch
die Bundespolizei FBI erlaubt.<br />
<br />
 "Das Problem mit dem Patriot-Act ist vor allem, dass Ashcroft und
seine Leute das gelockerte Gesetz sehr grossz&#252;gig auslegen",
kommentiert Anita Ramasastry, Rechtswissenschaftlerin an der
University of Washington, die Gesetzeslage. Dass die
US-Beh&#246;rden ihre neuen Rechte auch nutzen, best&#228;tigt
derweil EFF-Anwalt Lee Tien. "Uns ist von den ISP zu Ohren
gekommen, dass die &#220;berwachung sprunghaft angestiegen ist",
sagt er. Zudem w&#252;rden Daten von Kundentreuekarten von
Superm&#228;rkten, vergleichbar hierzulande mit Cumulus und
Supercard von Migros und Coop, durchgesehen.<br />
<br />
 Doch damit nicht genug: Auch, was der US-B&#252;rger in seiner
lokalen Bibliothek an B&#252;chern und sonstigen Medien ausleiht,
k&#246;nnte auf dem Tisch eines Beamten enden. Schliesslich landen
die Kundendatenbanken von Unternehmen und Vereinigungen in den
F&#228;ngen der Untersuchungsbeh&#246;rden. So &#252;bergab der
Verband der professionellen Tauchlehrer dem FBI die Daten aller
Tauchscheinempf&#228;nger, mehr als 100 000 an der Zahl, ohne diese
&#252;ber die Massnahme zu unterrichten. Grund der
Schn&#252;ffelei: Das FBI vermutet eine Unterwasser-Terrorattacke.
Doch EFF-Anw&#228;ltin und Taucherin Cindy Cohn bekam Wind von der
Sache und stellte die Vereinigung zur Rede. Diese argumentierte,
sie habe einer Gerichtsorder zuvorkommen wollen.<br />
<br />
 &#196;hnlich zuvorkommenden Gehorsam bef&#252;rchten deshalb
zahlreiche B&#252;rgerrechtler und Datensch&#252;tzer auch in
anderen F&#228;llen. Dies wurde denn auch unl&#228;ngst von der
Tageszeitung "Boston Globe" untermauert. Das Blatt befragte
Reiseb&#252;ros und -veranstalter, ob sie Kunden- und
Angestelltendaten den Bundesbeh&#246;rden &#252;bergeben
h&#228;tten. 64 Prozent bejahten dies. Nur 14 Prozent von ihnen
informierten hierauf die Betroffenen.<br />
<br />
 <b>Patriot ist erst der Anfang</b><br />
 Das im Oktober 2001 zusammengeschusterte Patriot-Gesetz war
offensichtlich erst der erste Streich von US-Pr&#228;sident George
Bush und seiner Regierung. Im Mai hat das FBI zusammen mit dem
Justizministerium vorgeschlagen, die &#220;berwachungskompetenzen
der Untersuchungsbeh&#246;rden auszuweiten. Demnach k&#246;nnte
etwa das FBI &#246;ffentlich zug&#228;ngliche Datenbanken nach
auff&#228;lligen Mustern auch dann durchsuchen, wenn es keinen
spezifischen Auftrag hat. Zudem d&#252;rften &#246;ffentliche
Einrichtungen wie Bibliotheken und Moscheen &#252;berwacht
werden.<br />
<br />
 Im Juli folgte der Cyber Security Enhancement Act. Dieses Gesetz
wurde vom Parlament verabschiedet und sieht im Wesentlichen
h&#228;rtere Strafen f&#252;r Hacker vor. So sollen die
Cybereindringlinge k&#252;nftig zu lebensl&#228;nglichen
Gef&#228;ngnisstrafen verknurrt werden k&#246;nnen. Zudem
d&#252;rfen die Untersuchungsbeh&#246;rden die
E-Mail-Headerinformationen, nicht aber den Inhalt der
elektronischen Nachrichten, von Internetprovidern anfordern, ohne
dass ein Untersuchungsrichter dies zuvor erlaubt h&#228;tte.<br />
<br />
 <b>Spitzelsystem gefordert</b><br />
 F&#252;r viele US-Politiker zu weit ging der Vorschlag des Weissen
Hauses, eine Gruppe freiwilliger Informationszutr&#228;ger zu
rekrutieren. Anvisiert waren etwa Brieftr&#228;ger und
Telefoninstallateure. Deren Beobachtungen w&#228;ren sodann in
einer gigantischen Datenbank gespeichert worden. Der Aufbau dieses
Spitzelwesens, das an die informellen Mitarbeiter der ostdeutschen
Staatsicherheit erinnert, musste auf Druck zahlreicher
Kongressabgeordneter und B&#252;rgerrechtler zurechtgestutzt
werden. Tips (Terrorism Information and Prevention System), so der
Name des Programms, wird jetzt auf Grenzschutzbeamte und
Z&#246;llner begrenzt.<br />
<br />
 Doch auch ein zur&#252;ckbuchstabiertes Tips ist f&#252;r EFF-Mann
Tien ein Horror: "Damit wird die Regierung auch Fakten &#252;ber
die B&#252;rger sammeln, die ungenau bis unwahr sind." Zudem
k&#246;nnten die Tips-Spitzel jemanden, den sie nicht m&#246;gen,
mit falschen Angaben ans Messer liefern. "Ein zweites
McCarthy-Zeitalter st&#252;nde uns bevor", mutmasst Tien und
erinnert damit an die 1950er Jahre, als Senator Joseph McCarthy
hinter allem und jedem "kommunistische Verr&#228;ter"
vermutete.<br />
<br />
 Was Tien und den B&#252;rgerrechtlern daher am meisten Sorgen
macht, sind nicht die neuen Gesetze und Verordnungen an sich,
sondern deren Umsetzung und die Tatsache, dass sich Beh&#246;rden
und Regierung dar&#252;ber ausschweigen. "Wir k&#246;nnen Bush und
seine Leute nicht zur Rechenschaft ziehen", lautet sein
Fazit.<br />
<br />
 <b>Die EU schn&#252;ffelt noch besser</b><br />
 W&#228;hrend sich in den USA Widerstand gegen die getroffenen
Massnahmen regt, sei es in Europa relativ ruhig, meint Maurice
Wessling, Sprecher von Edri (European Digital Rights), einer Gruppe
von B&#252;rgerrechtlern, die die Datenschutzgesetzgebung in der
Europ&#228;ischen Union (EU) beobachtet. "Viele Regierungen konnten
aber nach dem 11. September Gesetze durchboxen, die sie vorher
nicht h&#228;tten verabschieden k&#246;nnen", ist Wessling
&#252;berzeugt. Als "schlimmstes" Beispiel nennt er England. Die
dort in Kraft getretenen Gesetze fordern die Internetprovider auf,
s&#228;mtlichen E-Mail- und Internetverkehr &#252;ber Monate
aufzubewahren, so dass die Untersuchungsbeh&#246;rden diesen nach
verd&#228;chtigen Schreiben durchforsten k&#246;nnen. Laut Wessling
sei auch die EU daran, ihre Mitgliedstaaten dazu aufzufordern,
Gesetze auszuarbeiten, in denen die Internetprovider dazu
verpflichtet w&#252;rden, E-Mails &#252;ber den Zeitraum eines
ganzen Jahres zur&#252;ckzuhalten. "Dies ist eine dramatische
Entwicklung", kommentiert Wessling. "Bislang musste ein Verdacht
vorliegen, um E-Mails zu speichern. Doch k&#252;nftig k&#246;nnte
der Internetverkehr von uns allen ohne Grund abgelegt werden",
f&#252;hrt er aus.<br />
<br />
 Ian Brown, Sprecher der Londoner "Foundation for Information
Policy Research", sieht das &#228;hnlich. Er ist zudem
&#252;berzeugt, dass die US-Regierung mit solchen Gesetzen nicht
durchk&#228;me. "In den USA kann das FBI nur die Daten anzapfen,
die die Internetprovider f&#252;r das Erstellen von Rechnungen
zur&#252;ckhalten", erkl&#228;rt er. "W&#252;rden die Beh&#246;rden
mehr verlangen, k&#228;me es zu einem Aufstand", ist Brown
&#252;berzeugt. "Doch hier in Europa wird das einfach ohne
Widerstand verabschiedet", sagt er.<br />
<br />
 <b>Geldsegen f&#252;r IT-Abteilung</b><br />
 Mit und ohne sch&#228;rfere Gesetze: Weltweit werden derzeit die
Geheimdienste und Polizeikr&#228;fte informationstechnisch
hochger&#252;stet. So hat US-Pr&#228;sident Bush vorgeschlagen, im
Haushalt f&#252;r das Jahr 2003 insgesamt 50 Milliarden Dollar
f&#252;r die computertechnische Aufr&#252;stung aller Beh&#246;rden
bereitzustellen.<br />
<br />
 Das sei auch bitter n&#246;tig, gibt Mark Forman, Top-IT-Mann des
Weissen Hauses zu. "Hier gibt es sozusagen nur Insell&#246;sungen,
die nicht miteinander kommunizieren k&#246;nnen", kommentiert er
die EDV-Situation in der Verwaltung der Weltmacht. Auch die
einzelnen Systeme f&#252;r sich brillieren oft durch ihre
Unf&#228;higkeit. So konnten die Fahnder nach dem vereitelten
Anschlag von Richard Colvin Reid, der im Flugzeug Sprengstoff in
seinem Schuh zur Detonation bringen wollte, nicht im Computersystem
des Verkehrsministeriums danach suchen, ob es sich dabei um einen
Einzelfall oder ein Muster handle. Der Grund: Das System konnte
nicht nach den Begriffen "Schuh" und "Bombe" durchsucht werden. Und
dabei handelt es sich nota bene nicht um einen vorsintflutlichen
Rechner, sondern um eine relativ neue Anlage.<br />
<br />
 "Das Problem ist nicht das Sammeln der Daten, es ist die richtige
Analyse", folgert Bruce Schneier, Sicherheitsexperte und
Gr&#252;nder der Firma Counterpane Internet Security. "Das FBI hat
ja nach den Anschl&#228;gen vom 11. September gezeigt, dass es im
Nu alle m&#246;glichen Daten &#252;ber die Terroristen
pr&#228;sentieren konnte. Wir h&#228;tten das aber alles vorher
wissen m&#252;ssen", moniert er. "Das Sammeln von Informationen
n&#252;tzt nichts", ist auch die Rechtswissenschaftlerin Ramasastry
&#252;berzeugt, "die Daten m&#252;ssen vielmehr sinnvoll zueinander
in Verbindung gebracht werden." Doch die Pl&#228;ne der USA?und der
EU deuten darauf hin, dass k&#252;nftig vor allem Daten gesammelt
werden.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

