<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Sicherheit
schreit nach guter Kommunikation</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Der Security-Chef
muss das zweitwichtigste Gut seiner Firma vor b&#246;sen Buben
sch&#252;tzen. Dazu stehen ihm diverse Hilfsmittel zur
Verf&#252;gung. Er erweitert seine M&#246;glichkeiten durch die
Teilnahme an Gespr&#228;chskreisen, die vom Staat gef&#246;rdert,
aber auch von Privaten ins Leben gerufen werden. In der Praxis
sch&#252;tzt sich der Kenner mit Firewalls und Schutzprotokollen
gegen Angriffe auf sein Unternehmen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 13.12.2002<br />
 <b>Rubrik:</b> Report<br />
 <b>Autor:</b>&#160;Mary Kathleen Flynn (Mitarbeiterin CSO), Chad
Robinson (Mitarbeiter CSO)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Als starke, schweigsame
Typen, denen man ohne weiteres die tiefsten Geheimnisse anvertrauen
kann, stellen wir uns die Sicherheitsspezialisten vor. Insider
allerdings wissen, Sicherheit verlangt gute Kommunikation, und die
sehr ausgepr&#228;gt. Heutige Spitzen-CSOs (Chief Security
Officers) nutzen Sicherheitsforen, an denen sie beste
Vorgehensweisen austauschen, &#252;ber Bedrohungen und
Verletzlichkeiten reden und Berufsgeheimnisse erl&#228;utern.<br />
<br />
 Ron Baklarz ist ein gutes Beispiel. Der
Informationssicherheitschef des amerikanischen Roten Kreuzes ist
Mitglied mehrerer formeller Gruppen, die sich des Sammelns und
Austauschs von Informationen verschrieben haben, &#228;hnlich wie
das Infragard-Programm des FBI. Dennoch fand er k&#252;rzlich
heraus, dass seine Informationsbed&#252;rfnisse bei weitem nicht
abgedeckt sind. Baklarz rief deshalb mit einigen Kollegen die Chief
Security Officer's Round Table (CSORT) ins Leben, um individuelle
Kontakte zu pflegen und sich gegenseitig beim Aufsp&#252;ren
spezifischer, wirksamer Informationssicherheitstools zu
helfen.<br />
<br />
 Industrievereinigungen wie die Information Systems Security
Association (ISSA) und die American Society for Industrial Security
(ASIS) unterst&#252;tzen seit Jahren solche Sicherheitsnetzwerke.
Heute entstehen neue M&#246;glichkeiten f&#252;r CSOs, um sich mit
Kollegen zu treffen, mit Vertretern der Justizbeh&#246;rden und mit
Personal aus dem &#246;ffentlichen Sektor. Drei Kategorien lassen
sich einteilen: Industriespezifische Gruppen, die sich am besten
durch die Information Sharing and Analysis Centers (ISAC)
illustrieren lassen; Vertreter aus geografischen Regionen
einschliesslich Sektionen von Infragard und Electronic Crimes Task
Force des amerikanischen Geheimdienstes; sowie private
Unternehmungen wie die CSORT von Baklarz. Sie alle bringen CSOs
innerhalb einer Region zusammen. Jede Gruppe dient einem anderen
Zweck und aus diesem Grund finden auch die wenigsten CSOs eine
einzige Gruppe, die all ihren Anforderungen entspricht.<br />
<br />
 <b>Information-Sharing</b><br />
 Die ISACs datieren aus der Zeit vor Y2K in der
Clinton-Administration, werden aber vom aktuellen Pr&#228;sidenten
weiter unterst&#252;tzt. Sie sollen die Sicherheit einer Industrie
steigern, indem sie die Sicherheitsverantwortlichen
zusammenf&#252;hren und sie dazu bringen, mit der Regierung und
untereinander zu kommunizieren. Der Aufbau einer
Vertrauensumgebungist massgeblich. Ein erfolgreiches ISAC
gew&#228;hrleistet, dass propriet&#228;re, wettbewerbswirksame
Interessen gesch&#252;tzt bleiben, wobei gleichzeitig wichtige
Informationen allen zug&#228;nglich werden. Im wesentlichen geht es
dabei um die Sicherung wirtschaftlicher Sektoren, die Teil der
Infrastruktur eines Landes sind wie Finanzdienste,
Elektrizit&#228;tsversorgung,&#214;l, Gas, Telekommunikation und
das Transportwesen. Das bedeutendste ISAC ist jenesder
Finanzindustrie - FS-ISAC. Es wurde im Oktober 1999 gegr&#252;ndet
und besteht aus einer sicheren Datenbank, Analysetools und Mitteln
f&#252;r das Sammeln und Verteilen von Information. Mitglieder
k&#246;nnen diese Informationen &#252;ber die Website
www.fsisac.com beziehen, die teilweise allgemein zug&#228;nglich
ist. J&#228;hrlich finden zwei Sitzungen statt. Als Beispiel
f&#252;r die Effizienz der Gruppierung wird das Virus
Worm.Explore.Zip genannt: &#220;ber einen Telefonbaum wurden
FS-ISAC-Mitglieder volle acht Stunden vor der &#214;ffentlichkeit
gewarnt.<br />
<br />
 W&#228;hrend sich ISACs auf die Verbesserung der Kommunikation
innerhalb einer bestimmten Industrie konzentrieren, geht es bei
Infragard um das Austauschen von Informationen zwischen dem
&#246;ffentlichen und dem privaten Sektor: Besonders zwischen dem
FBI und seinem National Infrastructure Protection Center einerseits
sowie den Unternehmen, der Akademie und den staatlichen wie lokalen
Ordnungsh&#252;tern andererseits.<br />
<br />
 1996 vom FBI Cleveland entwickelt, umfasst Infragard heute alle 56
B&#252;ros des FBI sowie 16 Filialen in gr&#246;sseren
St&#228;dten. Erste B&#252;ros wurden 1995 in New York City ins
Leben gerufen. Die Elektronic Crimes Task Force des
US-Geheimdienstes gleicht stark Infragard. Infragard-B&#252;ros
werden von Mitgliedern aus dem Privatsektor und einem FBI-Vertreter
getragen. Es gibt zwei Mitgliederklassen: Normale und
sichere.<br />
<br />
 Die normalen werden vom FBI-Agenten bewilligt, die sicheren
Mitglieder m&#252;ssen vom FBI-Hauptquartier gr&#252;nes Licht
erhalten. Treffen mit 40 bis zu mehreren hundert Personen finden
monatlich oder quartalsweise statt. Das FBI will damit die
Sicherheit des privaten Sektors unterst&#252;tzen, aber auch
Beziehungen kn&#252;pfen, damit skeptische CSOs eher willens sind,
Angriffe und Einbr&#252;che zu melden.<br />
<br />
 <b>Regionale Treffen</b><br />
 Das rasche Wachstum von ISACs, Infragard- und Electonic
Crimes-Gruppen beweist ihren Nutzen. Trotzdem w&#252;nschen sich
viele CSOs weniger formale, interaktivere Veranstaltungen. Carl
Lorenzo, CSO der Versicherung Deltanet unterh&#228;lt sich ab und
zu mit anderen CSOs, die er an ISSA-Treffen kennenlernte, um
Strategien &#252;ber bestimmte Bedrohungen wie die Viren Nimda und
Code Red auszutauschen. Er s&#228;he gerne ein monatliches oder
zweimonatliches pers&#246;nliches oder Telekonferenztreffen
s&#228;mtlicher CSOs in seiner Region, um die "Ereignisse zu
besprechen, die f&#252;r die Infrastruktur und Sicherheit unserer
Firmen wichtig erscheinen".<br />
<br />
 In New York City wurde vor rund acht Jahren ein Gr&#252;ppchen von
Sicherheitsprofis aus der Finanzindustrie gegr&#252;ndet. Rund 20
Sicherheitsverantwortliche tauschen dabei regelm&#228;ssig
Erfahrungen aus. Es gibt weder Mitgliedsgeb&#252;hren noch
spezifische Anforderungen, und die Gruppe tr&#228;gt auch keinen
Namen. Zwischen den Treffen h&#228;lt sich die Gruppe per E-Mail
auf dem Laufenden.<br />
<br />
 Weil die Gruppe schon seit einigen Jahren besteht und sich die
Mitglieder alle kennen, herrscht Vertrauen. Die meisten Teilnehmer
kommen aus dem Rechtsbereich und sind sich Vertraulichkeit und den
Schutz propriet&#228;rer Information gewohnt.<br />
 Die Gruppe CSORT von Ron Baklarz ist etwas formeller als die New
Yorker Vereinigung. Rund 20 Mitglieder nehmen an w&#246;chentlichen
Konferenzgespr&#228;chen &#252;ber Vorschriften teil, die die
Informationssicherheit beeinflussen k&#246;nnten, sowie &#252;ber
Viren und VPN-L&#246;sungen. Er hat mit eigenen Mitteln eine
Website installiert, um weitere Mitglieder anzulocken:
www.csort.org. Seine Gruppe konzentriert sich auf die gemeinsame
Evaluation von Tools f&#252;r die Informationssicherheit. Das
aktuelle Klima, sagt Baklarz, verlange aus Budgetgr&#252;nden
ROI-Analysen von Sicherheitstools, wegen des gesteigerten
Bed&#252;rfnisses nach Produkten, die garantiert auch
funktionieren.<br />
<br />
 Mary Kathleen Flynn ist Mitarbeiterin der Zeitschrift CSO.<br />
<br />
 <b>Richtiger Firewall-Einbau</b><br />
 Firewalls m&#252;ssen nicht nur installiert werden. Erst
regelm&#228;ssige Updates und eine sorgf&#228;ltige Pflege holen
den gr&#246;ssten Nutzen aus ihnen heraus. Dazu m&#252;ssen sie mit
den Applikationsanforderungen wachsen, und das sollte man unbedingt
schon beim Erstellen des Budgets bedenken. Ausserdem m&#252;ssen
die Sicherheitstechniken j&#228;hrlich revidiert werden, mindestens
aber dann, wenn &#196;nderungen anstehen.<br />
<br />
 Die Marktforscherin Robert Frances Group h&#228;lt Firewalls
f&#252;r wesentliche Elemente in der Sicherheitsarchitektur einer
Firma. IT-Leiter sollten deshalb Profile f&#252;r die Anwendung im
Unternehmen erstellen: Sogenannte Business Application Profiles
(BAP), welche die Sicherheitsanforderungen f&#252;r jede
Applikation in der Firma festhalten. IT-Leiter sollten mit besten
Vorgehensweisen angemessene Bereiche f&#252;r die Einf&#252;hrung
von Firewalls identifizieren und dann garantieren, dass sie auch
eingebaut und gepflegt werden.<br />
<br />
 Die Marktforschungsfirma h&#228;lt in ihrer Studie fest, dass
keine zwei Firmen gleiche Einsatzbereiche von Applikationen und
Sicherheitsanforderungen haben. IT-Leiter sollten mit BAPs die
Sicherheitsanforderungen f&#252;r jede Applikation oder jeden
Bereich festhalten. Sie sollten in diesen Profilen Risikofaktoren
wie Kommunikationsverbindungen zu Gesch&#228;ftspartnern, Kunden,
entfernten Angestellten und Herstellern auflisten.<br />
<br />
 Wenn Sicherheitsanforderungen und Risikofaktoren einer Applikation
feststehen, k&#246;nnen Firewalls als eine Komponente
eingef&#252;hrt werden, die diese Anforderungen erf&#252;llt. Die
aber sollten nicht als Allheilmittel betrachtet werden. Vielmehr
sollten IT-Leiter Firewalls als Element in einer umfassenden
Sicherheitsstrategie betrachten und sie mit anderen Technologien
wie Verschl&#252;sselung, Einbruchschutzsysteme,
Virenschutzsoftware einsetzen.<br />
<br />
 Die besten Vorgehensweisen sind das Ergebnis von
Benutzeranforderungen in einem vorgegebenen Bereich und sollten
nicht als Einheitsbeschreibung f&#252;r die Firewall-Installation
gelten. IT-Leiter sollten selber beurteilen, in welchen Bereichen
Firewalls eingebaut werden m&#252;ssen. Sie sollten auch eigene
Vorgehensweisen f&#252;r deren Einbau aufstellen, damit sie die
Sicherheitsanforderungen f&#252;r ihre Firma am besten
erf&#252;llen k&#246;nnen.<br />
<br />
 Firewalls enthalten im Grunde wichtige Filterfunktionen f&#252;r
den Netzwerkverkehr und sch&#252;tzen damit Unternehmensressourcen
vor unbefugtem Zugriff. Wenngleich Firewalls im allgemeinen
unkomplizierte Ger&#228;te sind, ist eine ordentliche Installation
nicht immer eine leichte Sache.<br />
<br />
 <b>Installationsgrunds&#228;tze</b><br />
 IT-Leiter sollten in ihrem Evaluationsprozess Profile von
Unternehmensapplikationen erstellen und die
Sicherheitsanforderungen ihrer Firma beschreiben. Diese Profile
sollten Applikationen wie Datenbanken, E-Mail, File- und Webserver
abdecken sowie Risikofaktoren wie die Sicherheitsanforderungen des
Rechenzentrums, Kommunikationsverbindungen zu
Gesch&#228;ftspartnern und Herstellern. Damit sie ihre Firewalls
hochwirksam installieren, sollten folgende Vorgehensweisen
ber&#252;cksichtigt werden.<br />
<br />
 1. Es gibt unterschiedliche Arten von Firewalls und jede hat ihren
Platz in der Firma. Paketfilter sind einfacher zu installieren und
weniger teuer, doch Applikationsschichten-Gateways bieten einen
robusteren Schutz f&#252;r kritische Systeme.<br />
<br />
 2. Firewalls k&#246;nnen nicht vor Fehlkonfiguration von
Applikationen sch&#252;tzen.<br />
<br />
 3. Firewallschutz reicht selten aus. Firewalls sollten installiert
werden, um Zonen von bewilligtem Verkehr zu schaffen und
Applikationen in Gruppen mit &#228;hnlichen
Sicherheitsanforderungen aufzuteilen.<br />
<br />
 4. Zus&#228;tzlich zu ihrer traditionellen Aufgabe des Schutzes
&#246;ffentlicher Server vor Gefahren, die vom Internet drohen,
sind Firewalls n&#252;tzlich f&#252;r den Schutz interner
Systeme.<br />
<br />
 5. Beim Installieren mehrerer Firewalls steigen die
Sicherheitsniveaus, dennoch sollte man nicht &#252;bertreiben. Wie
in anderen Systemen und Ger&#228;ten gibt es auch hier einen Punkt,
an dem der Gewinn zur&#252;ckgeht, wenn die Installationen keinen
ROI mehr erbringen.<br />
<br />
 6. Firewalls sollten mit anderen Technologien wie
Einbruchsmeldesystemen gekoppelt werden.<br />
<br />
 7. Sicherheit ist nur so gut wie der neuste Sicherheitsflicken.
Deshalb sollten Systeme regelm&#228;ssig und p&#252;nktlich
aktualisiert werden.<br />
<br />
 8. Firewalls sollten kontinuierlich &#252;berwacht werden, obwohl
sie keine Einbruchsmeldesysteme sind.<br />
<br />
 9. Bei der Pr&#252;fung von Logaufzeichnungen sind
Fehlschl&#228;ge ebenso wichtig wie erfolgreiche Verbindungen.
Ausgehende Verbindungen sollten ebenso gepr&#252;ft werden wie die,
die hereinkommen.<br />
<br />
 10. Wenn Alarme zum Administrator gelangen, sollten sie eingestuft
werden, um Fehlmeldungen zu kontrollieren.<br />
<br />
 11. Firewalls sind keine Ger&#228;te, die man vergessen kann, wenn
sie einmal installiert sind. Wenn sich die
Applikationsanforderungen &#228;ndern, sollten Firewalls
aktualisiert werden, um mit den &#196;nderungen Schritt zu
halten.<br />
<br />
 12. Wie bei anderen Systemen sollten nicht genutzte Dienste
ausgeschaltet werden.<br />
<br />
 Firewalls sch&#252;tzen eine Unternehmensapplikation auf zwei
Arten. Als erstes mit einem Paketfilter, der den Verkehr blockiert.
Sie basieren auf Kriterien wie Herkunft oder Ziel des Paketes.
Einige Paketfilter f&#252;hren zus&#228;tzlich eine
"statusabh&#228;ngige Inspektion" durch, die es ihnen erlaubt, den
Verkehrsfluss aufgrund der Verbindungszust&#228;nde zu
kontrollieren. Ein zustandsabh&#228;ngiger Paketfilter k&#246;nnte
beispielsweise verwendet werden, um Clientsysteme zu sch&#252;tzen,
indem eintreffender Verkehr abgeblockt wird, sofern er nicht eine
Antwort auf eine Anfrage eines Client ist.<br />
<br />
 Die zweite Art von Firewall ist ein Gateway auf
Applikationsniveau, der als Mittler f&#252;r ein gesch&#252;tztes
System dient. Gateways auf Applikationsniveau liefern
zus&#228;tzliche Sicherheit, indem sie Datensessionen normalisieren
und darauf achten, dass nur normalisierter Inhalt vom
gesch&#252;tzten System empfangen wird. Hier die Applikationen,
f&#252;r die solche Gateways erh&#228;ltlich sind: E-Mail,
Filetransfer und Web. Weil sie zus&#228;tzliche Funktionen
enthalten, sind Applikationsniveau-Gateways teurer als Paketfilter
und unter Umst&#228;nden auch schwieriger zu konfigurieren. Sie
k&#246;nnen jedoch einen robusteren Schutz bieten.<br />
<br />
 Allerding kann keine Art von Firewall schlecht konfigurierte
Systeme ordentlich sch&#252;tzen. Firewalls sollten nicht als
Mittel betrachtet werden, um Systeme vor Angriffen zu
sch&#252;tzen. Beispielsweise enth&#228;lt ein
Applikationsschichten-Gateway zwar ausf&#252;hrlichen Schutz
f&#252;r Webserver. Wenn die Web-basierte Verwaltungsschnittstelle
dieses Servers aktiviert, aber nicht passwortgesch&#252;tzt wird,
bleibt das System jedoch so verletzlich, als w&#228;re
&#252;berhaupt keine Firewall vorhanden. Die meisten Firmen bieten
Platz f&#252;r mehr als eine Firewall und die IT-Leiter sollten
nach Gelegenheiten Ausschau halten, um sie zu installieren, wo
immer es m&#246;glich ist.<br />
<br />
 <b>IT-Leiter schauen voraus</b><br />
 Sie sind allerdings nur ein Element in einer n&#246;tigen und
angemessenen Sicherheitsstrategie. Die IT-Leiter sollten es
vermeiden, sie wie wild &#252;berall einzubauen. Stattdessen
konzentriert man sich besser darauf, seine mageren Budgetdollars
f&#252;r Firewalls auszugeben, die den h&#246;chsten ROI bringen
und die &#252;brigbleibenden Cents f&#252;r die Ausbildung der
Administratoren, Einbruchsschutzsysteme und
Netzwerk-Sicherheitsaufzeichnungen.<br />
<br />
 Wie bei jedem System, bei dem Sicherheit eine Rolle spielt,
sollten IT-Leiter darauf achten, dass Firewall-Sicherheitsflicken
sofort installiert werden, nachdem sie vom Hersteller
ver&#246;ffentlicht wurden. Weil Firewalls jedoch nicht so
h&#228;ufig aktualisiert werden wie andere Produkte, ist es
manchmal schwer herauszufinden, wann ein Flicken erh&#228;ltlich
ist. IT-Leiter sollten die Hersteller regelm&#228;ssig anfragen, ob
eine automatische Benachrichtigung und Verteilerkan&#228;le
f&#252;r solche Flicken erh&#228;ltlich sind.<br />
<br />
 Wenn automatische Update-Bulletins oder Verteilerkan&#228;le
fehlen sollten Angestellte dazu verknurrt werden, dem Hersteller
mindestens einmal pro Woche auf die Zehen zu treten. Fast alle
Hersteller unterhalten Web-basierte Support-Portale, von denen die
Flicken heruntergeladen werden k&#246;nnen. IT-Leiter sollten den
Angestellten ein vollst&#228;ndiges Inventar von installierten
Ger&#228;ten zukommen lassen, damit alle Aktualisierungen zur
Verf&#252;gung stehen.<br />
<br />
 Und selbst wenn die meisten Firewalls keine ausf&#252;hrliche
Liste aller Dienste bieten, enthalten manche von ihnen doch die
M&#246;glichkeit, wenigstens einige davon zu aktivieren oder
auszuschalten. IT-Leiter sollten nur die minimalen Konfigurationen
in Firewalls installieren, um den Sicherheitsanforderungen zu
gen&#252;gen. Wenn beispielsweise das Simple Network Management
Protocol (SNMP) f&#252;r die Ger&#228;teverwaltung nicht
ben&#246;tigt wird, sollte es ausgeschaltet werden, weil sogar so
grundlegende Dienste wie dieser ein Ziel f&#252;r Angriffe
bieten.<br />
<br />
 Firewalls sollten nicht als Ersatz von Einbruchschutz-Produkten
(IDS) dienen, aber sie k&#246;nnen wertvolle Informationen f&#252;r
die Identifikation von Angriffsversuchen und -mustern und sogar
f&#252;r Systemprobleme liefern.<br />
<br />
 Das Separieren von Systemarten und -verantwortungen hilft beim
Aufsp&#252;ren der verschiedenen Angriffsarten. Wenn die Ressourcen
es erlauben, sollten IT-Leiter separate Systeme f&#252;r
E-Mail-Verkehr oder Client-Webbrowsing installieren. Damit
vereinfachen sie das Erstellen von Regeln f&#252;r Firewalls, und
dies wiederum wirkt sich wohltuend auf andere
Sicherheitsmechanismen wie IDS-Produkte aus.<br />
<br />
 Schliesslich sollten IT-Leiter daran denken, dass Firewalls nur
wirksam sind, wenn sie mit den Applikationsanforderungen wachsen.
Daran sollte man bereits beim Erstellen des Budgets denken. Die
Sicherheitstechniken sollten j&#228;hrlich revidiert werden oder
jedes Mal, wenn die Applikationsanforderungen wachsen. Firewalls
bieten nur dann einen wesentlichen Schutz f&#252;r die Systeme,
wenn sie ordentlich eingef&#252;hrt und konfiguriert sind.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

