<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Das Gleiche
in freundlicherem Gr&#252;n</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Nach dem
schw&#228;rzesten Jahr der IT-Geschichte hoffen alle, dass es 2003
wieder leicht aufw&#228;rts geht. Drahtlostechnikenund Webservices
werden das Tempo bestimmen. Die beiden Trendthemen werden auch die
Sicherheitsanforderungen weiter ansteigen lassen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 13.12.2002<br />
 <b>Rubrik:</b> Hintergrund<br />
 <b>Autor:</b>&#160;Desir&#233;e Sterchi<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">&#171;Notieren Sie sich
den 21. Juni 2003 mit einem fetten Dollarzeichen im Kalender - dann
startet die Information Technology erneut durch.&#187; F&#252;r
Brian Halla, IT-Prophet und CEO des Halbleiter-Traditionshauses
National Semiconductor, ziehen Mitte 2003 nicht nur die goldenen
Jahre ins Land, vielmehr glaubt er zu wissen, dass der Internetboom
noch gar nicht begonnen hat. Als Zugpferd des prognostizierten
Aufschwungs, der wider dem gesunden Volksempfinden s&#228;mtliche
Grenzen sprengen soll, f&#252;hrt Halla Drahtlostechniken ins Feld,
die in einer kompletten Digitalisierung unseres Alltagslebens
m&#252;nden sollen.<br />
<br />
 Halla, der unter anderem in enger Kooperation mit Microsoft
werkelt, liegt trotz seiner diesj&#228;hrigen
Comdex-Beschw&#246;rungsrede nicht in allen Punkten fehl. Erstens
geht das Jahr 2002 mit einem weltweiten Umsatzr&#252;ckgang von 2,3
Prozent als bislang schw&#228;rzestes Jahr in die Annalen der
IT-Industrie ein und stellt laut einschl&#228;gigen Analysen von
IDC, Gartner, Merrill Lynch und Goldmann Sachs den absoluten
Tiefpunkt dar. Folglich kann es 2003 nur aufw&#228;rts gehen - im
Schnitt wird ein Umsatzzuwachs von zwei bis f&#252;nf Prozent
erwartet. Zweitens k&#246;nnten diverse Drahtlosapplikationen in
Form von mobilen Mikrocomputern und Handhelds einerseits, in der
zunehmenden Adaption von Breitband und WLAN (Wireless Local Area
Network) andererseits tats&#228;chlich als Trendmot&#246;rchen der
IT-Wirtschaft wirken. Grunds&#228;tzlich, so die
Marktschn&#252;ffler konsterniert, gilt allerdings: Vor dem vierten
Quartal 2003 wird die IT-M&#252;hle kaum feiner mahlen. Erst im
Zuge einer Gesamtwirtschaftserholung k&#246;nne auch der IT-Sektor
aufatmen. Bis dahin schreitet die Konsolidierung weiter fort,
gekoppelt mit einer zus&#228;tzlichen Verschiebung weg vom
Anbieter- hin zu einem Nachfragemarkt. Der Preisdruck wird also
andauern. Die Zeiten, in denen Technik um der Technik willen zu
astronomischen Preisen gekauft wurde, sind bis auf weiteres
Geschichte.<br />
<br />
 <b>Die Drahtlosrevolution</b><br />
 Der Erneuerungszyklus mobiler Handsets von gegenw&#228;rtig
zweieinhalb Jahren d&#252;rfte 2003 erstmals wieder positive
Wirkung zeigen. Nokia prognostiziert einen Wachstumsschub von zehn
Prozent auf 440 Millionen verkaufte Einheiten. Auch IDC gibt sich
nach einem miserablen 2002 &#228;usserst optimistisch und rechnet
mit einem j&#228;hrlichen Verkaufsplus von 9,5 Prozent auf ein
Gesamttotal von 606 Millionen Handhelds f&#252;r 2006. "Uns
erwartet eine regelrechte Drahtlosrevolution", sch&#228;tzt der
zust&#228;ndige IDC-Programmmanager f&#252;r Smartphones, Kevin
Burden. Die n&#228;chste IT-Welle, da ist er sich sicher, wird mit
der Verbreitung von Wireless-Produkten einhergehen und zu einem
Paradigmenwechsel f&#252;hren, wie wir ihn bislang nur vom Internet
her kannten. Kein Zweifel bestehe auch darin, dass 2003 mit einer
Vielzahl von Handhelds und Zwittern aus Handy und PDA gerechnet
werden darf. Die Handsets k&#246;nnten zwar noch nicht mit Captain
Kirks Kommunikationskn&#246;pfen verglichen werden, d&#252;rften
aber Schritt f&#252;r Schritt brauchbarer werden.<br />
<br />
 Das Fazit einer Umfrage an der Networlds-Messe in Dresden vom
Oktober dieses Jahres l&#228;sst ebenfalls den Schluss zu, dass
Wireless als eine der Schl&#252;sseltechnologien des Jahrzehnts
gelten darf. So ist eine &#252;berragende Mehrheit der Befragten
sicher, dass vernetzte Computersysteme kombiniert mit mobil
verf&#252;gbaren Mikrorechnern 2010 allt&#228;glich sein
werden.<br />
<br />
 <b>Das Jahr der Klingen</b><br />
 Im Bereich Personalcomputer scheiden sich die Geister. Noch vor
einem Monat prognostizierte IDC, dass die Preise im Zuge des
Wettbewerbgerangels weiter fallen und den Herstellern summa
summarum ein hartes Jahr mit sinkenden Margen ohne nennenswertes
Umsatzwachstum bescheren. Denn von Seiten der Konsumenten werde der
Trend zu standardisierten Plattformen, die einfach in der Wartung
und zugleich preiswert sind, anhalten. J&#252;ngst weht das
Prognosef&#228;hnlein der Marktforscherin aber wieder gen
S&#252;den. So will man f&#252;r 2003 ein Wachstum von mehr als
acht Prozent, f&#252;r 2004 gar elf errechnet haben - dies
allerdings bez&#252;glich der St&#252;ckzahlen. Bei einem
anhaltenden Preiszerfall d&#252;rfte damit trotz positiver
Stimmungsmache kaum wesentlich mehr herausschauen als in diesem
Jahr. Denn die &#246;ffentlichen Verwaltungen ziehen die
Kostenbremse und die Unternehmensinvestitionen werden weiterhin
mager bleiben.<br />
<br />
 Im Zuge der Budgetk&#252;rzungen und Sparmassnahmen k&#246;nnte
die Nachfrage nach Blade-Servern allerdings kr&#228;ftig in die
H&#246;he schiessen. Da die Einsparung gegen&#252;ber
herk&#246;mmlichen Maschinen aufgrund gestauchter Gr&#246;sse und
tieferem Stromverbrauch mit etwa 30 bis 50 Prozent beziffert wird,
scheint so manches Unternehmen ein Auge auf die Steckkarten-Server
geworfen zu haben.<br />
<br />
 Laut IDC planen 26 Prozent von 500 befragten US-Firmen, binnen der
n&#228;chsten zw&#246;lf Monate Blade-Server einzukaufen. Zudem
wollen diverse Hersteller 2003 Higher-Density-Blades auf den Markt
werfen, die einerseits leistungsst&#228;rker sein sollen,
andererseits mit einfacheren Enterprise-Funktionen wie E-Mail,
Firewalls, Dataware-Housing und E-Commerce umgehen k&#246;nnen.
Gartner gibt sich indes etwas skeptischer und warnt, die
Klingentechnik werde erst dann zum Kassenschlager, wenn Standards
f&#252;r die Backplanes definiert sind, so dass Blades
verschiedener Hersteller im gleichen Geh&#228;use Platz finden.
Dennoch setzt Hewlett-Packard (HP) bereits heute schon gut 2000
Blade-Server pro Monat ab - Tendenz steigend.<br />
<br />
 <b>Webservices zur Integration</b><br />
 Webservices bleiben auch 2003 ein heisses Thema. Der Fokus
r&#252;ckt allerdings vermehrt in Richtung zugeh&#246;rige
Entwicklungsumgebungen, die nach Meinungen diverser
Softwareentwickler grosses Potenzial bergen - allen voran Redmonds
Dotnet. Nach den ersten Programmierans&#228;tzen werden Webservices
nun f&#252;r Interface- und Unternehmensarchitektur sowie
Business-Integration relevant. Die n&#228;chste Phase, Software als
Service auszuliefern, steht laut IDC erst in einer Dekade zur
Debatte. "Die Realit&#228;t zeigt, dass Webservices auf Basis
heutiger Technik und Applikationsentwicklung nicht implementierbar
sind. Zudem wirft das Komponenten- und Daten-Sharing eine Vielzahl
Business-relevanter sowie rechtlicher Probleme auf", so IDC. Die
wenigen bislang pr&#228;sentierten Webservices d&#252;rfen demnach
als Anschauungsmaterial daf&#252;r gelten, was in zehn Jahren
m&#246;glich wird. Die auf Anfang 2003 terminierte
Ver&#246;ffentlichung der ersten "Final Standards" (Soap 1.1, WSDL
1.1, Uddi 2.0 und XML 1.0) durch die WS-I (Web Services
Interoperability Organization) k&#246;nnte die Entwicklung
allerdings etwas verk&#252;rzen.<br />
<br />
 Als funktionale Middleware steuert die XML-basierte Technik
bereits heute schon einer Hochkonjunktur entgegen.
Bef&#252;rchtungen, Webservices w&#252;rden den EAI-Anbietern
(Enterprise Application Integration) das Wasser abgraben, sind laut
Rajiv Gupta, einem der f&#252;hrenden Architekten des
64-Bit-Itanium-Prozessors, bislang unbegr&#252;ndet: "Erstens
beobachten EAI-Firmen die Webservice-Entwicklung sehr genau und
haben sich von Beginn weg in dieses Business eingeklinkt. Zweitens,
wenn eine tiefgreifende semantische Integration mit hohem
Datentransfer ohne Echtzeitverschneidung gefordert ist, tun EAI
bessere Dienste." Bei einer schnellen Verzahnung nach dem
Anfrage/Antwort-Modell und bei Neuimplementierungen w&#252;rde
Gupta allerdings den offenen Standard bevorzugen - nicht zuletzt
aus Kostengr&#252;nden.<br />
<br />
 Webservices sch&#252;ren auch andernorts grosse Hoffnungen. Laut
einer IDC-Studie erwarten zwei Drittel von 833 befragten
IT-Verantwortlichen in den USA, dass die
Webservices-Bem&#252;hungen die Sicherheitsanstrengungen von
Software-Lieferanten eigentlich steigern m&#252;ssten.<br />
<br />
 <b>Sicherheit ist Pflicht</b><br />
 Und f&#252;r Sicherheit gilt auch 2003 nach wie vor h&#246;chste
Priorit&#228;t. Wurden 2002 weltweit 80 Milliarden Dollar
aufgeworfen, so d&#252;rfte 2006 die 155-Milliarden-Grenze
gesprengt werden, sch&#228;tzt IDC. Die Informationssicherheit wird
dabei den gr&#246;ssten Wachstumsschub erfahren. Vor allem der
Hardwarebereich soll kr&#228;ftig zulegen - insbesondere
biometrisch versiegelte IT-Anlagen und Token-Smartcards. Zwischen
den USA und Europa best&#252;nden bez&#252;glich Budgetverteilungen
allerdings betr&#228;chtliche Unterschiede, erkl&#228;rt IDC. Wider
Erwarten wollen Manager aus &#220;bersee 2003 nur 23 Prozent ihres
Budgets f&#252;r die IT-Sicherheit investieren, w&#228;hrend die
europ&#228;ischen Chefetagen von 38 Prozent sprechen. Zudem will
man in Europa im Kontrast zu den USA bestehende Systeme eher
ausbauen, als neue Anlagen anzuschaffen.<br />
<br />
 Doch auch im Bereich Sicherheitssoftware geht's ans
Wettr&#252;sten. Laut dem CIO-Magazin (Chief Information Officer)
"Tech Poll" planen mehr als die H&#228;lfe der befragten
Informatikleiter, mehr Geld in Sicherheitsapplikationen zu buttern.
Das Augenmerk liege dabei auf zentral gesteuerten
Kontrollplattformen mit verbesserten Event-Management-Techniken.
Managed-Security-Services, die dank voll ausger&#252;steten
Rechenzentren hier wertvolle Dienste in Form einer externen
24x7-Dauer&#252;berwachung leisten k&#246;nnten, haben sich bislang
allerdings nicht richtig durchgesetzt. W&#228;hrend die einen in
Krisenzeiten Outsourcing durchaus als sinnvoll betrachten, scheinen
die anderen vermeintlich &#252;berst&#252;rzte Abh&#228;ngigkeiten
zu vermeiden. Schliesslich winken in der Regel langfristige
Vertr&#228;ge, die nicht ohne weiteres gek&#252;ndigt werden
k&#246;nnen.<br />
<br />
 <b>IT-Services im Wandel</b><br />
 Doch auch das k&#246;nnte sich &#228;ndern. Das gesamte
IT-Serviceumfeld d&#252;rfte, beschleunigt durch die schlechte
Wirtschaftslage, einen Wandel erfahren. Laut Gartner wird der
Servicemarkt, der gut ein Drittel zum weltweiten IT-Umsatz
beitr&#228;gt, zwar als einer der wenigen Sektoren wachsen,
wenngleich im h&#228;rtesten Klima seit Beginn der 90er Jahre. Am
Ende w&#252;rden wenige Vollsortimenter einer ganzen Reihe von
Spezialisten gegen&#252;berstehen. Am schwierigsten werde es
f&#252;r Dienstleister, die f&#252;r die Rolle des globalen Players
zu klein, als Spezialisten aber zu gross seien. In diesem
Zusammenhang erkl&#228;rt Gartner-Mann Roger Cox: "Es w&#252;rde
mich wundern, wenn das Servicegesch&#228;ft von HP so aufgestellt
bleiben kann, wie es ist." Auch Siemens Business Services (SBS)
ordnet er den gef&#228;hrdeten Playern zu. Zudem glaubt er, dass
sich die Mitbewerber vom kommenden Jahr an weniger &#252;ber ihr
Angebot zu differenzieren versuchen als &#252;ber deren
Qualit&#228;t: "Die Qualit&#228;t der Abkommen und die
Qualit&#228;t des Beziehungsmanagement r&#252;cken in den
Mittelpunkt." Und dazu geh&#246;re eben auch, dass sich die
Anbieter den Kundenw&#252;nschen anpassen k&#246;nnen. Werde dies
nicht eingehalten, bestehe die Gefahr, dass Projekte in den
Bereichen Customer Relationship Management, Enterprise Resource
Planning und EAI, die derzeit ohnehin schon gef&#228;hrdet seien,
der Kostentilgungsmaschine ganz geopfert w&#252;rden.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

