<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Denn Augen
und Ohren sind &#252;berall</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Das systematische
Abhorchen von Firmen sowie das Belauschen von Privatpersonen ist
weltweit Realit&#228;t. Es scheint, als ob der 11. September 2001
das ganze legitimiert h&#228;tte: Die Daten&#252;berwachung, sei es
via Telefon oder E-Mail.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 18.10.2002<br />
 <b>Rubrik:</b> Fokus IT-Security<br />
 <b>Autor:</b>&#160;Andr&#233; Zibung (CEO E-Development AG)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Seit Jahrzehnten wird
geheim geschn&#252;ffelt. Firmen werden ausspioniert. Ohne
Genehmigung wird gelauscht und das ganze Internet sowie Telefonate
werden mit Leichtigkeit &#252;berwacht. Die &#214;ffentlichkeit war
bis 1996 so gut wie ahnungslos, bis 1996 ein neuseel&#228;ndischer
Journalist Echelon, auf gut Deutsch Staffelung, ans Tageslicht
brachte.<br />
<br />
 <b>Weltweites Abh&#246;rsystem</b><br />
 Es ist die eigene Eitelkeit, die einige Schn&#252;ffler zu Opfern
machte. W&#228;ren nicht Leute so von sich und ihrem eigenen Stolz
eingenommen, w&#228;re vieles nicht ans Tageslicht gekommen. So
auch bei Echelon. Der fr&#252;here CIA-Chef James Woolsley etwa
geh&#246;rte zu dieser Sorte Mensch. Zum Gl&#252;ck f&#252;r uns
Europ&#228;er und alle Freunde der Privatsph&#228;re. In einem
Zeitungsinterview im Fr&#252;hjahr 2000 best&#228;tigte er:
"Richtig, meine Freunde, wir haben euch abgeh&#246;rt. Aber nicht,
um Wirtschaftsspionage zu betreiben - die meiste europ&#228;ische
Technologie ist einen Diebstahl nicht wert. Wir wollten damit
Schwarzgeldzahlungen nachweisen, die ja bei euch in Europa an der
Tagesordnung stehen."<br />
<br />
 Europa und die gesamte Wirtschaft war f&#252;r kurze Zeit
schockiert. Doch bald geriet das ganze, zumindest in den
K&#246;pfen Verantwortlicher grosser Unternehmen, in
Vergessenheit.<br />
<br />
 Dass es Echelon gibt, wird nicht mehr bestritten. Doch nicht nur
die Vereinigten Staaten, Australien und Grossbritanien sind Teil
des Spionagenetzwerkes, auch Kanada und Neuseeland geh&#246;ren
dazu. Weltweit betreiben die Geheimdienste dieser Staaten ein
brisantes Netzwerk. Die Abh&#246;ranlagen stehen in Bayern genauso
wie in England und Schottland.<br />
 Urspr&#252;nglich wurde das ganze als milit&#228;risches System
gebaut, doch immer &#246;fter wird es f&#252;r private und
wirtschaftliche Zwecke missbraucht. Obwohl auch Politiker,
Sportasse und Wirtschaftsf&#252;hrer aus aller Welt &#252;berwacht
werden, macht die Industriespionage heute den interessanteren Teil
aus. Die Sch&#228;den sollen Milliarden von Franken betragen.<br />
<br />
 Schenken wir einem Spezialisten auf dem Gebiet der
Satellitentechnik und der Kryptografie, Campell, Glaube, muss uns
allen der Schweiss kalt &#252;ber den R&#252;cken laufen. Sieben
Satelliten bilden das Kernst&#252;ck des Netzwerkes Echelon - der
teuerste davon kostet &#252;ber 1,5 Milliarden Schweizer
Franken.<br />
<br />
 Doch nicht nur der "Cyberspace", der den Datenaustausch (Handy)
&#252;berwacht, dient zum Lauschen. Am Boden zapfen &#252;ber
hundert Echeloncomputer die Telefon- und Datenkabel, die am
Meeresgrund verlaufen, an und kontrollieren die gesamte
Festnetzkommunikation. Eine einzige Maschine schafft es, 57 000
Telefonleitungen gleichzeitig zu &#252;berwachen.<br />
<br />
 Auch wenn in den europ&#228;ischen Staaten und in der Schweiz die
Proteste gegen Abh&#246;rsysteme laut werden, k&#246;nnen sie nicht
verhindert werden, denn sie werden von diesen L&#228;ndern auch
gesch&#228;tzt. Nur heissen sie halt anders.<br />
<br />
 An Privatgespr&#228;chen, die lediglich der Unterhaltung dienen,
sind Spionagenetzwerke bestimmt nicht interessiert. Spannend wird
es dann, wenn unternehmenskritische Daten wie Strategien,
Technologien, Firmen&#252;bernahmen, finanzrechtliche und andere
Informationen ausgetauscht werden. Fakt ist, dass solche
Informationen allen dem Netzwerk angeh&#246;renden Mitgliedern
zugespielt und zu deren Vorteil genutzt werden. In der EU wurde in
diesem Jahr ein Gesetz verabschiedet, dass die Telecomanbieter den
staatlichen Organen eine technische Schnittstelle zur
Verf&#252;gung zu stellen habe, die es erlaubt, ohne das Wissen
oder Zutun des Telekommunikationsanbieters, Gespr&#228;che
aufzuzeichnen. Die Schweiz ist zwar noch nicht so weit, doch werden
bereits heute s&#228;mtliche Gespr&#228;che, die via Swisscom
gef&#252;hrt werden, aufgezeichnet und f&#252;r sechs Monate
gespeichert. Im Bezug auf den Mailverkehr wird das vom
amerikanischen FBI entwicklete System "Carnivore" auf einem
Computer, der in einem K&#228;fig gegen Manipulation von aussen
gesch&#252;tzt ist, bei Providern installiert und mit deren Servern
verbunden. "Carnivore" ist in der Lage, Millionen von Mails in
Echtzeit auf Stichworte hin zu durchsuchen und ausfindig zu machen.
In der Schweiz werden seit den letzten Vorf&#228;llen im Bezug auf
Kinderpornographie verst&#228;rkt Anstrengungen unternommen, um
&#228;hnliches zu erreichen.<br />
<br />
 <b>UMTS erleichtert Schn&#252;ffeln</b><br />
 Das viel diskutierte Weltnetz UMTS wird die Schn&#252;ffelmethoden
noch vereinfachen. Handy-Besitzer, die sich auf diese neue
Technologie freuen, sollten sich im Klaren sein, dass - egal wo in
Europa sie sich befinden - die Beh&#246;rden daheim
mitlauschen.<br />
<br />
 Aber nicht nur mobile Systeme sind den Lauschangriffen ausgesetzt.
Auch im Internet tut sich einiges - unter Beihilfe der
IT-Industrie. Router-Hersteller verkaufen Ger&#228;te, in denen
Abh&#246;rfunktionen schon integriert sind. Mit dieser
M&#246;glichkeit lassen sich die Beh&#246;rden eine
Abh&#246;rm&#246;glichkeit gleich mit einbauen.<br />
<br />
 Wenn Abh&#246;rsysteme legitimiert werden, hat dies f&#252;r
unsere Wirtschaft gravierende Auswirkungen. Gerald Reischl
beschreibt in seinem Buch "Gef&#228;hrliche Netze", dass der Deal
zwischen Daimler-Benz und Chrysler nicht wie geplant verlaufen sei.
Weiter soll etwa Airbus von Boeing bei einem Grossauftrag in
Saudi-Arabien ausgestochen worden sein, weil Details des geplanten
Deals den Amerikanern bekannt waren und die Vertragsverhandlungen
zwischen Airbus und den Saudis mitgeschnitten wurden.
&#220;berhaupt soll Airbus Industries die Gefahr der
Industriespionage untersch&#228;tzt haben: Bis 1999 sollen
Telefonate innerhalb der Konzernvertretung unverschl&#252;sselt
stattgefunden haben. Auch eine franz&#246;sische
Telekommunikationsfirma sei Opfer des amerikanischen
Industriespionagesystems geworden. Die Daten wurden an die
amerikanische Konkurrenz geliefert, die den milliardenschweren
Auftrag an Land ziehen konnte.<br />
<br />
 Und wie sieht es in der Schweiz aus? L&#228;ngst sind wir mit
allen industriealisierten Staaten &#252;bers Internet und via
Telefon verkn&#252;pft. Dies birgt vor allem f&#252;r Banken,
Versicherungen und jegliche Industriezweige Risiken in sich.
Geraten die Informationen in falsche H&#228;nde, ist ein hoher
Schaden gewiss.<br />
<br />
 Die breite &#214;ffentlichkeit und vor allem die Wirtschaft nimmt
diese Tatsache noch nicht in aller Brisanz wahr. Viele glauben,
dass sie, wenn &#252;berhaupt, nur am Rande betroffen sind.
Wenngleich aus Sicht vieler Unternehmen einiges getan wird, um die
Daten zu sch&#252;tzen. Firewalls, Passw&#246;rter und Intrusion
Detection Systeme sichern das Eindringen von Unberechtigten. Was
aber meistens fehlt ist der Schutz des Datentransfers. Vertrauliche
Files werden ungesch&#252;tzt an Verhandlungspartner,
Kadermitglieder und andere wichtige Personen versandt. Oder man
schickt das File zu sich nach Hause, damit am Abend noch daran
gearbeitet werden kann. Daten verlassen auf einfachste Weise das
Haus, ohne dass jemand nur im Entferntesten an eine Spionage
denkt.<br />
<br />
 Allein im letzten halben Jahr haben Cyberangriffe um 80 Prozent
zugenommen. Mehr als 700 Angriffe mussten Unternehmen aus den
Bereichen Hochtechnologie, Finanzen, Medien und Energie
eingestehen. Und die Zahlen beziehen sich nur auf Angriffe von
aussen, die bekannt sind und von Hackern begannen wurden. Sie
zeigen auf, wie gross das Interesse von Unbefugten an vertraulichen
Dokumenten ist.<br />
<br />
 In dem Masse, wie &#246;konomische und soziale Funktionen auf
interaktive Netzwerke &#252;bertragen werden, wird uns die
Verletzlichkeit der Wirtschaft und der Gesellschaft bewusst. Dies
gilt insbesondere f&#252;r Organisationen und Einrichtungen von
zentraler Bedeutung: &#214;ffentliche Verwaltungen, Regierungen,
Banken, Finanz- und Versicherungsinstitutionen, Telekommunikation,
Transport-, Energie- und Gesundheitswesen sowie Notfall- und
Rettungsdienste. Wie neue Technologien Gefahren mit sich bringen,
f&#252;hren sie auch zu neuen Schutzmassnahmen. Durch die
dynamische Entwicklung des digitalen Gesch&#228;ftsverkehrs
verzeichnen die M&#228;rkte f&#252;r
Verschl&#252;sselungstechnologie hohe Wachstumsraten. Auf dem Markt
existieren zur Zeit vorwiegend Hardware-L&#246;sungen, die mit
relativ grossem Aufwand implementiert werden m&#252;ssen. Eleganter
pr&#228;sentieren sich die Software-orientierten Systeme, die
jedoch verschiedenen Schwierigkeiten ausgesetzt sind, da im Bezug
auf die Betriebssysteme verschiedene Standards herrschen.
Allerdings darf hier nicht &#252;bersehen werden, dass technische
Massnahmen - so leistungsf&#228;hig sie auch sein m&#246;gen -
alleine noch keine Verbesserung der Sicherheitslage der Anwender
bewirken. Vor allem in wichtigen Wirtschaftszweigen m&#252;ssen
weitere Massnahmen hinzukommen, die der Sensibilisierung,
Aufkl&#228;rung und Schulung der gesamten Belegschaft in Fragen der
Sicherheit dienen.<br />
<br />
 <b>Nicht nur Echelon</b><br />
 Der t&#228;gliche Gebrauch von Mail und Telefon birgt
grunds&#228;tzlich Risiken in sich. Ob Datenschutz oder
Schweigepflicht. Bei der E-Mail-Kommunikation per SMTP/POP3 ist
problematisch, dass es nicht nur einen Datenbestand gibt, der
abgesichert werden kann. Vielmehr werden bei E-Mails Datenpakete
durch das Internet transferiert, die an unz&#228;hligen Rechnern
abgefangen und kopiert werden k&#246;nnen. Ausserdem sind die Daten
standardm&#228;ssig auf den PCs verschiedener Personen gespeichert,
deren Sicherheitskompetenz nicht vorausgesetzt werden kann. Ein
nicht verschl&#252;sseltes Mail liegt im Klartext vor wie eine
Postkarte und kann von jedem Computerbesitzer mit
Hintergrundkenntnissen im Internet gelesen werden. Eine
verschl&#252;sselte Mail hingegen kann als sicher angesehen
werden.<br />
<br />
 Beispiele aus der Praxis schildern, was mit unverschl&#252;sselter
Korrespondenz alles passieren kann. Ein Mitarbeiter eines Konzerns
hat Zugriff auf vertrauliche Dokumente im Intranet des
Unternehmens, bei dem er angestellt ist. Er versendet ein solches
Dokument als Mail-Anhang unverschl&#252;sselt durch das Internet.
Obwohl der Empf&#228;nger ebenfalls ein Mitarbeiter der selben
Firma ist, der das Dokument lesen darf, wurde das Dokument quasi
ver&#246;ffentlicht: Die dazwischen geschalteten Internetprovider
und andere technisch versierte Internetnutzer k&#246;nnen dieses
Dokument lesen, kopieren oder manipulieren - ohne dass es bemerkt
wird. Oder ein Unternehmer hat einen aktuellen Angebotsentwurf und
ein Konzept f&#252;r ein grosses Projekt und schickt dieses zur
Pr&#252;fung in die Anwaltskanzlei - unverschl&#252;sselt per
E-Mail versteht sich. Es l&#228;sst sich leicht ein Raum darauf
machen. Nicht anders verh&#228;lt es sich bei anderen
Wirtschaftsinformationen.<br />
<br />
 Zum Schutz vertraulicher Informationen werden mit Hilfe von
Verschl&#252;sselungs-Systemen, sogenannten Kryptosystemen, nur
verschl&#252;sselte Datenpakete &#252;ber das Netz versandt.
Entsprechende Verschl&#252;sselungsverfahren sind die Basis des
abgesicherten Datenaustausches. Hierf&#252;r wurden verschiedene
Systeme entwickelt, die auf der Idee, dass nur jemand mit einem
passenden Schl&#252;ssel eine verschl&#252;sselte Nachricht lesen
resp. h&#246;ren kann, basieren.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

