<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Firewalls:
Stuck oder Stabilit&#228;t</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Vorsicht vor
Blendwerk: Die Feature-&#220;berfrachtung von Firewalls dient oft
eher der Marketingabteilung des Anbieters als der Sicherheit des
Nutzers. Auch Vergleichstests und G&#252;tesiegel sind mit Vorsicht
zu geniessen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 27.09.2002<br />
 <b>Rubrik:</b> Technologie &amp; Service<br />
 <b>Autor:</b>&#160;Tom Knienieder (CTO Khamsin Luzern)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Software enth&#228;lt
Fehler. Bei unkritischeren Anwendungen gilt oft das "Good enough
for Sale"-Prinzip. Bei kritischen Systemen wird immerhin versucht,
durch zus&#228;tzliche Qualit&#228;tssicherung die Fehlerquote auf
einen Prozentsatz zu minimieren, der f&#252;r den jeweiligen
Einsatzbereich akzeptabel erscheint. Komplett ausmerzen lassen sich
Fehler indes kaum. So ist es einleuchtend, dass selbst eine
Firewall - darin unterscheidet sie sich nicht von anderer Software
- mit einiger Wahrscheinlichkeit Fehler enth&#228;lt. Und zwar
proportional zur Anzahl ihrer Funktionen und Module. Die Hersteller
von Firewalls sehen sich hier also vor dem Dilemma, sich zwischen
minimalistischen und verifizierbaren Produkten oder aber solchen
mit umfassender Funktionalit&#228;t und dementsprechend vielen
Komponenten entscheiden zu m&#252;ssen.<br />
<br />
 <b>Die Rolle der Medien</b><br />
 Als Folge des zunehmenden Sicherheitsbewusstseins und des
Publizit&#228;tsinteresses der Hersteller sind Tests und
Vergleichsberichte von Firewalls in diversen Medien immer
h&#228;ufiger anzutreffen. Kein Wunder, dass potenzielle Kunden von
Firewalls, die Ausschau nach einem f&#252;r sie geeigneten System
halten, nicht aber &#252;ber einen tieferen Einblick in die
Thematik verf&#252;gen, solche Testberichte oft als
Kaufentscheidungsgrundlage nutzen. Die Punktvergabe der Vergleiche
beruht indes oft auf recht vordergr&#252;ndigen Kriterien, etwa auf
der Beurteilung des Benutzer-Interface und einer Aufz&#228;hlung
der Features. Ein kritischer Blick unter die Haube entf&#228;llt
aufgrund des hohen Aufwands und der meist nicht ausreichenden
Qualifikation der Tester.<br />
<br />
 Entsprechend oberfl&#228;chlich bleibt die Beurteilung des
effektiven Schutzes. Dem Autor sind einige "Testsieger" bekannt,
die mit sehr einfachen Exploits und wenig Know-how &#252;ber das
Internet lahmgelegt werden k&#246;nnen. Oder solche, die - noch
fataler - durch fehlerhafte Software oder unsachgem&#228;sse
Konfiguration seitens der Hersteller Aussenstehenden den Zugriff
erlauben. Gerade bei einem Produkt im Sicherheitsbereich sollte das
Verhalten des Systems jedoch auch unter diversen Angriffsszenarien
und hoher Last bekannt und verifizierbar sein.<br />
<br />
 <b>Features um jeden Preis</b><br />
 In Ermangelung anderer Information werden auch fragw&#252;rdige
Testberichte h&#228;ufig als Kaufentscheidungsgrundlage
herangezogen. Entsprechend baut nat&#252;rlich das Marketing der
Anbieter auf ihnen auf und verwendet sie als Qualit&#228;tsindiz.
Oft liegt gar die Vermutung nah, dass der eine oder andere
Hersteller auch bewusst versucht hat, einen potenziellen Testsieger
mit m&#246;glichst vielen verschiedenen Funktionen
herzustellen.<br />
<br />
 Die Sicherheit einer Firewall h&#228;ngt indes nur sehr bedingt
von ihrem Funktionsreichtum ab. Dennoch gewichten die oben
beschriebenen Tests in den Medien die Features &#252;ber Mass oder
beschr&#228;nken sich gar auf deren Beurteilung. Die Testergebnisse
dann als Kriterien f&#252;r die Sicherheit eines Systems
darzustellen, ist aber keineswegs hinreichend. In den besseren
F&#228;llen werden in Labors Testumgebungen aufgebaut und die zu
pr&#252;fenden Systeme verschiedenen Angriffen ausgesetzt. Von
einer Resistenz gegen diese Attacken d&#252;rfen jedoch keine
R&#252;ckschl&#252;sse auf die Schutzwirkung gegen&#252;ber nicht
getesteten Angriffsarten gezogen werden.<br />
<br />
 Einige der beliebten Zusatz-Features bergen gar prinzipbedingt ein
Sicherheitsrisiko. Generell abzuraten ist etwa von Firewalls, die
mit unverschl&#252;sselten Protokollen via Internet konfiguriert
werden k&#246;nnen. Namentlich bedeutet dies Fernzugriff &#252;ber
Telnet, Rlogin, SNMP oder HTTP. Ein Mith&#246;ren der
Passw&#246;rter oder ein Connection Hijacking, bei dem eine
bestehende Verbindung entf&#252;hrt wird, ist bei
unverschl&#252;sselter Remote-Konfiguration sehr einfach. Bei
dedizierten grafischen Clients f&#252;r die Bedienung der Firewalls
sollte der Hersteller auch klarlegen, wie die Daten &#252;bertragen
werden.<br />
<br />
 Von Systemen, die schwerpunktm&#228;ssig mit der einfachen
Bedienung argumentieren und keinen Einblick in die Funktionsweise
gew&#228;hren, ist ebenso abzusehen. Vor einiger Zeit bekam ich
eine Firewall zu Gesicht, deren haupts&#228;chliche
Sicherheitskonfiguration aus einem Schieberegler mit den
sinngem&#228;ssen Positionen "niedrige", "mittlere" und "hohe"
Sicherheit bestand. Was ein derartiges System unter der jeweiligen
Einstellung im Detail unternimmt, ist schlicht
undurchschaubar.<br />
<br />
 <b>Zertifizierungen</b><br />
 Ein weiteres oft verwendetes Kaufkriterium f&#252;r Firewalls ist
deren Zertifizierung. Eine solche bedeutet kurz formuliert einen
bestandenen Test durch einen Dritten. Die Beglaubigung besagt
jedoch nichts &#252;ber die Einsetzbarkeit der Firewall beim
Kunden, da dieser unter Umst&#228;nden v&#246;llig andere
Anspr&#252;che an das System stellt als die Zertifizierungsstelle.
Eine der bekanntesten Zertifizierungsstellen ist die ICSA. Viele
Firewalls tragen ihr Pr&#252;fsiegel und f&#252;hren dies auch in
den Produktunterlagen an. Sieht man sich jedoch an, welche Fehler
schon in Produkten mit positiv verlaufener ICSA-Zertifizierung
gefunden wurden, so muss man die Sinnhaftigkeit dieser Tests in
Frage stellen und ist gar versucht, sie als Marketinginstrument
abzustempeln. Nicht umsonst gibt es in der Security-Branche den
Witz vom Zertifizierungskleber mit dem Aufdruck "Apparently
Ok".<br />
<br />
 <b>VPN-Verschl&#252;sselung</b><br />
 VPN (Virtual Private Networks) werden immer beliebter, um
Filialbetriebe, Aussendienstmitarbeiter oder Homeworker via
Internet an Unternehmensnetzwerke anzubinden. Damit deren Daten
w&#228;hrend der &#220;bertragung nicht abgeh&#246;rt oder
verfremdet werden k&#246;nnen, kommen
Datenverschl&#252;sselungstechniken zum Einsatz. Die Hersteller
setzen dabei auf verschiedene Algorithmen. Firewalls mit
VPN-Funktionen sollten grunds&#228;tzlich einen anerkannten
Standard wie Ipsec verwenden. Weiter sind nur jene
Verschl&#252;sselungen, die allgemein bekannt und &#246;ffentlich
zug&#228;nglich sind, auch sichere Verschl&#252;sselungen. Im
ersten Moment scheint dies paradox; die Erkl&#228;rung daf&#252;r
ist jedoch einfach: Verschl&#252;sselungsverfahren m&#252;ssen
offengelegt sein, da ansonsten weder mathematisch noch durch
Spezialisten aus der Praxis nachgewiesen werden kann, dass sie
sicher sind. Bei den meisten dieser Verfahren ist wohl ein
theoretischer L&#246;sungsweg bekannt. Dieser bedingt jedoch einen
derart hohen Aufwand, dass es keinen praktischen Sinn macht, das
Verfahren anzuwenden, da es beim heutigen Stand der Technik je nach
Algorithmus und Schl&#252;ssell&#228;nge hunderte Millionen Jahre
dauern k&#246;nnte, den Schl&#252;ssel zu errechnen.<br />
<br />
 In den letzten Jahren sind die sogenannten Personal Firewalls
aufgetaucht, die auf dem abzusichernden System selbst laufen.
Glaubt man den Herstellern, sollen diese vor jeglichen Angriffen
sch&#252;tzen. Dieses Konzept hat indes wenig mit einer echten
Firewall gemein, denn es handelt sich dabei um Zusatzprogramme und
nicht um autonome, vorgelagerte Systeme. In manchen dieser Personal
Firewalls sind automatische Blocker installiert, die externe
IP-Adressen selbstt&#228;tig sperren. Wenige b&#246;sartige
Codezeilen reichen n&#228;mlich, um die Blockfunktion zu
missbrauchen: Ein Programm, das ein modifiziertes Datenpaket
versendet, in dem als Absender der DNS-Server eingetragen wird,
legt ein solches System lahm, weil durch die Sperrung des
DNS-Server keine Hostnamen mehr aufgel&#246;st werden
k&#246;nnen.<br />
<br />
 <b>Die richtige Evaluation</b><br />
 Tests von nicht spezialisierten Medien oder Zertifizierungsstellen
sollte man also sehr kritisch gegen&#252;ber stehen. Weiter darf
man Systemen, die mit Schlagworten wie "milit&#228;rische
Sicherheit", "geheime Kryptografie" und &#228;hnlichen angepriesen
werden, kein Vertrauen schenken. Stattdessen gilt es, sich
gen&#252;gend Zeit zu nehmen und die Produkte anhand der
individuellen Anforderungen an Schutz, Funktionalit&#228;t und
Performance zu evaluieren oder von einem vertrauensw&#252;rdigen
Partner evaluieren zu lassen.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

