<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Im Dickicht
der Sicherheitsl&#246;sungen</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Noch sind
Entscheidungstr&#228;ger skeptisch, die Sicherheit der eigenen
IT-Infrastruktur und Daten in fremde H&#228;nde zu legen. Doch
Unternehmensnetzwerke sind heute weit komplexer als noch vor ein
paar Jahren und bed&#252;rfen einer professionellen Wartung.
Managed-Security-Service-Provider stellen durchaus eine sinnvolle
Alternative dar - wenn der Anbieter mit Sorgfalt gew&#228;hlt
wird.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 30.08.2002<br />
 <b>Rubrik:</b> Magazin Top 500/2002<br />
 <b>Autor:</b>&#160;D&#233;sir&#233;e Sterchi<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Die Marktsituation im
Bereich Sicherheit kommt derzeit einem Gemischtwarenladen gleich.
Anbieter aus diversen Business-Sparten mit unterschiedlichsten
Backgrounds - von Softwarelieferanten &#252;ber Telekomunternehmen
bis hin zu Netzprovidern und Systemintegratoren - dr&#228;ngen sich
im lukrativen Feld Security dicht aneinander und warten fast
t&#228;glich mit neuer Hard- und Software samt zugeh&#246;rigen
Dienstleistungspaketen auf. Entsprechend der Anbietervielfalt
gestaltet sich auch die Produktepalette: So ist vom einfachen
Virenscanner einer Kleinstfirma bis hin zu Firewalls, VPN (Virtual
Private Networks) und komplexen Sicherheitsmanagementplattformen
grosser Anbieter wie Baltimore, ISS oder Symantec nahezu alles zu
haben.<br />
<br />
 <b>Sicherheit in fremden H&#228;nden</b><br />
 Will man sich im Dschungel der Sicherheitsl&#246;sungen
zurechtfinden, ist guter Rat teuer. Denn Preisvergleiche sind oft
nur schwer m&#246;glich, da entsprechend der individuellen
Firmenstrukturen unterschiedliche Konditionen und
Lizenzvertr&#228;ge vereinbart werden m&#252;ssen. Hinzu kommt,
dass zur fachgerechten Installation und Wartung geeigneter
Sicherheitsmassnahmen ein hohes Mass an Expertise, Infrastruktur
und Ressourcen erforderlich ist. St&#252;tzt sich ein Unternehmen
auf externe Fachkr&#228;fte, sind Stundenans&#228;tze von 150 bis
300 Franken durchaus die Norm. Soll der Sicherheitsbetrieb intern
erarbeitet werden, kostet dies unversch&#228;mt viel Zeit,
gekoppelt mit einem entsprechend hohen Bedarf an personellen
Ressourcen. So geniessen beispielsweise die Firewalls von
Routerk&#246;nigin Cisco gerade deshalb einen sehr guten Ruf, weil
sie auf einem eigenen Betriebssystem fahren. Will man die
Funktionsweise der Brandschutzmauern allerdings verstehen und diese
aus eigenen Kr&#228;ften unterhalten, m&#252;ssen in
regelm&#228;ssigen Abst&#228;nden s&#252;ndhaft teure Kurse belegt
werden.<br />
<br />
 Keiner finanziellen Analyse mehr zug&#228;nglich ist der Schaden
bei effektiven Sicherheitsvorkommnissen. Sollte ein Unternehmen
nicht f&#228;hig sein, sich selbst und seine Kunden - falls diese
es je erfahren - hinreichend zu sch&#252;tzen, ist der Imageverlust
vorprogrammiert und kann die Firma Kopf und Kragen kosten.<br />
<br />
 Unternehmen mit sensiblen Daten, wie etwa Banken, Versicherungen,
Sport- und Lottogesellschaften, aber auch Automobilhersteller sowie
Spit&#228;ler und Beh&#246;rden haben sich nicht zuletzt deshalb in
die H&#228;nde professioneller Sicherheits-Outsourcer begeben.
Abgenabelt von der eigenen IT-Infrastruktur &#252;berlassen
beispielsweise die Swisslife-Gruppe, Aspectra, Sulzer, Franke,
Swisscom, der Kanton Aargau oder auch der deutsche Versicherer Axa
sowie Schweizer Grossbanken das n&#246;tige Sicherheitsmanagement
samt Hardware, Software-Updates und Patches so genannten
Managed-Security-Service-Providern, kurz MSSP. Diese k&#252;mmern
sich in einem 24x7-Dauerbetrieb um die Sicherheitsbelange der
Unternehmensnetzwerke, warten mit detaillierten
Schwachstellenanalysen auf und schaffen durch die sofortige
Beseitigung von Sicherheitslecks eine Basis f&#252;r einen
dauerhaften Sicherheitsprozess.<br />
<br />
 <b>CEO versus Anwender</b><br />
 Allerdings erscheinen MSSP auf den ersten Blick als relativ teuer
und "kr&#228;nkeln" aus Sicht der Anbieter daran, dass vor allem
Entscheidungstr&#228;ger dem Auslagern gesch&#228;ftskritischer
Kompetenzen skeptisch gegen&#252;berstehen und Abh&#228;ngigkeiten,
wo immer m&#246;glich, vermeiden m&#246;chten. Hinzu kommt, dass
sie in Sparzeiten eher dazu tendieren, Gelder zu bewilligen, die zu
einem direkt sichtbaren Return on Investment f&#252;hren. So auch
Peter Strub, CEO der Kommunikations-Agenturgruppe Wirz Management
AG: "Ich w&#252;rde das Heft nicht aus der Hand geben wollen, die
Abh&#228;ngigkeit ist mir zu gross. Zudem ist die
Kosten-Nutzen-Relation intern besser und schneller
beeinflussbar."<br />
<br />
 Anders klingt es von Seiten der Praktiker. Christian Wessendorf,
Programmierer und Systemanalytiker bei Kybermedia: "Der
Sicherheitsauslagerung stehe ich prinzipiell positiv
gegen&#252;ber. Will man sich im breiten Angebot einen echten
&#220;berblick verschaffen, investiert man zu viel an wertvoller
Zeit." Doch, so Wessendorf, m&#252;sse die Entscheidung "Make or
Buy" vom Kerngesch&#228;ft des Unternehmens abh&#228;ngig gemacht
werden. So d&#252;rfte etwa ein Buchverlag mit einem einzigen
Datenbankspezialisten kaum gen&#252;gend Ressourcen stellen
k&#246;nnen, die Sicherheitsbelange selbstst&#228;ndig zu warten.
Sind freie Arbeitskr&#228;fte zur Hand, w&#252;rde er eine
Teilauslagerung indes vorziehen. Dies alles unter der Annahme, so
Wessendorf, dass ein Unternehmen &#252;berhaupt auf eine hohe
Verf&#252;gbarkeit von Daten und Infrastruktur angewiesen ist.
Schiesslich gen&#252;gt in vielen F&#228;llen auch der Gang zum
Stecker mit erneutem Booten.<br />
<br />
 Die Kehrseite einer hohen Unternehmenssicherheit ist laut
Wessendorf, der beispielsweise bei Astrodata SQL-Datenbanken
programmiert, allerdings auch nicht zu untersch&#228;tzen: "Seit
dem Internetwurm Nimda vor gut einem Jahr haben sich die
Sicherheitsmassnahmen bei Astrodata massiv versch&#228;rft. Will
ich Programme installieren oder User-Rechte vergeben, muss ich nun
mehrere, zum Teil sehr m&#252;hsame Sicherheitsinstanzen
durchlaufen."<br />
<br />
 <b>Preis gerechtfertigt</b><br />
 Mit Ausnahme des Webservers, der im Z&#252;rcher Technopark von
Swiss-Support.Net f&#252;r circa 2500 Franken pro Monat gewartet
wird, f&#228;hrt Astrodata aber nach wie vor auf Eigenbetrieb.
Nicht so eine grosse Schweizer Versicherung, die beim MSSP Activis
(Umsatz 2001: 4,7 Millionen Euro) unter Vertrag steht. F&#252;r gut
31200 Franken pro Jahr nimmt sie vier Standardmodule wie etwa das
System-Monitoring und die Fern&#252;berwachung der
Firewall-Verf&#252;gbarkeit in Anspruch. Im Preis inbegriffen ist
die Echtzeitanalyse von Logfiles sowie der regelm&#228;ssige Bezug
von Management- und Traffic-Reports.<br />
<br />
 Beim Z&#252;rcher MSSP Open Systems (Umsatz 2001: 10 Millionen
Franken), der sich vorwiegend auf High-End-Kunden wie Sulzer,
Swisslife und Banken spezialisiert hat, ist eine
Referenzinstallation - bestehend aus Firewalls, netzwerkbasierten
IDS (Intrusion Detection Systems) und VPN-Zug&#228;ngen bei einer
Verf&#252;gbarkeit von 99,9 Prozent (45 Minuten pro Monat) - mit
570 000 Franken zu berappen. Oder der Aargauer MSSP Terreactive
(Umsatz 2001: 5,1 Millionen Franken), der dem Kanton Aargau
f&#252;r gut 3000 Franken im Monat die sichere Abschottung des
Intranets gegen&#252;ber dem Internet garantiert.<br />
<br />
 Die satten Preise m&#246;gen im ersten Moment &#252;berraschen,
sind aber laut IT-Spezialisten gerechtfertigt und entsprechen im
Schnitt zwei Drittel der Eigenbetriebskosten.<br />
<br />
 <b>Mit Sorgfalt ausw&#228;hlen</b><br />
 So sollte bei der Wahl eines MSSP nicht etwa nur der Preis im
Vordergrund stehen, sondern vielmehr der Check der zugeh&#246;rigen
Service-Level-Abkommen (SLA). Diese legen klar fest, binnen welcher
Frist der Anbieter auf Sicherheitsvorkommnisse wie zu reagieren
hat. Als weiterer wichtiger Punkt ist die finanzielle Polsterung
des MSSP zu nennen. Zeigen doch die Pleiten einiger
Serviceprovider, dass die finanzielle Stabilit&#228;t nicht immer
das ist, was sie zu sein scheint.<br />
<br />
 Da zudem je nach Dienstleistung und Projekt eine langfristige
Vertragsbindung winkt, d&#252;rfte es sich bezahlt machen, die
einzelnen Anbieter genau unter die Lupe zu nehmen und deren
Referenzkunden zu kontaktieren. Versteckt sich ein MSSP hinter dem
Argument, er k&#246;nne seine Kundennamen aus
Sicherheitsgr&#252;nden nicht offen legen, und ist - obwohl
gesetzlich nat&#252;rlich nicht verpflichtet - nicht bereit, einen
Einblick in die Umsatzzahlen zu gew&#228;hren, sollte man besser
die H&#228;nde davon lassen.<br />
<br />
 Zu guter Letzt spielen sicher auch Unternehmensgr&#246;sse und
Erfahrung eine Rolle. W&#228;hrend die einen kleinere Anbieter mit
pers&#246;nlichen Vertrauenskontakten bevorzugen, glauben die
andern, Gr&#246;sse vermindere das Grounding-Risiko.<br />
<br />
 Welcher Anbieter auch immer gew&#228;hlt wird, kein
Managed-Security-Service-Provider kann und wird f&#252;r
s&#228;mtliche Vorf&#228;lle geradestehen k&#246;nnen.
Missmanagement und unsaubere Unternehmensstrategien sollten noch
immer Teil der Unternehmens-Risikoanalyse darstellen.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

