<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Eine
holistische Applikationsintegration</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Ganzheitlichkeit
wurde aus den Abstraktionen der New-Age-Aera in die harte
wirtschaftliche Realit&#228;t der Unternehmens-IT
hin&#252;bergerettet. Der Konkurrenzdruck zwingt die
IT-Verantwortlichen heute dazu, einen Haufen individueller Systeme
zur Zusammenarbeit zu zwingen. Aber schon das simple Verbinden
einzelner Applikationen verschlingt Zeit und Geld und f&#252;hrt
oft nicht zum Ziel.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 11.10.2002<br />
 <b>Rubrik:</b> Report<br />
 <b>Autor:</b> Todd Datz (Mitarbeiter der Zeitschrift CIO)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Ganzheitliches Vorgehen
ist angesagt. Der IT-Verantwortliche muss die Gesamtheit seiner
Projekte aus der Vogelperspektive &#252;berblicken k&#246;nnen. Die
Grunds&#228;tze des Unternehmens, Geschwindigkeit, Kundenn&#228;he
und Zusammenarbeit, bedingen diese Strategie. Eine
Integrationsstrategie, die nicht im Gleichschritt mit der
Unternehmensstrategie marschiert, hat die Konsequenzen eines feucht
fr&#246;hlichen Abends: Sie r&#228;cht sich am n&#228;chsten
Morgen.<br />
<br />
 Am Beispiel einiger Vorzeigefirmen wird gezeigt, welche IT-
Strategien bei jeder einzelnen Applikation angewendet wird, so dass
die Integration als gesamter Prozess mit Anfang und Ende betrachtet
werden kann.<br />
<br />
 <b>Verbindung per Kiosk</b><br />
 Paul Gaffney ist CIO der B&#252;romaterialfirma Staples. F&#252;r
ihn hat der Kundendienst den Ausschlag gegeben, sich f&#252;r eine
Integration von Applikationen stark zu machen. Die im Kundendienst
verbuchten Gewinne zeigten ihm an, dass es sich lohnt, sich
reinzuknien. "Unsere wichtigsten Kunden sind jene, die das gesamte
Spektrum an M&#246;glichkeiten nutzen, um mit uns Gesch&#228;fte zu
betreiben", sagt Gaffney. Diese Kunden "verlangen eine konsistente
und nahtlose Bedienung. Wenn man f&#252;r die besten Kunden das
Richtige tut, kommt dabei auch etwas Gutes heraus."<br />
<br />
 Um dieses Ziel zu erreichen, sei eine &#252;bergreifende Strategie
von wesentlicher Bedeutung, mit der die IT die Aufgabe des
Unternehmens unterst&#252;tzen kann. "Eines der Dinge, die grosse
IT-Organisationen vom Rest des Packs unterscheidet, ist eine
holistische Zukunftsschau." Eines der Produkte, die aus Gaffneys
unternehmensweiter Sicht auf den Kunden entstand, ist der
Onlinekiosk: Access Point. Er wurde in s&#228;mtlichen 1040
amerikanischen L&#228;den des Unternehmens installiert.<br />
<br />
 Die Schaffung der Kioske wurde zur direkten Verbindung der
E-Handels-Website (www.staples.com) mit dem Point-of-Sale-System
(POS), dem Bestellverwaltungssystem, Verteilsystem und der
Lieferkette von Staples. Angestellte aus Detailhandel, Katalog,
Online, Finanz, Verteilung, Merchandising und Ausbildung arbeiten
zusammen. Praktisch sind dadurch alle Mitarbeiter betroffen ausser
die Kantinenk&#246;che.<br />
<br />
 Die Kioske bieten den Kunden beispielsweise die M&#246;glichkeit,
einen B&#252;rostuhl per Kreditkarte zu bestellen. Er tr&#228;gt
die mit einem Strichcode versehene Quittung an die Kasse und kann
dann zahlen. Die Kundschaft kann den Kiosk auch f&#252;r den
Zugriff auf eine Sammlung von Informationen &#252;ber Produkte und
Dienstleistungen verwenden. Zudem kann damit ein Inventar von 45
000 online erh&#228;ltlichen Produkten durchbl&#228;ttert
werden.<br />
<br />
 <b>Kundenw&#252;nsche</b><br />
 Es besteht die M&#246;glichkeit, einen PC auf Bestellung
zusammenzustellen, das erlaubt dann mehr als einem Drittel der
Staples-L&#228;den, Computer von ihrer Verkaufsfl&#228;che zu
entfernen. "Der Kunde kann nach seinen W&#252;nschen vorgehen und
ist nicht gezwungen, unsere Vorgaben einzuhalten", betont
Gaffney.<br />
<br />
 Neben den Kunden profitierte aber auch das Unternehmen selbst. Das
Millionen Dollar schwere Projekt Access Point f&#252;hrte viele
Kunden auf die Website. Die Firma sch&#228;tzt, dass ein Kunde, der
sowohl in den L&#228;den wie &#252;ber die anderen Kan&#228;le
(Website oder Katalog) einkauft, der Firma zweieinhalb mal
l&#228;nger treu bleibt als ein reiner Ladenkunde.<br />
<br />
 Die Integrationsmethode der Firma reicht allerdings &#252;ber die
kundenorientierten Systeme hinaus. Ein anderes Integrationsprojekt,
das Projekt Integration On-Ramps, soll die Lieferzentren von
Staples und Quill zusammenf&#252;hren k&#246;nnen.<br />
<br />
 <b>Integrationsmodule</b><br />
 Staples hatte das B&#252;romaterial-Versandhaus Quill 1998
erworben. Um die zwei nicht kompatiblen Bestellmanagementsysteme zu
integrieren, h&#228;tte Staples die Point-to-Point-Route
w&#228;hlen k&#246;nnen, die den Bau massgeschneiderter
Verbindungen zwischen den beiden Applikationss&#228;tzen n&#246;tig
gemacht h&#228;tte.<br />
<br />
 Das Team von Staples hat stattdessen die Einf&#252;hrung eines
Integrationsmoduls auf MQ-Series von IBM basierend gew&#228;hlt.
"So m&#252;ssen wir bei einer weiteren Firmen&#252;bernahme oder
wenn wir sp&#228;ter mehr Platz ben&#246;tigen, kein weiteres
Punkt-zu-Punkt-Integrationsprojekt durchziehen", erl&#228;utert
Gaffney.<br />
<br />
 Die Verringerung der Anzahl direkter Verbindungen zwischen den
Systemen ist ein Teil von Gaffneys holistischer Strategie.
Standardisierung ist ein weiterer. "Jede IS-Organisation versucht,
mehr f&#252;r weniger Geld zu liefern. Ein Mittel dazu ist die Zahl
der verschiedenen Technologien, welche die Angestellten beherrschen
m&#252;ssen, zu reduzieren. Wenn man f&#252;nf oder noch mehr
Technologien hat, verzettelt man das Wissen seiner Angestellten.
Ich glaube, das ist ein wichtiger Faktor f&#252;r die
Produktivit&#228;t", erkl&#228;rt Gaffney die Situation und seine
Anspr&#252;che. Staples sucht nun nach M&#246;glichkeiten der
Standardisierung, und Gaffney weist darauf hin, dass Web-Dienste
eine Schl&#252;sselrolle dabei spielen werden.<br />
<br />
 Gaffney wird seine Plattform entweder auf die Java 2 Plattform
Enterprise Edition (J2EE) von Sun Microsystems oder auf Dotnet von
Microsoft standardisieren, mit beiden Systemen kommen Web-Dienste
klar. "Wir halten es f&#252;r wichtiger, uns auf eine gute Semantik
zu konzentrieren, anstatt uns darin festzubeissen, ob es nun eine
J2EE- oder Microsoft-Entwicklung werden soll", h&#228;lt er
fest.<br />
<br />
 Um weiterhin eine umfassende Integrationsstrategie seiner
IS-Organisation zu unterhalten, hat Gaffney ein Team, geleitet
durch zwei Abteilungsleiter der IS, aufgestellt, in dem Angestellte
aus s&#228;mtlichen Gesch&#228;ftsbereichen vertreten sind. So
verschafft er sich und seinem Unternehmen eine detaillierte Ansicht
aller Firmenabl&#228;ufe. Das Team muss Anwender und Technologien
in Einklang bringen, um beispielsweise zu verhindern, dass mehrere
Gruppen verschiedene Technologien verwenden, um damit das selbe
Ziel zu erreichen. Diese Abstimmung treibt jene
Integrationsprojekte voran, die sich am st&#228;rksten auf das
Gesch&#228;ft auswirken werden.<br />
<br />
 <b>Panoramansicht</b><br />
 Wie der CIO bei Staples streicht auch Webb Edwards, CEO des
Bankunternehmens Wells Fargo Services, die Bedeutung des Kunden in
der Integrationsstrategie des Unternehmens heraus. "Wir wollen,
dass unsere Kunden jedes Ger&#228;t und jeden Kanal verwenden, der
dieses Gef&#228;ss unterst&#252;tzt. Damit sollen sie jedes
Gesch&#228;ft innerhalb von Wells Fargo ausf&#252;hren, zu jedem
Produkt innerhalb dieses Gesch&#228;ftes und zu jedem St&#252;ck
Information &#252;ber dieses Produkt oder den Dienst gelangen, den
sie brauchen", detailliert Edwards, welcher der Technologiegruppe
der Bank vorsteht. Es ist die IT-Integration hinter der B&#252;hne,
die es Wells Fargo erm&#246;glicht, diese Unternehmensphilosophie
zu realisieren.<br />
<br />
 <b>&#220;bersichtlichkeit</b><br />
 Ein Schl&#252;sselprodukt daf&#252;r ist das Enterprise Customer
Profiling and Referrals, das den Kundendienstvertretern &#252;ber
eine Echtzeitansicht Einblick in die gesamten Kontakte des Kunden
mit der Firma erm&#246;glicht und die Bedienung dieses Kunden
wesentlich erleichtert.<br />
<br />
 Falls ein Kunde Informationen &#252;ber seine Kreditkarte
ben&#246;tigt und anschliessend wissen m&#246;chte, wie er seine
Hypothek abzahlen kann, muss der Kundendienstmitarbeiter keine 15
verschiedenen Programme mehr durchw&#252;hlen, um zu dieser
Information zu gelangen. Vielmehr erscheint alles auf ein und
demselben Bildschirm. Das System legt dem Kunden Empfehlungen vor
und leitet diese automatisch als interne Verkaufsleistung an die
entsprechende Gesch&#228;ftsabteilung weiter. Die Kunden
m&#252;ssen ihre Angaben nur einmal eingeben. Die Antworten fallen
pr&#228;ziser aus.<br />
<br />
 Eine derartige Vernetzung bedeutet die Schaffung einer neuen,
gemeinsamen Infrastrukturschicht, die von Edwards und seinem Team
die Unternehmens-Servicearchitektur genannt wird. Sie dient zur
Verarbeitung s&#228;mtlicher Kundentransaktionen. Dieses Jahr hat
die Firma &#252;ber zwanzig Millionen Dollar in diese neue
Architektur und ins Kundenprofil-Projekt investiert. Beide stecken
zur Zeit noch immer in der Pilotphase.<br />
<br />
 Die in San Francisco beheimatete Bank setzt eine Reihe sowohl
selbstfabrizierter wie eingekaufter Integrationstools ein. "Wenn es
ein Produkt sein wird, das uns im Markt von den anderen
Finanzinstituten unterscheidet, dann werden wir es wahrscheinlich
selbst bauen, nicht kaufen. Wenn es ein Dienst sein wird, der uns
nicht von den anderen unterscheidet, dann kaufen wir ihn bei einem
Hersteller ein", legt Edwards dar, der seit dem Zusammenschluss mit
Norwest von 1999 bei Wells Fargo arbeitet.<br />
<br />
 "Weil in den Altsystemen eine riesige Anzahl von Informationen
lagern," meint er, " werden wir einen zus&#228;tzlichen Adapter
oder &#220;bersetzer kaufen, der jene Technologie konvertiert,
damit sie bei der Service-Architektur eingesetzt werden
kann."<br />
<br />
 <b>Regelvielfalt</b><br />
 Um Daten auf diesen vielen verschiedenen Systemen herumzuschieben,
setzt Edwards auf XML und f&#252;gt hinzu, es werde in Zukunft den
tragenden Eckpfeiler bilden. Er sch&#228;tzt die enorme Werbung
rund um XML und Webservices kritisch ein: "Noch ist kein Anbieter
in der Lage, ein L&#246;sung f&#252;r End-zu-End-Integrationen
anbieten zu k&#246;nnen."<br />
<br />
 Edwards h&#228;lt einige Regeln f&#252;r seine
Integrationsstrategie parat:<br />
<br />
 1) Verstehe die Erwartungen des Kunden in der virtuellen
Welt.<br />
 2) Nutze Technologie als Katalysator zur Neu-strukturierung der
Firma in Richtung kundenzentrierte Prozesse.<br />
 3) Achte darauf, dass eine Information am richtigen Ort zur
richtigen Zeit die richtige Person erreicht.<br />
 4) Installiere ein sicheres, robustes, ausbauf&#228;higes und
offenes Netzwerk.<br />
 5) Investiere dein Geld dort, wo Geld zur&#252;ck-fliesst;
integriere dann die Gesch&#228;fte, die Gewinne abwerfen und
bediene die lukrativen Kunden.<br />
<br />
 <b>Standardfanatiker</b><br />
 Bei Dow Chemical setzt man auf zuverl&#228;ssige Standards, wenn
es um die ganzheitliche Integrationsstrategie geht.<br />
<br />
 Laut Frank Luijckx, Senior-Direktor f&#252;r Informationssysteme,
verl&#228;sst sich Dow auf die Kernelemente des global integrierten
SAP R/2 ERP-Systems, das anfangs der neunziger Jahre installiert
wurde. Das Programm Dow Workstation verwaltet die genormten PC der
50000 Angestellten in den insgesamt 170 L&#228;ndern. Ein Data
Warehouse gibt s&#228;mtlichen Unternehmensabteilungen eine
konsistente Sicht der Finanzen. Und derzeit wird an Downet
gearbeitet, einem Voice-over-IP-Netzwerk, das am Ende erreicht
haben soll, dass Telefone, Workstations und Server
zusammengeh&#246;ren.<br />
<br />
 Das ist nur die interne Sicht der Dinge. Im Bereich des
elektronischen Handels bietet "Dow-My-Account@Dow" an, ein
privates, kundenspezifisches Extranet f&#252;r Transaktionen und
f&#252;r den Informationsaustausch. Es nimmt an Omnexus teil, einem
E-Marktplatz der Plastikindustrie und an Elemica, einer
B2B-B&#246;rse f&#252;r chemische Transaktionen.<br />
<br />
 Luijckx sagt, dass sich das Schwergewicht auf Standards und
Integration bereits bezahlt gemacht habe, wenn man etwa an den 11,6
Milliarden Dollar teuren Zusammenschluss mit Union Carbide im Jahre
1999 denkt. "Die beiden Firmen waren nach zw&#246;lf Monaten
vereinheitlicht", pr&#228;zisiert er. "Erm&#246;glicht wurde das
durch unsere gut gepflegte Integrationskultur. Wir wussten, wie wir
personelle Ver&#228;nderungen bew&#228;ltigen k&#246;nnen. Wir
bestanden darauf, unsere Standards f&#252;r die Kontenerstellung
und das Kundencodieren zu verwenden."<br />
<br />
 Die Vereinheitlichung auf die ERP-Standards von Dow zeigt, wie
sehr die Firma den Grundsatz der Integration zu leben gewillt ist.
Dow will Union Carbide (UC) eine Generation zur&#252;ckf&#252;hren.
UC verwendet SAP R/3, und Dow hoffte, dieses neuere System auf ihr
Mainframe-basiertes SAP R/2-System ziehen zu k&#246;nnen. Auch wenn
dies eine Ver&#228;nderung f&#252;r UC bedeutet, "wir von Dow haben
einen triftigen Grund zur R&#252;ckf&#252;hrung. Das System ist
f&#252;r alle das Beste, und zudem ist Integration eines der
wichtigen Leitmotive unserer Firma", erg&#228;nzt Luijckx.<br />
<br />
 Punkt-zu-Punkt-Integration findet in Dows interner Architektur
keinen Platz, sie wurde bereits zum Zeitpunkt der
SAP-Einf&#252;hrung verworfen. F&#252;r die Leute bei Dow war die
Methode sinnlos. "Angenommen, ein Kunde sagt, ich will eine
B-2-B-Verbindung zu eurem System aufbauen", erkl&#228;rt Luijckx,
"doch der Kunde bestellt zugleich in Europa, Lateinamerika, Asien
und Afrika. Dazu muss man dann vier verschiedene Verbindungen
aufbauen; ein richtiges Alptraumszenarium." Darum hat sich Dow
f&#252;r eine standardisierte SAP-L&#246;sung entschieden.<br />
<br />
 Statt zahllose Ver&#228;nderungen an 20 nicht integrierten
Systemen vorzunehmen, wurde eine einzige Ver&#228;nderung
durchgef&#252;hrt und das war's dann, meint Luijckx und
erl&#228;utert weiter, dass die Vereinheitlichung auf ein einziges
ERP-System zu h&#246;herer Produktivit&#228;t und zur Verbesserung
des Kundendienstes gef&#252;hrt habe.<br />
<br />
 Mit Webservices, findet Luijckx, experimentiere die Firma, wolle
aber noch genau analysieren, welche Kosten die Technologie f&#252;r
Gesch&#228;fts-und Systemarchitektur unter Umst&#228;nden nach sich
ziehen w&#252;rde.<br />
<br />
 Luijckx h&#228;lt drei Integrationstipps auf Lager: 1. Man
vergewissere sich, dass das Gesch&#228;ft wertgesteuert und nicht
technologiegesteuert ist. 2. Man vergewissere sich, dass man intern
und extern standardisiert arbeitet, sowohl auf Gesch&#228;ftsniveau
wie in der Technik, die Hard- und Software umfassen sollte; aber
auch bei den Codestrukturen und beim Austausch von Informationen
&#252;ber Intranet. 3. Man vergewissere sich, dass alle den Begriff
des "Wertes" gleich verstehen, was bei personellen
Ver&#228;nderungen die gr&#246;ssten Probleme bereitet. "Man muss
das predigen, bis es jeder intus hat und Freude daran bekommt. Das
hat man immer wieder neu zu erkl&#228;ren", unterstreicht
Luijckx.<br />
<br />
 <b>Integration bedeutet Wert</b><br />
 Bei Dell Computer halten integrierte Systeme wie in einer
ultraeffizienten Lieferkette die 30-Milliarden-Dollar-Firma am
Laufen. "Wir sehen Integration als End-zu-End-Vorgang, nicht nur
als Teil des Gesch&#228;ftes", erkl&#228;rt Randy Mott, der
fr&#252;her CIO bei Wal-Mart Stores war und vor zwei Jahren zu Dell
gestossen ist.<br />
<br />
 F&#252;r Dell ist die Integration wesentlich, um die
Geschwindigkeit und den Kundendienst zu garantieren. Zwei Punkte,
die sich der texanische Rechnerbauer aufs Banner geschrieben hat.
"Wenn die Integration fehlt, verliert man an Tempo und
F&#228;higkeit, rasch auf Kundenbed&#252;rfnisse zu reagieren",
erl&#228;utert er.<br />
<br />
 Dell ist derzeit vollauf damit besch&#228;ftigt, ihre globalen
betrieblichen und logistischen Prozesse in den Fabriken zu
verbessern und ihre Lieferanten mit einem Integrationsprojekt
namens DSi2 zu b&#252;ndeln. Dieses Produkt des
Lieferketten-Herstellers I2 Technology erlaubt dem Demand Supply-
(DS-) Projekt, den Angestellten und Kundenbestellungen sowie
Inventarpositionen online zu betrachten. Damit gelingt es Dell,
s&#228;mtliche Komponenten alle zwei Stunden in den
Produktionsprozess einzuf&#252;gen anstatt einmal t&#228;glich, was
auch bisher schon eine ordentliche Leistung gewesen ist.<br />
<br />
 Zus&#228;tzlich k&#246;nnen Dell-Lieferanten Ausk&#252;nfte
&#252;ber ben&#246;tigtes Material mit Lieferfristen online
einholen. Das Ergebnis dieser Integrationsanstrengungen? Dell hat
das verf&#252;gbare Inventar von Komponenten um einen Tag von
f&#252;nf auf vier Tage reduzieren k&#246;nnen. Die Firma erwartet
einen Gewinn, der schon in den ersten drei Jahren mehr als das
F&#252;nffache der Kosten des DSi2-Projektes betragen soll. DSi2
wurde 2000 gestartet.<br />
<br />
 Ein weiteres Projekt in Dells Integrationsplan ist Dell-Serv, eine
Web-basierte Applikation, die von &#252;ber 7500 Supporttechnikern
in neun L&#228;ndern verwendet wird. Sie hilft beim Beantworten der
&#252;ber 80 000 technischen Anfragen, die Dell t&#228;glich
erreichen, und verbindet die 14 verschiedenen Systeme, die
fr&#252;her verwendet wurden. Eines dieser Systeme war eine
Applikation basierend auf Visual Basic und SQL-Server, die Dells
technischer Support in Europa f&#252;r das Ausf&#252;llen von
Bestellungen und die Validierung von Adressen verwendete.<br />
<br />
 "DellServ ist gut integriert mit unseren anderen Backend-Systemen
wie Bestellung, Verkaufsgeschichte und Kundeninteraktionen",
&#228;ussert sich Mott. Die Vertreter erhalten zus&#228;tzliche
Informationen &#252;ber die Kunden. Die L&#228;nge der Anrufe und
die Anzahl wiederholter Anrufversuche hat sich verringert.<br />
<br />
 Mott legt Wert auf die Bedeutung von Standards in Dells
Integrationsstrategie: "Die sind aufgrund der Geschwindigkeit
wichtig, mit der man Systeme mit einer Standardarchitektur aufbauen
kann, und wegen der Nahtlosigkeit, mit der man Systeme
einf&#252;hrt und benutzt."<br />
<br />
 Mott und seine Angestellten benutzen eine Mischung von Bausteinen
wie Dotnet von Microsoft, Oracle-Datenbanken und
Linux-Technologien. "Integration muss ein flexibler
verst&#228;ndlicher Begriff werden, aus dem eine Synergie
resultiert", setzt er auseinander.<br />
<br />
 Dell verwendet einige der Webservices von Dotnet, setzt aber diese
Technik nur intern ein, "wir m&#252;ssen diese Architektur
kontrollieren k&#246;nnen."<br />
<br />
 Mott erinnert stark an einen Autorennfahrer, weil er st&#228;ndig
das Wort "Speed" im Gespr&#228;ch &#252;ber Integration und dessen
Auswirkungen gebraucht. "Man muss sich vergewissern, dass die
Integration tats&#228;chlich alles beschleunigt." Und weiter: "Wenn
wir nach Integrationsm&#246;glichkeiten Ausschau halten, wollen wir
Redundanzen entfernen und die Geschwindigkeit, mit der alle die
Aufgaben erledigt werden, erh&#246;hen. Manchmal, wenn dieses
ganzheitliche Integrationsniveau erreicht ist, glauben einige
Leute, dass alles l&#228;nger dauert. Das darf aber nicht
passieren."<br />
<br />
 <b>Integrationsprobleme</b><br />
<br />
 Das sind die Pflastersteine auf dem Integrationsweg:<br />
<br />
 Die meisten Firmen unterhalten einige Punkt-zu-Punkt-Verbindungen,
auch Applikation-zu-Applikation genannt,und fast die H&#228;lfte
der Unternehmen sind gem&#228;ss einer Studie dabei, weitere
Applikationen miteinander zu verdrahten. Die Komplexit&#228;t
w&#228;chst.<br />
<br />
 Statt Punkt-zu-Punkt kann man auch Applikation-zu-Applikation
sagen. Derartige Methoden finden sich typischerweise innerhalb
einer Firma. Es bleibt eine bew&#228;hrte Methode f&#252;r das
Verschieben von Daten von einem Punkt A zu einem Punkt B.<br />
 Die meisten Firmen unterhalten einige solcher
Punkt-zu-Punkt-Verbindungen und viele von ihnen, n&#228;mlich fast
die H&#228;lfte, fahren fort, weitere Applikationen miteinander zu
verdrahten. So lautet jedenfalls das Ergebnis einer Umfrage der
Marktforschungsfirma AMR Research aus dem letzten Jahr.<br />
<br />
 Das f&#252;hrt zu folgenden Problemen. Stellt man sich eine Firma
vor, die 100 Applikationen laufen hat, jede davon in einem eigenen
Kasten. Wie viele Leitungen sind n&#246;tig, um diese K&#228;sten
miteinander zu verbinden, vorausgesetzt, dass ein Teil dieser
Applikationen mit mehr als einer anderen verbunden werden muss? Auf
jeden Fall ergibt sich ein Wollkn&#228;uel in den Krallen einer
Katze. Wenn eine Applikation ver&#228;ndert wird, muss jede
Verbindung zu ihr mutiert werden; die Entwicklungs- und
Pflegekosten sind deshalb entsprechend horrend hoch.<br />
<br />
 <b>Middleware</b><br />
 Ob man sie nun Objekt- oder Event-Management nennt, ob
Session-Management oder Daten&#252;bersetzung, Middleware bildet
eine Schicht zwischen Applikationen. Die Applikationen sind nicht
Punkt-zu-Punkt miteinander verbunden, sondern &#252;ber eine
Mittler-Schicht. Sie empf&#228;ngt die Daten, &#252;bersetzt und
schickt sie anschliessend auf ihren Weg.<br />
<br />
 Viele Firmen verwenden nachrichtenorientierte Middleware wie
MQ-Series von IBM oder MSMQ von Microsoft f&#252;r den
Einweg-Datenaustausch.<br />
<br />
 EAI-Produkte, auch Integrationsserver genannt, beschreiben eine
leistungsf&#228;hige Art von Middleware. Wichtige Mitspieler sind
dabei BEA Systems, IBM, Seebeyond Technology, Tibco Software,
Vitria Technology und Webmethods. Viele Firmen bauen zudem ihre
eigenen, propriet&#228;ren EAI-Systeme auf.<br />
<br />
 EAI-Tools sind zur Integration der Information aus den
Backoffice-Systemen in die Front-Office-Applikationen entwickelt
worden. Diese Produkte werden mit Verbindungsanschl&#252;ssen, auch
Adapter genannt, ausgeliefert.<br />
<br />
 <b>Business Process Management</b><br />
 Adapter, die beispielsweise ERP-Systeme an Mainframes und an
CRM-Systeme anschliessen, werden von vielen Firmen verwendet,
obwohl sie leicht einmal 100 000 Dollar kosten, wenn heterogene
Systeme integriert werden sollen.<br />
<br />
 Business Process Management (BPM) ist ein relativ neues Schlagwort
und gilt als die Unternehmens-Integrationssoftware der
n&#228;chsten Generation. AMR Research definiert BPM als "Software,
die Daten, Applikationen und Leute durch einen gemeinsamen
Unternehmensprozess zusammenf&#252;hrt." BPM versucht, das
Gesch&#228;ft und die IS zusammenzubringen, um
funktions&#252;bergreifende Unternehmensprozesse, die Lieferanten,
Kunden, Angestellte und Partner umfassen, zu entwirren und sie dann
auch noch zu automatisieren und zu entschlacken.<br />
<br />
 <b>Web Services</b><br />
 Hoffnungen ruhen auch auf den Web Services, die entweder ganz
gross herauskommen werden oder nur noch tolle Schaumblasen
produzieren. Die standardbasierte Technologie erlaubt es
unterschiedlichen Systemen, &#252;ber Internet oder
Internet-Protokoll-basierte Netzwerke miteinander zu kommunizieren,
unabh&#228;ngig von Plattform oder Sprache. Die meisten der in
diesem Artikel erw&#228;hnten Firmen experimentieren mit Web
Services.<br />
<br />
 Richard L. Dalzell, CIO bei Amazon-Dotcom, weiss, dass
Online-Buchh&#228;ndler es als eine der Schnittstellen f&#252;r
ihre &#252;ber 600 000 Websites im Rahmen des Associates Programms
verwenden, um Partnerfirmen mit Amazon-Dotcom zu verbinden.<br />
<br />
 Hersteller wie Microsoft und SAP achten darauf, dass ihre Produkte
Web-Services unterst&#252;tzen. Doch das angesagte Wunderkind "Web
Services" steckt noch in der Eierschale und seine Schwingen wird es
kaum &#252;ber Nacht ausbreiten, um in einer Weltumrundung seine
Faszination beweisen zu k&#246;nnen.<br />
<br />
 <b>5 Tipps f&#252;r eine gut gef&#252;hrte Integration</b><br />
 1.) Das Gesch&#228;ft lenkt den Prozess: "Ein gr&#252;ndliches
Verst&#228;ndnis der unternehmerischen Anforderungen ist
n&#246;tig. Der Ort, wo sich diese Anforderungen entwickeln, ist
der Startpunkt f&#252;r den Aufbau einer Integrationsstrategie.
Ansonsten verkommt sie zu einer technischen Diskussion",
erkl&#228;rt Lloyd B. Taylor, Unternehmensvizepr&#228;sident
f&#252;r IT beim Nahrungsmittelhersteller Cargill. Die Firma baute
ein Enterprise Application Integration Center of Expertise auf,
einen Supermarkt f&#252;r Firmenabteilungen mit
Integrationsgel&#252;sten.<br />
<br />
 2.) Die Vorz&#252;ge der Integration sind dem gesch&#228;ftlichen
Kader klar zu machen. Gewiss wird man dies mit jeder IT-Initiative
tun, aber es ist einfacher, die Vorz&#252;ge eines CRM-Systems zu
erkl&#228;ren als die eines EAI-Projektes. Paul Gaffney, CIO bei
Staples, betont die Bedeutung der Einbindung der
Gesch&#228;ftsleitung. Bei der Formulierung der Strategie empfiehlt
er, eine harte Linie zu verfolgen. "Letztendlich f&#252;hrt die
Integration zus&#228;tzliche Kostenvorteile und Hilfsmittel ins
Gesch&#228;ftsleben ein", ist er &#252;berzeugt.<br />
<br />
 3.) Zuerst vor der eigenen T&#252;r wischen, dann nach draussen
blicken. Man sollte darauf achten, eine klare Vision f&#252;r die
unternehmensweite Integration zu verfolgen, bevor man sich mit
externen Partnern trifft. Wenn man den Status einer Bestellung
schon intern nicht abrufen kann, wird es ein Lieferant erst recht
nicht k&#246;nnen.<br />
<br />
 4.) Man sollte nur soviel in den Mund nehmen, wie man auch kauen
kann. Integrationsprojekte verschlingen einen saftigen Teil des
IT-Budgets. In einer neueren Studie von Forrester Research bei 50
grossen Unternehmen sch&#228;tzen die Antwortenden, dass sie im
Jahr 2003 rund 6,4 Millionen Dollar f&#252;r Integration ausgeben
werden. Dabei laufen deren Integrationsprojekte bereits
durchschnittlich seit 20 Monaten. Integrationstools sind nicht
billig. Laut Gautam Desai, Analyst bei der Beratungsfirma Doculabs,
kostet die Softwarelizenz f&#252;r eine typische Konfiguration
bestehend aus zwei Servern und einer Backup-Umgebung zwischen 300
000 und 750 000 Dollar. Dienste, welche die Erstintegration zum
Laufen bringen, sind zweieinhalb- bis f&#252;nfmal so teuer. Darum
sollte man erst einmal klein anfangen und auf dem Abteilungsniveau
bleiben. Man kann sich bew&#228;hren, bevor man - sp&#228;ter dann
- expandiert, wenn sich die Lernkurve abgeflacht hat und die Pannen
seltener geworden sind.<br />
<br />
 5.) Gegenwert f&#252;rs Geld. "Man gibt dort Geld aus, wo viel
Geld ist", sagt C. Webb Edwards, CEO von Wells Fargo Services,
&#252;ber die Integrationsausgaben. "Man integriert jene Firmen,
bei denen man verdienen kann und man bevorzugt die profitablen
Kunden, wenn die nur sicher eine bestimmte Summe ausgeben
k&#246;nnen. Man investiert seine Dollars bei den Unternehmen, bei
denen man auch einen Einfluss auf das Firmenergebnis haben
kann."<br />
<br />
</span></td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

