<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Der Traum
von der freien Softwarewelt</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Als Protagonist der
"Free-Software"-Bewegung k&#228;mpft der Amerikaner Richard
Stallmann f&#252;r eine Welt, in der ausschliesslich freie Software
zur Anwendung kommt und keinerlei Raum mehr f&#252;r
propriet&#228;re Produkte vorhanden ist.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 20.09.2002<br />
 <b>Rubrik:</b> Fokus Orbit/Comdex 2002<br />
 <b>Autor:</b> Ludger Schmitz (Mitarbeiter Computerwoche
Deutschland)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Die sogenannte
Free-Software-Bewegung definiert sich selbst &#252;ber ethische
Gr&#252;nde, dass n&#228;mlich die Anwender die Freiheit haben
sollten, Software gemeinsam zu nutzen und auszutauschen. Um dies
legal zu gew&#228;hrleisten, entwickelten die Mitglieder dieser
Bewegung "freie Software". Zu den Protagonisten und
medienwirksamsten Streitern der Free-Software-Bewegung z&#228;hlt
Richard Stallmann. Ludger Schmitz unterhielt sich vor kurzem mit
dem Idealisten und Querdenker &#252;ber die Stossrichtungen seines
IT-Bekenntnisses zur Freiheit.<br />
<br />
 <b>Computerworld:</b>&#160;<i>Warum bestehen Sie auf der
Bezeichnung GNU/Linux statt einfach Linux?</i><br />
<br />
<br />
 <b>STALLMAN:</b> Linux ist der Kernel, ein bedeutendes von vielen
Programmen des Betriebssystems, welches das GNU [1]-Projekt 1984
gestartet hat. Wir haben daf&#252;r etliche Programme geschrieben,
und einige sind genauso wichtig wie der Linux-Kernel. Unser
GNU-Betriebssystem war 1991 fast fertig, es fehlte nur der Kernel.
Den Kernel von Linus Torvalds kombinierten andere Leute mit unserem
unvollst&#228;ndigen GNU-System.<br />
<br />
 Das Gesamtsystem Linux zu nennen ist nicht korrekt: Man spricht
Linus das ganze Verdienst f&#252;r eine Arbeit zu, die wir begonnen
und in vielen Schritten vorangebracht haben. Linus war es, der mit
seinem Kernel den letzten Schritt &#252;ber die Ziellinie
erm&#246;glichte. Daher tendieren die Leute dazu, ihn stark zu
beachten. Er ist genau so wichtig wie alle anderen
GNU-Entwickler.<br />
<br />
 <i>Wie viel im Betriebssystem ist GNU beziehungsweise
Linux?</i><br />
 F&#252;r ein Betriebssystem muss man nicht alles neu schreiben. Es
ist okay, Dinge zu integrieren, die man vorfindet. Das GNU-System
von 1991 umfasst neben Programmen von uns auch solche von anderen
Entwicklern, die kein Betriebssystem zum Ziel hatten, zum Beispiel
das X-Window-System. 1995 hat ein Distributor eines
GNU/Linux-Systems nachgerechnet, dass 28 Prozent der Codezeilen der
Distribution vom GNU-Projekt stammten und der Linux-Kernel drei
Prozent zum Gesamtsystem beitrug.<br />
<br />
 <i>Was will die Free-Software-Bewegung eigentlich genau?</i><br />
 Unser Motiv ist idealistisch. Wir arbeiten f&#252;r das Ziel,
unsere Computer frei nutzen zu k&#246;nnen. Wenn man
propriet&#228;re Programme verwendet, ist einem diese Freiheit
genommen. Wenn man kein freies Betriebssystem hat, wird die
Freiheit mit F&#252;ssen getreten. Deshalb ist der erste Schritt,
unfreie durch freie Betriebssysteme zu ersetzen. Wir haben
dar&#252;ber hinaus erkannt, dass freie Software oft praktische
Vorteile hat. Dazu z&#228;hlen die gr&#246;ssere Sicherheit, die
geringere Fehlerquote, das Fehlen von Spyware und die gr&#246;ssere
Zuverl&#228;ssigkeit. Aber es geht auch um den ethischen und
sozialen Nutzen. Im Mittelpunkt steht die Frage, in welcher Art von
Gesellschaft man leben m&#246;chte.<br />
<br />
 <i>Wie sehen Sie in Abgrenzung davon die
Opensource-Bewegung?</i><br />
 Der grosse Unterschied besteht in den Philosophien der zwei
Bewegungen. Die Opensource-Bewegung hebt nur die praktischen
Vorteile hervor und besch&#228;ftigt sich nicht mit dem Aspekt, was
ethisch oder gesellschaftlich richtig oder falsch ist. Ihre
Definition von Opensource-Software stimmt weitgehend mit unserer
von freier Software &#252;berein, aber sie sind nicht identisch.
Das f&#252;hrt dazu, dass es Lizenzen gibt, die sie als Opensource
akzeptieren, w&#228;hrend wir sie f&#252;r zu restriktiv halten und
deshalb nicht als freie Software akzeptieren. Es ist schlimm
f&#252;r uns, dass wir mit den Begriffen der anderen Bewegung
belegt werden. Wenn man sagt, wir w&#252;rden an
Opensource-Software arbeiten oder mich als Begr&#252;nder der
Opensource-Bewegung bezeichnet, ist das schlecht f&#252;r die
Free-Software-Bewegung. Man stelle sich vor, was los w&#228;re,
wenn jedes Programm der Sozialdemokraten als christdemokratisches
bezeichnet w&#252;rde.<br />
<br />
 <i>Glauben Sie, dass sich Unternehmen f&#252;r eine Software aus
anderen als technologischen und &#246;konomischen Gr&#252;nden
entscheiden?</i><br />
 Das h&#228;ngt davon ab, wie weise sie sind. Wer kurzfristig
denkt, interessiert sich wahrscheinlich nur daf&#252;r, was das
billigste Programm ist, um beispielsweise eine Aufgabe noch in
diesem Jahr erledigen zu k&#246;nnen. Langfristig Denkende werden
bemerken, dass es schlecht f&#252;r sie ist, wenn andere auf Dauer
kontrollieren k&#246;nnen, was sie mit ihren Computern und Daten
machen.<br />
<br />
 <i>Ist bei freier Software nur ein Gesch&#228;ft mit Support,
Services und Consulting m&#246;glich?</i><br />
 Das sind die wichtigsten Bereiche. Aber es gibt auch Firmen, die
Kopien von freier Software verkaufen. Das ist auch
m&#246;glich.<br />
<br />
 <i>Also ist freie Software nicht notwendigerweise "frei" im Sinne
von Freibier?<br />
</i> Genau, es ist nicht unbedingt Gratissoftware. Es ist Software,
die Freiheit respektiert.<br />
<br />
 <i>Sobald man das Internet nutzt, verwendet man - ohne es zu
wissen - propriet&#228;re Programme auf irgendwelchen fremden
Servern. L&#228;sst sich der Gebrauch von propriet&#228;rer
Software &#252;berhaupt verhindern?<br />
</i> Man verwendet diese Software nicht direkt, nicht unmittelbar.
Der Anbieter von Internetdiensten verwendet sie. Der Internetnutzer
ist nicht daf&#252;r verantwortlich. Jemand, der den Server
betreibt, hat die Freiheit, Software zu installieren - und das
nat&#252;rlich nur auf seinem eigenen Rechner. Niemand hat das
Recht, Software auf fremden Systemen zu installieren oder
auszutauschen. Was auf anderen Rechnern l&#228;uft, sollte sich
aber nicht jeder Kontrolle entziehen. Wenn es einige Netz-Server
g&#228;be, die so wichtig w&#228;ren, dass jeder sie benutzen
m&#252;sste, w&#228;ren Restriktionen n&#246;tig. Genauso wie
Monopole dereguliert werden. Wenn es solche unausweichlichen Server
g&#228;be, w&#228;re es sinnvoll, dass eine Regierung vorschriebe,
wie sie betrieben werden.<br />
<br />
 <i>Sehen Sie einen Bedarf f&#252;r ein Free-Java?</i><br />
 Das brauchen wir und wir arbeiten auch daran. Der
GNU-Java-Compiler GJC umfasst die grundlegende Java-Plattform. Aber
wir m&#252;ssen noch mehr tun. Wir haben noch nicht alle Features
von Java. Zum Wohle der Java-Programmierer brauchen wir unbedingt
eine freie Plattform f&#252;r Java, wir haben nur eine
unvollst&#228;ndige.<br />
<br />
 <i>Wie l&#228;uft es bei Dot-GNU?</i><br />
 Ich kenne die Details nicht genau. Da m&#252;ssen Sie die
Entwickler fragen<br />
<br />
 <i>Wird es im Rahmen dieser Entwicklung auch eine Alternative zu
Microsofts Single-sign-on-Verfahren Passport geben?<br />
</i> Dot-GNU braucht eindeutig etwas, das Passport er&#252;brigt.
Anders als bei Dotnet, bei dem das Ziel darin besteht, dass jeder
seine Daten auf Microsoft-Servern speichert, besteht unser Ziel
darin, den Anwendern Flexibilit&#228;t zu geben, wo sie ihre Daten
speichern wollen.<br />
<br />
 <i>Die Entwicklung freier Software scheint stets eine Reaktion auf
propriet&#228;re Innovationen zu sein.<br />
</i> Man muss es machen. Anwender hassen Inkompatibilit&#228;ten in
Folge von Ver&#228;nderungen. Ein Java-Programm wollen sie nicht in
C &#252;bersetzen m&#252;ssen, sondern sie wollen ein System, das
Java unterst&#252;tzt. Also implementieren wir jede Plattform, die
popul&#228;r ist. Sicher tragen auch wir zur Innovation bei. Aber
wenn wir die Plattformen nicht unterst&#252;tzen, welche die
Anwender brauchen und erwarten, machen wir keinen guten Job.
Deshalb wollen wir auch noch einen Cobol-Compiler entwickeln. Nicht
dass wir meinten, Cobol sei sehr innovativ, sondern weil die
Anwender Cobol verwenden.<br />
<br />
</span></td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

