<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Mit Kurs
auf verteilte Applikationen</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Microsoft macht mit
der Ausrichtung auf Sicherheit und der Lancierung so
unterschiedlicher Produkte wie ".NET"-Server und Xbox einen Wandel
durch. Computerworld hat sich nach den Konsequenzen in der Schweiz
erkundigt.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 23.08.2002<br />
 <b>Rubrik:</b> Hintergrund<br />
 <b>Autor:</b> Wolfgang B&#246;hler<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Mit der
Xbox-Spielkonsole und der "Windows .NET"-Serverlinie startet
Microsoft die n&#228;chste breite Produktoffensive. Seit einem Jahr
steuert in der Schweiz &#252;berdies Alexander St&#252;ger die
Geschicke des nationalen Ablegers der Redmonder Softwarefirma.
Computerworld hat dies zum Anlass genommen, sich mit dem neuen
Gesch&#228;ftsf&#252;hrer und dem Dotnet-Spezialisten Christian
Frei &#252;ber die allgemeine Strategie der Firma und ihre
Auswirkungen auf die Schweiz zu unterhalten.<br />
<br />
 <b>Computerworld:</b> <i>B&#252;roapplikationen sind nicht
unbedingt sexy und Bill Gates wirkt wie ein in die Jahre
gekommener, biederer Schulbub.</i><br />
 <b>Alexander St&#252;ger:</b> So bieder kann Bill Gates nun auch
wieder nicht sein, angesichts der Tatsache, dass st&#228;ndig Leute
Interviews mit ihm f&#252;hren und seine Meinung zum Thema
Unternehmensf&#252;hrung h&#246;ren wollen. Steve Ballmer halte ich
selber f&#252;r einen der pointiertesten Unternehmensf&#252;hrer -
im Dialog mit Kunden und Universit&#228;ten und in der Motivation
der eigenen Mitarbeiter. Zudem gibt es meiner Meinung nach wenig
Unternehmen, in denen die Gr&#252;nder nach wie vor selber am
Steuer stehen. F&#252;r mich ist das ein bedeutender Wert innerhalb
der Firma.<br />
<br />
 <i>Man kann Microsoft auch gut mit der Migros vergleichen: Das
Unternehmen will alle Bed&#252;rfnisse ihre Kundschaft abdecken und
kopiert Produkte von "Markenanbietern", etwa den Navigator oder den
Realplayer.</i><br />
 <b>St&#252;ger:</b> Mit dem Vergleich habe ich keine Probleme. Da
klingen f&#252;r mich Werte an wie Vertrauen, gute Verankerung im
Markt und breite Verf&#252;gbarkeit.<br />
 <b>Christian Frei:</b> Ich habe neun Jahre bei der Migros
gearbeitet und habe die Firma &#252;berhaupt nicht als bieder
empfunden...<br />
<br />
 <i>Die stark von Microsoft unterst&#252;tzte Business Software
Alliance (BSA), die gegen Softwareklau antritt, f&#246;rdert offen
das Denunziantentum und pflegt einen nicht imagef&#246;rdernden
Stil.</i><br />
 <b>St&#252;ger:</b> Da sollte man sich zun&#228;chst wie in einem
klassischen Krimi die Frage stellen: Wer ist der T&#228;ter?
Software-Piraterie ist ein fl&#228;chendeckendes Problem. In der
Schweiz gehen wir davon aus, dass etwa ein Drittel der eingesetzten
Software im Business-Bereich raubkopiert ist. In der BSA ist
&#252;berdies ja nicht bloss Microsoft organisiert. Da finden sich
auch Apple, Adobe, Symantec und viele andere. Als Marktf&#252;hrer
haben wir aber eine gewisse Verantwortung daf&#252;r, dass
Wettbewerbsgleichheit herrscht. Wenn ein Unternehmen f&#252;r die
Software zahlt und das andere nicht, dann ist die
Wettbewerbssituation nicht mehr ausgewogen. Ich glaube zudem, dass
wir einen selbstverst&#228;ndlichen Anspruch darauf haben, f&#252;r
unsere aufwendigen Entwicklungen eine entsprechende Gegenleistung
zu bekommen.<br />
<br />
 <i>Dennoch, der Stil ist f&#252;r uns Schweizer doch eher
ungewohnt.</i><br />
 <b>St&#252;ger:</b> Was den Stil der BSA angeht, muss ich sagen,
es sollte sicher nicht darum gehen, ethisch fragw&#252;rdige
Methoden anzuwenden. Fl&#228;chendeckenden Problemen kann man aus
meiner Sicht aber nur mit starken, klaren Botschaften
entgegentreten. Ein &#228;hnliches Vorgehen kann man ja bei anderen
fl&#228;chendeckenden Problemen beobachten, etwa dem Alkohol- und
Nikotinmissbrauch. Auch da zeigt man gerne in deutlichen Bildern
die Folgen des Missbrauchs auf. Ich denke, es ist gut, wenn niemand
im Land mehr sagen kann, er sei nicht dar&#252;ber informiert, dass
er illegale Dinge tut.<br />
<br />
 <b>Einstieg ins Game-Gesch&#228;ft</b> <i>Im Gegensatz zu
Microsoft haben Spielkonsolenhersteller eher den Ruch der "Bad
Guys". Die Xbox scheint wie Blei in den Verkaufsregalen zu
liegen.<br />
</i> <b>Frei:</b> Im europ&#228;ischen Vergleich steht die Schweiz
in Sachen Xbox-Verk&#228;ufen sehr gut da. Dass die Regale voll
sind, ist ja auch gut, sonst k&#246;nnten Kunden die Xbox nicht
erwerben. Der gr&#246;sste Umsatz mit Game-Konsolen bringt aber das
Weihnachtsgesch&#228;ft, das heisst, auch die Xbox werden wir vor
allem vor Weihnachten verkaufen. Das kann ich aufgrund meiner
Erfahrungen bei der Migros, bei der ich selber eine Game-Konsole
eingef&#252;hrt habe, best&#228;tigen.<br />
<br />
 <i>Hat Microsoft mit der Xbox nicht ein Marketingproblem? Oder wie
schafft man den Spagat zwischen der Marke, die im B&#252;ro- und
Gesch&#228;ftsbereich Seriosit&#228;t vermitteln soll, und der Xbox
als Ausdruck jugendlichen Rebellentums?<br />
</i> <b>St&#252;ger:</b> Die Frage ist, ob die Xbox das Image der
Microsoft &#228;ndern kann oder soll. Es ist nat&#252;rlich eine
Herausforderung, vom Heimbereich bis zum
Hochleistungs-Gesch&#228;ftsserver alles abzudecken. Wir
w&#252;rden uns nicht w&#252;nschen, dass das Xbox-Image bei
Microsoft so dominant durchschl&#228;gt, dass wir nur noch als
Anbieter von Spielen wahrgenommen werden. Man muss da ein gutes
Mass finden.<br />
<br />
 <b>Das neue Lizenzmodell</b><br />
 <i>Das neue Lizenzmodell f&#252;r Software mit einem
Abonnementssystem f&#252;r Updates steht bei der
Microsoft-Kundschaft zum Teil in heftiger Kritik.<br />
</i> <b>St&#252;ger:</b> Mittlerweile hat der Kunde angesichts der
F&#252;lle verwendeter Produkte Schwierigkeiten, den &#220;berblick
dar&#252;ber zu behalten, wozu er nun berechtigt ist. Die neuen
Lizenzierungsschemata sind deutlich einfacher geworden, vor allem
f&#252;r alle, die sich umfassend an den neuen Technologien
orientieren.<br />
<br />
 <i>Microsoft wird ja nicht m&#252;de zu betonen, dass sie sich an
den Kundenbed&#252;rfnissen orientiert. Wurden die Kunden zuvor
konsultiert?<br />
</i> <b>St&#252;ger:</b> Ich muss einr&#228;umen, dass wir
m&#246;glicherweise zu wenig bedacht haben, was die Einf&#252;hrung
des neuen Modells f&#252;r einzelne Unternehmen bedeutet. Wir haben
aber Nachbesserungen durchgef&#252;hrt und vor allem die Fristen
der Einf&#252;hrung verl&#228;ngert.<br />
<br />
 <i>Bill Gates hat eine umfassende Sicherheits-Initiative f&#252;r
Microsoft-Produkte angek&#252;ndigt. Was f&#252;r Auswirkungen hat
diese in der Schweiz?<br />
</i> <b>Frei:</b> Die Initiative hat weltweit massive Auswirkungen.
Nach der Ank&#252;ndigung der Initiative stand die gesamte
Produktentwicklung in Redmond zwei Monate lang praktisch still. In
dieser Zeit wurde zum einen der Programmcode einer gr&#252;ndlichen
Sicherheitspr&#252;fung unterzogen. Zum andern sind die Entwickler
in Sachen Sicherheit weiter geschult worden. Eine weitere Folge
sind Werkzeuge f&#252;r unsere Kunden wie das "Security Toolkit"
oder der "Security Analyzer", der IT-Administratoren hilft,
herauszufinden, ob ihre Systeme &#252;berhaupt richtig konfiguriert
sind.<br />
<br />
 <i>Software ist das eine Problem. Das andere sind die
Anwender.<br />
</i> <b>Frei:</b> Wir haben festgestellt, dass in vielen
F&#228;llen nicht ein Softwarefehler das eigentliche Problem
darstellt, sondern eine Fehlkonfiguration. Die Grundidee der
Windows-Produkte war urspr&#252;nglich die einfache Anwendbarkeit.
Diese f&#252;hrte aber dazu, dass zu wenig geschulte
Administratoren wichtige Sicherheitsfunktionen entweder
abschalteten oder nicht in Betrieb nahmen. Beim
"Windows-.NET"-Server ist das ber&#252;cksichtigt worden. Die
Funktionen sind nun standardm&#228;ssig gesperrt. Was gebraucht
wird, muss explizit eingeschaltet werden, auch der IIS (Web Server)
oder das NetBEUI-Protokoll. In der Schweiz haben wir &#252;berdies
einen Security Officer eingesetzt, der f&#252;r Kunden und Partner
f&#252;r Sicherheitserw&#228;gungen gleichermassen zur
Verf&#252;gung steht. Zum Beispiel, wenn es darum geht, mit
"Windows-.NET"-Server eine sichere PKI-Infrastruktur zu planen. Ein
weiterer wichtiger Aspekt in Sachen Sicherheit ist die
Privatsph&#228;re des Anwenders. So unterst&#252;tzt der Internet
Explorer etwa P3P...<br />
<br />
 <i>...das auch schon den &#220;bernamen "Pretty Poor Privacy"
bekommen hat...<br />
</i> <b>Frei:</b> P3P ist heute ein W3C-Standard und wird von den
unterschiedlichsten Unternehmen unterst&#252;tzt. Wir arbeiten auch
st&#228;ndig an der Weiterentwicklung von Privacy-Technologien mit.
Wenn ein Partner heute einen Passport-Vertrag f&#252;r
Authentifizierungsdienste unterschreibt, verlangen wir von ihm,
dass er selber f&#252;r die entsprechende Webseite auch noch P3P
einf&#252;hrt.<br />
<br />
 <b class="txt-m-black">Kurs auf Webservices</b><br />
 <i>Zum Thema Dotnet: In den letzten Wochen war im Fernsehen ein
Spot zu sehen, in dem ein gesetzter Herr erkl&#228;rt, er habe dank
Dotnet in ein paar Monaten die IT-Infrastruktur eines ganzen
Unternehmens umfassend integriert. Das glaubt doch kein
Mensch...<br />
</i> <b>St&#252;ger:</b> Werbung muss pr&#228;gnant zum Ausdruck
bringen, was man mit neuer Technologie alles machen kann. Die Frage
der Glaubw&#252;rdigkeit hat damit zu tun, dass das neue Konzept
wirklich einen grossen Schritt bedeutet, weg von der
Desktopebene.<br />
<br />
 <i>Ist der kurz vor der offiziellen Lancierung stehende "Windows
.NET"-Dotnet-Server in einem umfassenden Sinn ein Nachfolger
f&#252;r die aktuelle Windows-2000-Serie?<br />
</i> <b>Frei:</b> "Windows .NET" ist eine Familie von Servern, die
als Nachfolgerin der Windows-2000-Serverfamilie konzipiert ist. Neu
hinzu kommt aber auch ein "Windows .NET Webserver", zu dem es in
der Windows-2000-Reihe kein Pendant gibt. Neue Funktionen sind etwa
das native integrierte ".NET Framework", Sicherheitsfunktionen oder
der IIS 6.0.<br />
<br />
 <i>Das heisst, sie erwarten von ihren Kunden nun, dass sie von
Windows 2000 oder NT4 auf "Windows .NET" migrieren.<br />
</i> <b>Frei:</b> ".NET"-Anwendungen und die "Windows
.NET"-Serverfamilie sind zwei verschiedene Dinge. Eine auf dem
entsprechenden Framework basierende ".NET"-Applikation kann genauso
auf Windows 2000 und sogar auf Windows NT4 realisiert werden. Die
einzige Einschr&#228;nkung ist, dass wir auf NT4 aus
Sicherheitsgr&#252;nden kein ASP.NET unterst&#252;tzen.<br />
<br />
 <i>Was ist generell der Stand der Dinge in Sachen
Dotnet-Architektur?</i><br />
 <b>Frei:</b> Wir haben jetzt, nach rund zwei Jahren die erste
Phase der Dotnet-Strategie abgeschlossen. Die Plattform, die
wesentlichen Services und das Dotnet-Framework sind verf&#252;gbar.
Auch die Entwicklungswerkzeuge sind da. Gemeinsam mit
Standardisierungsorganisationen wie W3C, IETF oder ECMA haben wir
die Kerntechnologien f&#252;r Webservices - etwa XML, Soap, WSDL
und UDDI - verf&#252;gbar gemacht. Auf der Serverseite sind nun die
wichtigsten Kerntechnologien aufgesetzt. Den Anfang machte der
Biztalk-Server. Bei Kunden laufen weltweit erste Projekte, in der
Schweiz etwa bei Credit Suisse, deren Dienste in den Microsoft
Messenger implementiert wurden. Unter den Diensten, die auf der
linken Seite des Messengers fungieren, finden sie nun auch die CS.
Die Bank bietet da eine Portfolio-Watchlist. Diese L&#246;sung
basiert auf Dotnet und interoperiert mit anderen Plattformen.<br />
<br />
 <i>Nach welchen Kriterien wird ein Dienst Dritter im Messenger
aufgenommen?</i><br />
 <b>Frei:</b> Der Messenger ist grunds&#228;tzlich eine offene
Plattform. Ein anderer Partner ist etwa Fleurop/Interflora. Wichtig
ist, dass ein Dienst dem Kunden auch etwas n&#252;tzt und dass er
personalisiert ist. Wir wollen kein Werbespam im Messenger.<br />
<br />
 <b>Blick in die Zukunft</b><br />
 <i>Wie sehen die n&#228;chsten Dotnet-Schritte aus?</i><br />
 <b>Frei:</b> In der zweiten Phase von Dotnet geht es nun darum,
Grenzen abzubauen, zum Beispiel zwischen verschiedenen Systemen.
Dazu muss man die Kerntechnologien erweitern. Ein wichtiger
Standard, der noch fehlt, ist XML Webservices Security. Es braucht
mehr Standards, um auch Transaktionen &#252;ber Webservices
abwickeln zu k&#246;nnen. Ein weiterer wichtiger Schritt ist die
Technik f&#252;r "Federations", das heisst, die Grundlagen f&#252;r
den Austausch vertraulicher Daten zwischen Unternehmenspartnern
unter Wahrung des Investitionsschutzes unserer Kunden. Auch
Passport wird in dieser Richtung erweitert werden.<br />
<br />
 <i>Soviel zur Zukunft. Aber wieviele Kunden haben noch Windows NT4
in Betrieb?</i><br />
 <b>St&#252;ger:</b> Wir haben dazu keine hieb- und stichfesten
Daten. Ich w&#252;rde sch&#228;tzen, dass der Anteil an Kunden, die
noch auf NT4 setzen, bei rund zehn Prozent liegt. In Sachen
Sicherheit schaffen die neuen Technologien, die wir jetzt
einf&#252;hren aber auch neue M&#246;glichkeiten. Die neue
Sicherheitsstrategie hat auch dazu gef&#252;hrt, dass die
Implementierung einer neuen Funktion zur&#252;ckstehen muss, wenn
sie mit Sicherheits&#252;berlegungen im Konflikt steht.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

