<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Trend
zur&#252;ck zum "Speicher-Zentrum"</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Die Zukunft der
Speichermedien dreht sich um das Entstopfen von Netzwerken und
gr&#246;ssere &#220;berschaubarkeit.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 04.09.1998<br />
 <b>Rubrik:</b> Hintergrund<br />
 <b>Autor:</b> Kevin Burden (Mitarbeiter Computerworld USA)<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Die meisten Leute folgen
solange blind einem Trend, bis dieser sie in Schwierigkeiten
bringt. Als die Unternehmenswelt beispielsweise in den 80er Jahren
damit begann, Speichermedien zu dezentralisieren, schien das eine
geniale Idee zu sein - bis die Entwicklung in einsame
Computerinseln ausartete, inkonsistente Daten zur Folge hatte und
Netze am eigenen Durchsatz erstickten. Die Speicherzukunft dreht
sich nun um eine eigentliche Rezentralisierung, das Entstopfen von
Netzwerkarterien und die Verminderung der Komplexit&#228;t dieser
Netze.<br />
<br />
 Das Internet war der Tropfen, der das Fass zum &#220;berlaufen
brachte und die R&#252;ckkehr zu einem zentralisierteren Ansatz
f&#252;r das Speichern in Gang setzte. Die Web- und namentlich die
Intranet-Techniken haben das Bewusstsein f&#252;r das Wesen des
verteilten Zugriffs auf Informationen gef&#246;rdert. Ihnen sei es
aber gr&#246;sstenteils auch zuzuschreiben, dass in Unternehmen das
durchschnittliche Bed&#252;rfnis nach Speicherkapazit&#228;t
j&#228;hrlich um bis zu 50 Prozent steige, erkl&#228;rt etwa Dennis
Casey, Analyst bei der kalifornischen Marktforscherin Strategic
Research. Anwender, die Netzwerke einst vor allem benutzten, um
E-mail zu verschicken, laden mittlerweile alles vom Web herunter,
was im geringsten ihr Interesse erregt - auch wenn dies "fette
Files" sind, die vor Bild und Audio nur so strotzen.<br />
<br />
 Heute erh&#246;hen viele Firmen laufend ihre
Speicherkapazit&#228;t, um der steigenden Nachfrage zu
gen&#252;gen. Doch gr&#246;ssere Speicher erschweren die
Netzwerkverwaltung und &#252;berlasten die Server. Die
Informatikverantwortlichen der Unternehmen verlangen simple
Netzwerke, in denen die einzelnen Speichereinheiten leicht zu
verwalten sind. Gleichzeitig soll der Zugang schnell erfolgen.
Verschiedene Speichertypen will man flexibel hinzuf&#252;gen
k&#246;nnen und die Kosten allgemein senken. Diese Anspr&#252;che
beeinflussen die Speichertechnik und ver&#228;ndern sie. Diverse
Hersteller werden in den n&#228;chsten Jahren auf die Problematik
eingehen.<br />
<br />
 <b>Storage Area Network</b><br />
 Analysten orten im Konzept Storage Area Network (SAN) den
gr&#246;ssten Einfluss auf die Speichertechnik. Ein SAN ist ein
Sammelbecken von Speichermedien - Festplatten, B&#228;nder und
optische Laufwerke - in einem eigens zugeteilten Unternetzwerk, auf
das von allen Systemen des Ethernet-basierten Hauptnetzes
zugegriffen werden kann.<br />
<br />
 Das SAN-Subnetz &#228;hnelt einem LAN, enth&#228;lt aber nur
Speichermedien. Sie arbeiten unabh&#228;ngig voneinander. Alle
Daten des Unternehmens werden dort gespeichert. Der gesamte
Datenverkehr spielt sich innerhalb des SAN ab. Erst wenn ein Server
Daten abruft, wird der Verkehr ins Client-Netz umgeschaltet.
Gegenw&#228;rtig muss die Technik allerdings als Zukunftsmusik
bezeichnet werden. Einige Versatzst&#252;cke sind bereits
erh&#228;ltlich und verschaffen dem Anwender einen Vorgeschmack auf
die Vorteile des Konzepts, wie h&#246;here Durchsatzraten und
bessere Distanz&#252;berbr&#252;ckung durch
Fibre-Channel-Verbindungen (FC). Komplett ist das Sortiment jedoch
noch l&#228;ngst nicht.<br />
<br />
 Andres Lofgren, Analyst bei der Giga Information Group, rechnet
mit einer Zeitspanne von zwei bis vier Jahren bis die ersten
grossen, auf Unix basierenden Unternehmen den SAN-Faden aufgenommen
haben. Die Ausgaben f&#252;r Interkonnektions-Hardware, wie die
erforderlichen Router und Hubs, werden die &#252;blicherweise
kostenbewussteren Windows-NT-Anwender l&#228;nger von diesem
Schritt abhalten, glaubt Lofgren.<br />
<br />
 <b>Schnell und flexibel</b><br />
 Die Verlagerung des Speichers auf ein eigenes Netzwerk befriedigt
eines der gr&#246;ssten Bed&#252;rfnisse des Endbenutzers. Die -
mit der FC-Technik - erreichbare Bandbreite von 100 MBit pro
Sekunde f&#252;r den Datentransfer gibt den Anwendern die
Geschwindigkeit, die sie verlangen, und entlastet gleichzeitig das
Client-Netz. Die Systemabteilung der First Union Corp. in
Charlotte, North Carolina, setzt jedoch noch auf einen weiteren
Aspekt des Konzeptes: Flexibilit&#228;t. Laut Systemberater Gary
Fox ver&#228;ndern SAN drastisch die Art und Weise, wie Festplatten
Servern zugeordnet werden, weil man die Systeme an den am besten
geeigneten Speichertyp anpassen kann. Ist ein schneller Zugang zu
einer gespiegelten Festplatte n&#246;tig, f&#252;gt Fox einen
FC-basierten Speicher-Array in das SAN ein. F&#252;r diejenigen
Systeme, die keinen schnellen Zugang brauchen, werde hingegen eine
bestimmte Anzahl von preisg&#252;nstigen 45-GByte-Festplatten
angeh&#228;ngt.<br />
<br />
 <b>Weniger komplex</b><br />
 Ein Hauptvorteil der SAN-Technik ist die M&#246;glichkeit,
Speicherprodukte herstellerunabh&#228;ngig zu kombinieren. Weil die
Speicherung von den Servern getrennt erfolgt, kann jeder
Disk-Array, der gerade ins Budget passt, erworben werden.
Kostenreduktion bei der Anschaffung hat immer eine hohe
Priorit&#228;t. Nicht minder wichtig ist es jedoch, ein Netzwerk
m&#246;glichst einfach und &#252;berschaubar zu halten. Michael
Zanga, Chefingenieur f&#252;r Windows NT bei der US-Firma Greenwich
Capital, verwendet bereits FC-Technik. Er entwickelt
gegenw&#228;rtig ein Netzwerk, in dem sich seine NT- und
Unix-Server die gleichen Speichermedien teilen. Sein Ziel ist es,
k&#252;nftig keinen Speicher mehr an einen bestimmten Server
anzubinden.<br />
<br />
 First-Union-Mann Fox sieht die SAN-Idee hingegen auch als
M&#246;glichkeit, die knapp gewordenen Erweiterungssteckpl&#228;tze
seiner Server freizumachen, die bislang daf&#252;r benutzt wurden,
Speichermedien anzubinden. Zum SAN braucht der Server nur noch eine
einzige Verbindung. Weil er von seinen File-Serving-Pflichten
entlastet werde, habe er zudem eine l&#228;ngere Lebensdauer. Der
Datentransfer, der sich k&#252;nftig innerhalb des SAN abspielt,
nehme schliesslich auch dem WAN einige B&#252;rden ab und
verl&#228;ngere das Leben vieler weiterer Ger&#228;te.<br />
<br />
 "Last but not least" ist die Skalierbarkeit ein Trumpf: Wenn der
erste Speicher-Array f&#252;r 30000 Dollar nicht mehr ausreicht,
kann einfach ein weiterer angeschafft werden. Es ist nicht mehr
n&#246;tig, von vornherein 100000 Dollar f&#252;r eine
Hochleistungsl&#246;sung auszugeben.<br />
<br />
 <b>Rosa Wolke</b><br />
 Die Hersteller beschreiben das SAN als Wolke. Diese Assoziation
ist wohl nicht unberechtigt, denn bis anhin handelt es sich vor
allem um ein Konzept.<br />
<br />
 Geeignete Switches, Hubs, Router und die Verbindungen zum LAN
befinden sich zwar schon auf dem Markt - ebenso die Schnittstellen:
Zum Beispiel sind das Mainframe-Interface Escon und die Systems
Application Architecture (SAA) von IBM klare SAN-Kandidaten. Es
gibt jedoch noch keinerlei Standards, die sicherstellen, dass
Server und Speichermedien verschiedenster Hersteller miteinander
kommunizieren k&#246;nnen. Die daf&#252;r zust&#228;ndige Storage
Network Industry Association wird nach eigenen Angaben mindestens
ein weiteres Jahr mit dieser Aufgabe besch&#228;ftigt sein.<br />
<br />
 Ebensowenig vorhanden sind Softwarel&#246;sungen, um die
unterschiedliche Hardware im SAN zu verwalten. Die meisten
Lieferanten von Storage-Verwaltungssoftware sind gleichzeitig die
Hersteller der Ger&#228;te, die sich bis anhin voneinander abheben
und im Markt positionieren, indem sie ihre L&#246;sungen nur
f&#252;r die eigenen Produkte verf&#252;gbar machen.<br />
<br />
 Das entscheidende Schlagwort wird jedoch Fibre Channel (FC) sein
und sich zum Industriestandard f&#252;r Schnittstellen mausern,
erkl&#228;ren die Marktforscher unisono. Die FC-Technik kann heute
bereits eingesetzt werden. Sie ist allerdings noch nicht optimiert
worden, und erreicht deshalb die von den offiziellen
Spezifikationen versprochenen 100 MBit/s Durchsatzrate nicht. FC
ist eine Weiterentwicklung von SCSI und Ethernet. Die Technik
versteht deshalb beide Protokolle. Zudem kann FC gr&#246;ssere
Distanzen &#252;berbr&#252;cken. SCSI ist limitiert auf 25 Meter,
FC schafft bis zu 10 Kilometer.<br />
<br />
 Die Analystengemeinde empfiehlt das Einrichten einer FC-basierten
Infrastruktur schon heute. Von gr&#246;sseren Distanzen und
h&#246;heren Durchsatzleistungen k&#246;nne bereits profitiert
werden, heisst es, die Verbesserung der Interkonnektivit&#228;t
folge eben sp&#228;ter. Wer auf FC umschaltet, muss die
Host-Bus-Adapterkarte in seinen Servern ersetzen sowie den
Controller im Speicher-Subsystem. Die Kosten f&#252;r FC sind zwar
verglichen mit Gigabit Ethernet relativ hoch - nicht jedoch im
Vergleich zu ATM (Asynchronous Transfer Mode).<br />
<br />
 <b>Voraussicht angesagt</b><br />
 NAS (Network Attached Storage) ist eine Komplement&#228;rtechnik
zu SAN, die bereits heute verf&#252;gbar ist und teilweise
&#228;hnliche Vorteile liefert. Sind SAN f&#252;r ganze Unternehmen
gedacht, eignen sich NAS-Speichersysteme als Mini-SAN f&#252;r
LAN-Segmente - wie etwa Arbeitsgruppen innerhalb des Unternehmens,
die ausserordentliche Speicherbed&#252;rfnisse haben. Ein
NAS-Ger&#228;t ist eigentlich nur ein spezieller Server, der
ausschliesslich mit den zu speichernden Dateien besch&#228;ftigt
ist. Wie jeder andere Knoten, beispielsweise ein Netzwerkdrucker,
ist er direkt ans LAN angeh&#228;ngt.<br />
<br />
 Software f&#252;r das Storage Resource Management (SRM), die
traditionell von den Speicherherstellern geliefert wird und
f&#252;r den Backup sowie die Fehlererkennung in Speichersystemen
sorgt, ist nicht auf die Bew&#228;ltigung von j&#252;ngeren
Umgebungen wie SAN und NAS vorbereitet. Jetzt, da die Anwender
langsam ihre Speicher rezentralisieren, erkl&#228;rt etwa
Dataquest-Analystin Carolyn DiCenzo, sei der Backup nicht mehr das
gr&#246;sste Problem. Heute w&#252;rden vor allem Werkzeuge fehlen,
die mit unterschiedlichen Medien wie B&#228;ndern, optischen Disks
oder RAID-basierten (Redundant Array of Independent Disks)
Massenspeichern umgehen k&#246;nnten und "proaktiv" seien - also
Probleme erkennen, bevor sie passieren. F&#252;r Mainframes
existiert SRM schon immer. Zu den Hauptakteuren dieser Arena
z&#228;hlen laut DiCenzo Boole &amp; Babbage mit Spaceview sowie
Sterling Software mit Vantage. F&#252;r sogenannte offene Systeme
gebe es aber erst wenige L&#246;sungen. Das meiste, das eines Tages
SAN- und NAS-f&#228;hig sein werde, komme von Jungunternehmen wie
der US-Firma Highground Systems, die sich SRM mit Leib und Seele
verschrieben habe. Bis jetzt bietet Highground lediglich ein
SRM-Produkt an, das f&#252;r Windows NT Warnsignale und
Schwellenwerte abgibt sowie den Speicherverbrauch &#252;berwacht.
1999 sollen f&#252;r NAS und SAN geeignete Produkte auf den Markt
kommen. DiCenzo glaubt, dass SRM-Funktionen eines Tages mit der
Netzwerk- und Systemkontrolle integriert werden.<br />
<br />
 Das Aufsp&#252;ren von Daten in traditionellen Archivmedien wie
B&#228;ndern und optischen Speichern ist seit je her ein
m&#252;hsamer Prozess. Ungl&#252;cklicherweise haben auch
technische Verbesserungen der Hardware wenig in dieser Hinsicht
bewirkt. Speichersysteme wie Virtual Storage Manager von Storage
Technology oder der Virtual Tape Server von IBM verwenden
Disk-Arrays, um Dateien zun&#228;chst zwischenzuspeichern und sie
dann als virtuelle B&#228;nder zu stapeln. Wenn ein virtuelles Band
gef&#252;llt ist, wird es auf ein reales Band &#252;berspielt, das
optimal ausgenutzt werden kann. Virtual Tape nutzt zwar die
Kapazit&#228;t des Bandes gut aus, macht aber die Daten nicht
zug&#228;nglicher.<br />
<br />
 B&#228;nder sind gegenw&#228;rtig noch g&#252;nstiger als
Plattenspeicher. Viele Unternehmen setzen mittlerweile dennoch auf
letztere - vor allem, weil die Preise f&#252;r magnetische Disks,
auf die besser zugegriffen werden kann, kontinuierlich
fallen.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

