<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span
class="txt-xl-black">Speichernetzwerke kommen in Mode</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Die Industrie
f&#252;r Netzwerkspeicher-Hardware und -Software sowie die
daf&#252;r notwendigen Verwaltungssysteme ist seit den
September-Anschl&#228;gen ganz sch&#246;n in Fahrt gekommen. Als
Antrieb zur Einf&#252;hrung von Storage-Area Networks (SAN) und
derjenigen von Netzwerk-verkn&#252;pftem Speicher sind die
Bed&#252;rfnisse nach ununterbrochener Fortf&#252;hrung der
Gesch&#228;ftsabl&#228;ufe zu sehen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 14.06.2002<br />
 <b>Rubrik:</b> Report<br />
 <b>Autor:</b> Betsy Yocom, Dan Neel,Wayne Rash, Kenneth
Percy<br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Die
Septemberanschl&#228;ge haben die eine oder andere &#196;nderung in
der Unternehmenslandschaft ausgel&#246;st. So steckt die
Fortf&#252;hrung des Gesch&#228;ftslaufs, die M&#246;glichkeit, das
Netzwerk nach einer Katastrophe mit m&#246;glichst geringem
Einfluss auf das Gesch&#228;ft sogleich wieder laufen zu lassen,
als Antrieb hinter der Einf&#252;hrung von Storage-Area Networks
(SAN) und der Lancierung Netzwerk-verkn&#252;pfter Speicher.<br />
<br />
 "Die Leute haben erkannt, dass SANs wesentlich sind f&#252;r die
Einf&#252;hrung von Katastrophentoleranz", sagt Ron Totah,
technischer Marketingmanager f&#252;r Brocade Communications
Systems. Vor dem September konnten sich Netzwerkmanager die
Gr&#246;ssenordnung der Katastrophe einfach nicht vorstellen, der
zahlreiche Firmen in New York gegen&#252;berstanden. Manager planen
jetzt nicht nur doppelte Netzwerke, sondern verdreifachten diese
sogar f&#252;r den Fall, dass die Originalressourcen zerst&#246;rt
w&#252;rden, sagt Totah.<br />
<br />
 Unternehmen, die mittels Speichernetzwerk Daten &#252;ber eine
optische Verbindung in Echtzeit spiegeln, erholen sich viel
schneller als jene, die noch immer Spulen mit Magnetb&#228;ndern
herumschicken und st&#252;ndliche Synchronisationsprozesse ablaufen
lassen m&#252;ssen. SANs, die gr&#246;ssere Distanzen
unterst&#252;tzen, bieten zudem den Vorteil, dass die Unternehmen
ihre Daten weiter weg von ihrem Hauptsitz aufbewahren k&#246;nnen.
Der Silkworm-Switch von Brocade, der im Labor des unabh&#228;ngigen
Testers Miercom untersucht wurde, unterst&#252;tzt beispielsweise
Distanzen von bis zu 120 Kilometern.<br />
<br />
 Aber diese erweiterten Speichernetzwerke werden eine Reihe von
Technologien unterst&#252;tzen m&#252;ssen wie Fibre Channel,
Internet SCSI (iSCSI) und 10 GBit/s-Ethernet. Gleichzeitig werden
sie SAN- und NAS-Technologien verwenden, die eine viel engere
Zusammenarbeit brauchen, als sie die Speicherindustrie heute zur
Verf&#252;gung stellt.<br />
<br />
 W&#228;hrend den M&#228;rkten f&#252;r SAN und NAS f&#252;r die
n&#228;chsten f&#252;nf Jahre ein wesentliches Wachstum
vorausgesagt wird, zeigen die Forschungen von Miercom, dass eine
ganze Reihe technischer, normenbasierter und von der Zusammenarbeit
abh&#228;ngender Stolpersteine diesem Wachstum und der
grossfl&#228;chigen Einf&#252;hrung dieser Speichertechniken den
Weg versperren.<br />
<br />
 <b>Standard-Dschungel</b><br />
 Fibre Channel, ein ANSI-basierter Standard, der eine schnelle
Verbindung &#252;ber kurze Distanzen erm&#246;glicht, wird im
Innern der Rechenzentren bleiben, sagt Doug Ingraham, Seniormanager
f&#252;r Produktstrategie und Management bei Cisco Systems. In
Lowend-Serverumgebungen, in denen Fibre Channel vor allem des
Geldes wegen nicht eingef&#252;hrt wurde, wird iSCSI siegreich
Einzug halten. iSCSI ist ein Standard, der gerade von der IETF
(Internet Engineering Task Force) eingef&#252;hrt wird. Er
definiert, wie SCSI-Befehle, die f&#252;r die lokale
Datenkommunikation zwischen dem Hostrechner und angeschlossenen
Peripherieger&#228;ten gebraucht werden, &#252;ber einen
IP-Anschluss reisen k&#246;nnen.<br />
<br />
 Dale Lafferty, Vizepr&#228;sident f&#252;r Marketing bei Inrange
Technologies sagt, Fibre Channel sei das Protokoll seiner Wahl
f&#252;r Speichernetzwerke, weil es bez&#252;glich Leistung und
Zuverl&#228;ssigkeit bereits gut eingef&#252;hrt sei. Inranges
Switch FC/9000 mit 64 und 256 Ports basiert auf Fibre Channel.
Immerhin wurden weltweit letztes Jahr 263441 Fibre Channel Switch
Ports der Director-Klasse, sie unterst&#252;tzen 64 Ports oder
mehr, installiert, wie die Marktforschungsfirma IDC sagt.<br />
<br />
 Fibre Channels Last ist im Markt ein Vorteil f&#252;r die Technik,
meint denn auch Marc Staimer, Pr&#228;sident von Dragon Slayer
Consulting. Fibre Channel hat Unmengen von
Interoperabilit&#228;tstests durch Industriegruppen erfolgreich
bestanden und wurde dank seiner geringen Latenz und schnellen
Leistung in Firmen als Br&#252;ckenkopf etabliert. Doch ist es
verglichen mit Ethernet weiterhin eine teure Technik, die nicht
unbedingt allt&#228;gliche technische Erfahrung bei der
Einf&#252;hrung und Wartung verlangt, wie Staimer
ausf&#252;hrt.<br />
<br />
 iSCSI dagegen ebnet den Weg f&#252;r die Verwaltung von
Speichernetzwerken &#252;ber weite Distanzen, indem SAN-Inseln zu
einem integrierten Ganzen vereint werden, und das auch noch zu
tiefen Preisen. Doch die M&#252;hen, f&#252;r iSCSI einen
Industriestandard zu erhalten, k&#246;nnten kurzfristig ein
wesentliches Hindernis f&#252;r dessen Einf&#252;hrung darstellen.
Die IETF muss den Entwurf f&#252;r den Standard noch unterzeichnen.
Laut Ingraham von Cisco ist man sich bereits &#252;ber wichtige
Punkte einig. Die Hersteller arbeiten daran, basierend auf diesen
Punkten die notwendigen Funktionen f&#252;r eine Zusammenarbeit
nachzuweisen.<br />
<br />
 Was die Zusammenarbeit von SANs und NAS betrifft, weist Staimer
darauf hin, dass Hersteller wie EMC, IBM und Network Appliance
bereits Produkte ausliefern, die gemeinsam arbeiten. Konvergenz ist
heute auf zwei Arten m&#246;glich: Zum einen wird ein NAS-Aufsatz
(oder spezieller Server) auf einem SAN vor den Speicherblock
gepflanzt. Dieser Server, meist ein Windows NT/2000-Server mit
einem Host-Bus-Adapter und einer
Glasfasernetzwerk-Schnittstellenkarte, erm&#246;glicht ein
Management auf dem File-Niveau f&#252;r den Blockspeicher des SAN.
Eine zweite Methode besteht aus einem NAS-System mit eingebauten
SAN-Anschl&#252;ssen, wobei dann der Extraserver
wegf&#228;llt.<br />
<br />
 Staimer erl&#228;utert, dass die Speicherfunktionen von SAN und
NAS &#252;ber Benutzerapplikationen angesprochen werden
m&#252;ssen. Blockspeicher wird dann eingesetzt, wenn schnelle
Leistung wichtig ist, w&#228;hrend NAS-basierter Filespeicher sich
am besten eignet, wenn bequeme Nutzung verlangt wird. W&#228;hrend
sich also die Blockspeicher unterst&#252;tzenden SAN wesentlich von
einem NAS unterscheiden, das Filespeicher unterst&#252;tzt, spielt
jedes Modell dennoch seine Rolle in Speichernetzwerken.<br />
<br />
 <b>2 GBit/s und mehr</b><br />
<br />
 Was die Geschwindigkeit angeht, die f&#252;r die wachsenden
Bed&#252;rfnisse an Unternehmensspeicher n&#246;tig ist, gilt der
Preis f&#252;r Fibre Channel mit seiner &#220;bertragungsrate von 2
GBit/s als angemessen, sofern er in Switches der Director-Klasse
eingebaut wird. Wenngleich 10 GBit Ethernet in k&#252;nftigen
Speichernetzen eine Rolle spielt, wird dies kaum vor 2003
passieren.<br />
<br />
 Jack McDonnell, CEO und Vorsitzender von McData, sagt, dass die
vollst&#228;ndige Bandbreite von Ethernet (10 GBit/s) noch nicht
einmal ann&#228;hernd realisiert worden ist. Denn IP-Stapel auf
Endger&#228;ten sind noch nicht soweit entwickelt, um
Geschwindigkeiten &#252;ber 1 GBit/s zu verarbeiten. McDonnell
glaubt deshalb voraussagen zu k&#246;nnen, dass innerhalb eines
Jahres experimentelle Versionen von 10 GBit Ethernet erscheinen
werden, die breite Einf&#252;hrung jedoch noch zwei Jahre oder mehr
auf sich warten lassen wird.<br />
<br />
 Hohe Geschwindigkeiten sind f&#252;r gr&#246;ssere Netzwerke von
Bedeutung. F&#252;r kleinere Netzwerke jedoch spielt das
&#220;bertragungstempo nicht die wichtigste Rolle. Laut Ingraham
verwenden viele Kunden derzeit Lowend-Server f&#252;r erfolgreiche
iSCSI-Anschl&#252;sse &#252;ber Fast Ethernet-Verbindungen. Server,
die keinen intensiven Speicherzugriff unterst&#252;tzen, haben
keinen Bedarf an h&#246;heren Geschwindigkeiten. Doch wenn Kunden
auf schnelle Server &#252;berwechseln, wie die Infiniband-basierten
Server der n&#228;chsten Generation, die I/O-Bus-Durchsatztempi von
&#252;ber 2,5 GBit/s erm&#246;glichen, wird Geschwindigkeit ein
Thema.<br />
<br />
 Die Erfindung und Entwicklung von ASICs allerdings, die einen
Datenverkehr mit 2 GBit/s weiterleiten, geh&#246;rt in den Bereich
der "Raketenwissenschaften" und ist sehr teuer, wie Totah von
Brocade sagt. Solche L&#246;sungen zu realisieren wird darum sehr
schwierig, weil eine sehr hohe Leitungsgeschwindigkeit ohne
Latenzen erforderlich sind und fortschrittliche Funktionen wie
Trunking und Frame Management.<br />
<br />
 Speicher ist im Verbund mit Ethernet-Technologien immer teuer
gewesen. Inzwischen sind die Preise der Fibre Channel-basierten
Produkte gesunken und werden noch weiter zur&#252;ckgehen. Laut
Staimer darf mit einem durchschnittlichen Preis von 750 Dollar pro
2 GBit/s Port bei Edge-Switches bis Ende Jahr gerechnet werden.
Anfangs 2001 betrug der Durchschnittspreis pro 1 GBit/s Port noch
1500 Dollar. Staimer sch&#228;tzt aber, dass die Port-Preise bei
den teuren Director-Class Switches, die 64 Ports und mehr
unterst&#252;tzen, bis Ende 2002 bei rund 1750 Dollar pro Port
liegen werden. Dies im Vergleich mit einem Durchschnittspreis von
3100 Dollar pro Port bei aktuellen Produkten. Lafferty von Inrange
sagt voraus, dass die Preise des Fibre Channel im Laufe der
n&#228;chsten Jahre um zehn Prozent pro Jahr zur&#252;ckgehen
d&#252;rften, weil die Technik dann zunehmend breiter
eingef&#252;hrt und genutzt werden wird.<br />
<br />
 Totah stellt fest, dass die Kunden vor den September-Ereignissen
eine Menge selbst&#228;ndige Speicher kauften, aber nur wenig
Verbindungstechnik, die den Aufbau einer SAN-Umgebung
erm&#246;glichen w&#252;rden. Seither hat sich der Trend in
Richtung mehr SANs und etwas weniger Speicher gewendet. Das Ziel
ist klar, mehr Verbindungsm&#246;glichkeiten sollen erhalten
werden, um den derzeitigen Speicherplatz kostenwirksamer zu
verwenden. Doch Totah weist auch darauf hin, dass der Return on
Investment bei SANs derzeit hoch ist. Tritt eine Katastrophe ein,
macht sich das Geld, das man f&#252;r SAN-Technologien ausgegeben
hat, gut bezahlt. Denn diese Ger&#228;te und Installationen helfen,
das Gesch&#228;ft in kurzer Zeit wieder online zu bringen.
<i>(Betsy Yocom ist Senior Editor bei Miercom, einem neutralen
Testlabor in New Jersey)</i><br />
<br />
 <b>Virtuelle Speicherverwaltung ohne Normen</b><br />
<br />
 Die Verwaltungssoftware f&#252;r Speichernetzwerke wird von drei
Firmen dominiert, wovon jede eine ureigenste L&#246;sung anbieten.
Gleichwohl enthalten die Programme auch ein gewisses Mass an
vorschriftenbasierter Automatisierung, mit der Speicherverwalter
endlich mehrere Aufgaben von einer einzigen Konsole aus erledigen
k&#246;nnen.<br />
<br />
 Das Speichermanagement bereitet den Anwenderfirmen Kopfzerbrechen.
Deshalb geben sich Hersteller alle M&#252;he, ihre Kunden mit neuen
Produkten zu beruhigen. Nachdem EMC ihre unternehmensweite
Speichermanagementstrategie Auto-IS angek&#252;ndigt hatte,
beeilten sich Hitachi Data Systems (HDS) und Fujitsu mit
Konkurrenzprodukten nachzudoppeln.<br />
<br />
 Fujitsu pr&#228;sentierte Mitte Mai ihre Eternus-Strategie, eine
Woche nachdem HDS mit True North angetanzt war. Wie Auto-IS stellen
auch True North und Eternus weitreichende Pl&#228;ne dar, die
Partnerschaften mit Speichersoftwareentwicklern und Hardwarefirmen
wie Switch-Herstellern vorsehen, um eine heterogene
Virtualisierung, die einheitliche Darstellung auf einem Bildschirm,
von Speicherressourcen anbieten zu k&#246;nnen.<br />
<br />
 Die Programme enthalten auch ein gewisses Mass an
vorschriftenbasierter Automatisierung, mit der Speicherverwalter
endlich mehrere Aufgaben von einer einzigen Konsole aus erledigen
k&#246;nnen wie SRM (Storage Resource Management) und
Speichernetzwerk-&#220;berwachung, sagt Tony Prigmore, Senior
Analyst bei der Enterprise Storage Group.<br />
<br />
 "Die Kunden haben im Speichermanagement das Ende des Weges
erreicht", sagt er. "Der einzige Grund, weshalb so viel Energie auf
das Speichermanagement konzentriert wird, liegt darin, dass Kunden
bisher &#252;ber keine sehr gut genormten Tools und
Automatisierungen verf&#252;gten. Sie hatten einige Funktionen,
aber kein Ger&#252;st."<br />
<br />
 True North, Eternus und Auto-IS versuchen, ein solches Ger&#252;st
anzubieten, indem sie die Komponenten feilhalten, die jedem der
drei Pl&#228;ne gemeinsam sind: Speichersoftware, Speicherhardware
und eine aggressive Zusammenarbeit mit Drittherstellern zur
Schaffung eines m&#246;glichst offenen Speicherger&#252;stes, wie
Firmenvertreter angeben.<br />
<br />
 Chris Worrall, Vizepr&#228;sident f&#252;r Produktmanagement bei
HDS, beschreibt die drei Komponenten der True North
Strategie:<br />
<br />
 - Die HiCommand Speichersoftware von HDS bildet das
Managementger&#252;st f&#252;r True North.<br />
 - Zur St&#228;rkung der Hardwarekomponente wird es einen neuen
Speicherserver der Lightning 9900a V-Serie geben.<br />
 - Gegr&#252;ndet wird zudem eine Reihe von Handelspartnerschaften
mit verschiedenen Herstellern von Speicherkomponenten auf
API-Ebene, um so eine m&#246;glichst grosse Menge heterogener
Funktionalit&#228;t f&#252;r das HDS-Speichernetzwerk
anzubieten.<br />
<br />
 "Unsere Strategie basiert auf der Zusammenarbeit mit allen
Partnern, seien es nun unabh&#228;ngige Software- und
Hardware-Hersteller oder Kunden, damit Benutzer ihre L&#246;sungen
als Teil unseres offenen Ger&#252;stes integrieren k&#246;nnen",
sagt Worrall.<br />
<br />
 "&#220;ber die eigenen Verkaufskan&#228;le sowie durch
Hewlett-Packard und Sun verf&#252;gt Hitachi &#252;ber eine grosse
installierte Basis und steht damit unter dem Druck, eine Menge
Speicherkunden mit Managementproblemen zufriedenstellen zu
m&#252;ssen", sagt Prigmore. "Sobald EMC mit Auto-IS aufwartete,
w&#228;re es f&#252;r Hitachi unm&#246;glich gewesen, ohne
vergleichbare Speichermanagementstrategie weiterzuexistieren. Sie
mussten in aller Eile True North entwickeln, die Kunden haben es
verlangt." &#196;hnlich wie True North und Auto-IS verbindet auch
Eternus, die Speichermanagement-Initiative von Fujitsu: Software,
Hardware und Produkte von Drittherstellern f&#252;r die L&#246;sung
von Problemen im Speichernetzwerkmanagement.<br />
<br />
 Entgegen HDS jedoch steht Fujitsu nicht vor der Herausforderung,
eine grosse installierte Hardwarebasis zu unterst&#252;tzen und
gleichzeitig Angriffe von Konkurrenten wie EMC abwehren zu
m&#252;ssen. Vielmehr kann Fujitsu von einer von Experten als
Mordsgesch&#228;ft bezeichneten Gelegenheit profitieren: Die
Entwicklung einer Hardware-unabh&#228;ngigen
Speichermanagementsoftware.<br />
<br />
 Eternus ist mit einer Software-Suite von Fujitsus
unabh&#228;ngiger Softwaretochter Fujitsu Softek bewaffnet. Noch
immer mit dem Versuch besch&#228;ftigt, in der Industrie Fuss zu
fassen, ist die Speichersoftware von Softek eine von nur zwei
Speichermanagementsuiten, die Virtualisierung, Datenmanagement, SRM
und Speichernetzwerk-&#220;berwachung zusammengefasst in einer
einzigen, intuitiven Verwaltungsoberfl&#228;che anbieten.<br />
<br />
 "Fujitsu hat eine Riesengelegenheit f&#252;r
Hardware-unabh&#228;ngige Hersteller erkannt, eine umfassende
Speichermanagementl&#246;sung zu erschaffen", sagt Prigmore. Mit
Partnern wie Brocade, Microsoft und Oracle wird das
Speicherger&#252;st Eternus die Anzahl von Drittsystemen, die es
bisher schon verwalten kann, noch weiter ausbauen, wie Wayne Giroux
darlegte, Direktor f&#252;r Speichermarketing bei Fujitsu.<br />
<br />
 Neben AutoIS, True North und Eternus stehen inzwischen auch
Initiativen von IBM ins Haus. Ausserdem k&#252;ndigte bereits
Veritas ihr eigenes Speichervirtualisierungsprogramm Powered an.
<i>(Dan Neel, Mitarbeiter der US-Zeitschrift Infoworld)</i><br />
<br />
 <b>Virtualisierung lebt von der Wirklichkeit</b><br />
 Sowohl Hitachis und wie Fujitsus Virtualisierungsrezepte versuchen
ganz konkret, das Speichermanagement zu vereinfachen und die
Investitionen in Speichertechnik zu optimieren:<br />
<br />
 -Zusammenarbeit auf dem Switch/Router-Niveau f&#246;rdern<br />
 -Top-to-Bottom-Netzwerkkonfigurationen anbieten<br />
 -Automatisierung f&#252;r Speichermanagementroutinen Quelle:
Fujitsu, HDS<br />
<br />
 <b>Herstellerunabh&#228;ngige Virtualisierung</b><br />
<br />
 Speichermanagement-Software d&#252;mpelt gem&#252;tlichim
Kielwasser der technischen Entwicklungen hinterher. Es d&#252;rfte
noch einige Zeit dauern, bevor die Speicherindustrie richtige
Standards oder wenigstens de facto Standards erleben wird. In jedem
Fall liegt noch ein langer Weg vor ihr. Ein leitender Angestellter
eines gr&#246;sseren Herstellers von SAN-Switches gab dennn auch
zu, dass die Managementsoftware dieser Industrie hinter den
aktuellen Zeiten herhinke und sich in einem Stadium befindet, in
dem die Ethernet-Switchsoftware vorzehn Jahren war: antiquiertes
Design, eingeschr&#228;nkte Funktionen und starre
Herstellerfixierung.<br />
<br />
 Auch bei Speichernetzwerken spart eine einfache Verwaltung Geld
und schafft Effizienz. Die Virtualisierung von Speichernetzen soll
das Management vereinfachen, indem es die physischen Bestandteile
des Netzwerks in logischer Form wiedergibt. Man kann beispielsweise
Plattenplatz auf mehreren verschiedenen physischen Platten in einem
SAN verteilen, ihn jedoch den Anwendern und ihren Computern wie
einen einzigen Plattenspeicher anzeigen. Bei &#228;ndernden
Speicheranforderungen ist es f&#252;r den Netzwerkmanager einfach,
wenn er sieht, wie seine Speichervolumen wachsen und schrumpfen, um
der Nachfrage zu entsprechen, ohne dass er die tats&#228;chlichen
Aufbewahrungsorte der Speicher aufsuchen muss, um neue
hinzuzuf&#252;gen oder Speicher zu entfernen.<br />
<br />
 Speichervirtualisierungssoftware erm&#246;glicht es dem
Speichernetzwerkmanager, nach Bedarf physischen Speicher
anzuf&#252;gen, ohne dass sich die Ansicht des Speichers
ver&#228;ndert. Er erh&#228;lt dieselbe logische Ansicht, auch wenn
sich die Platzmenge &#228;ndert. Es bedeutet auch, aus dem
bestehenden Speicher mehr herauszuholen. Das Problem dabei ist,
dass Virtualisierungsger&#252;ste strikt propriet&#228;r sind und
es kein Abkommen unter den Speicherherstellern gibt &#252;ber
Standards f&#252;r die Virtualisierung &#252;ber Herstellergrenzen
hinweg. Man braucht also die Infrastruktur des einen Herstellers ,
um seine neue Managementsoftware einsetzen zu k&#246;nnen. Als
Ergebnis davon, sagt Frank Berry, Vizepr&#228;sident f&#252;r
Unternehmensmarketing des Speicherkomponentenherstellers QLogic,
"wird seine Technik als propriet&#228;re Inseln der Virtualisierung
im Markt auftauchen." Nirgends zeigt sich dies so deutlich wie in
den neusten Ank&#252;ndigungen von Hitachi und Fujitsu. Hier sind
zwei bedeutende Spieler in der Speicherindustrie und jeder reagiert
auf seine Weise auf die Ank&#252;ndigung der neuen
Speichermanagementsoftware von EMC. Es gibt offenbar keinerlei
Anstrengungen, Standards auch nur in Erw&#228;gung zu ziehen, keine
Anstrengung, um konsistente Dienste anzubieten und keine
&#220;berlegungen zugunsten einer weitreichenden
Kompatibilit&#228;t. Je nach dem, wie erfolgreich Hitachi, Fujitsu
und EMC neue Partner bezirzen k&#246;nnen, werden ihre Kunden mehr
Hardware- und Software-Optionen und weniger Speichermanage-
mentproble-me haben. Aber die propriet&#228;ren Inseln der
Virtualisierung werden bleiben.<br />
<br />
 Es d&#252;rfte noch einige Zeit dauern, bevor die
Speicherindustrie richtige Standards oder wenigstens de facto
Standards erleben wird. Ein leitender Angestellter eines
gr&#246;sseren Herstellers von SAN-Switches gab zu, dass die
Managementsoftware hinter den Zeiten herhinke: "Sie befindet sich
in einem Stadium, in dem die Ethernet-Switchsoftware vor zehn
Jahren war." Speichermanagement-Software d&#252;mpelt
gem&#252;tlich im Kielwasser der technischen Entwicklung hinterher.
F&#252;r eine Software, die im besten Fall ein antiquiertes Design
aufweist, eingeschr&#228;nkte Funktionen und eine starke
Herstellerbezogenheit, wird sichniemand ernsthaft um Standards
bem&#252;hen. Das Ergebnis davon: Vorl&#228;ufig ist die Software
weit davon entfernt, f&#252;r den Teil einer
Speichernetzwerkmanagementl&#246;sung n&#252;tzlich zu sein.
<i>(Wayne Rash, Mitarbeiter im Testzentrum von Infoworld)</i><br />
<br />
 <b>iSCSI-Adapter in Speichernetzwerken</b><br />
 Die TCP-basierte Architektur von iSCSI schafft einen enormen
Verarbeitungs-Overhead im Hostsystem. Um diese Last abzubauen,
enthalten die meisten iSCSI-Adapter einen separaten TCP/IP-Stack in
der Hardware, der parallel und unsichtbar zum Stapel l&#228;uft,
der das Host-Betriebssystem unterst&#252;tzt, eine durchaus
problematische L&#246;sung.<br />
<br />
 iSCSI-Adapter sind eine Kreuzung von PCI-basierten
Netzwerkschnittstellenkarten und SCSI-Controllern. Sie werden in
Unix- oder Windows NT/2000-Servern installiert, damit sie zu
Ausl&#246;ser-Clients in einem iSCSI-Netzwerk werden.
Schwierigkeiten finden sich vor allem auf der Adapterseite im SAN.
Das Herunterladen von TCP/IP, zu wenig Treiberstandards und das
Fehlen einer expliziten Microsoft-Unterst&#252;tzung f&#252;r das
Protokoll wurde von den verschiedenen Herstellern unterschiedlich
gel&#246;st. Die TCP-basierte Architektur von iSCSI schafft einen
enormen Verarbeitungs-Overhead im Hostsystem. Um diese Last
abzubauen, enthalten die meisten iSCSI-Adapter einen separaten
TCP/IP-Stack in der Hardware, der parallel und unsichtbar zum
Stapel l&#228;uft, der das Host-Betriebssystem unterst&#252;tzt.
Diese zweifachen Stapel sind eine problematische L&#246;sung. Kein
gemeinsames Routing und kein Lastenausgleich, fehlende
Ausfallsicherung, eingeschr&#228;nkte Sichtbarkeit des
iSCSI-Adapters vom Betriebssystem aus sind einige der
Hemmnisse.<br />
<br />
 <b>Auftritt von Fibre Channel</b><br />
 Die bemerkenswerteste technische Innovation in diesem Bereich war
die F&#228;higkeit von iSCSI-Gateways, nahtlos iSCSI- und Fibre
Channel-Speichernetzwerkelemente gegenseitig anzuzeigen. Dies
beweist, dass iSCSI nicht nur als
End-zu-End-Speichernetzwerkprotokoll eingesetzt werden kann,
sondern auch als Migrationspfad f&#252;r bestehende Fibre
Channel-Ger&#228;te.<br />
<br />
 Cisco und Nishan Systems, zwei prominente iSCSI-Unterst&#252;tzer,
haben iSCSI-Gateways entwickelt. Das Cisco-Modell enth&#228;lt eine
Schnittstelle f&#252;r Gigabit Ethernet, eine zweite f&#252;r Fibre
Channel. Das Modell von Nishan zeigt Servern mit iSCSI-Adaptern
Fibre Channel-Zielspeicherger&#228;te an. Nishan jedoch behauptet,
auch das umgekehrte Szenario vollst&#228;ndig zu unterst&#252;tzen.
So bietet sie Fibre Channel-Hostserver an, die mit iSCSI-basierten
Speicherreihen arbeiten. In dem ganzen Gerede &#252;ber iSCSI als
Alternative zu Fibre Channel gehen einige fundamentalen
Unterschiede unter. iSCSI hat nur dann eine Berechtigung in einem
optimalen Unternehmenslaufmodell, wenn es mit Fibre
Channel-Netzwerken zusammenleben kann. "iSCSI wurde nicht f&#252;r
Replikation und Wiederherstellung entwickelt. Es wurde f&#252;r
Datenbankapplikationen, E-mail und andere
Online-Transaktionsprozesse geschrieben", sagt Mike Frase,
Ingenieur f&#252;r technischen Support bei Cisco. "F&#252;r die
rasche Bef&#246;rderung von riesigen Datenmengen ist Fibre Channel
&#252;ber eine IP-Verbindung weiterhin die Methode erster
Wahl."<br />
<br />
 F&#252;r iSCSI sprechen die Zahlen, wie Frase sagt. "Suchen Sie
mal ein Fibre Channel-Netzwerk, das wenigstens mit 50 Prozent
seiner Kapazit&#228;t l&#228;uft. iSCSI erm&#246;glicht es, neben
dem Speichern mit der vorhandenen Infrastruktur auch andere Dinge
zu tun, was einen besseren Return on Investment f&#252;r diese
Investitionen ergibt", sagt er. <i>(Kenneth Percy,
Technologie-Analyst beim neutralen Testlabor Miercom)</i><br />
<br />
 <b>Der Speicher in Variationen</b><br />
<br />
 Welche Speicherl&#246;sung in welcher Anlage die Zeitgem&#228;sse
und Richtige ist, muss von Fall zu Fall entschieden werden.
Kontinuit&#228;t liefern vor allemdie technischen Entwicklungen,
die nach wie vor weiter laufen. Hier ein Einblick.<br />
<br />
 Knapp 150 GB passen auf das 3,5-Zoll-Laufwerk von Hitachi, das
f&#252;r den Einbau in Server-Systeme gedacht ist. Das Laufwerk
"DK32EJ" verf&#252;gt &#252;ber eine Speicherdichte von 30 GB je
Quadratinch und dreht sich 10000 mal in der Minute.<br />
<br />
 Die Transferrate soll 500 Mbit/s betragen. Damit die Daten schnell
zum Prozessor kommen, will Hitachi als Interfaces Ultra-320-SCSI
und Fibre Channel anbieten. Die Festplatte soll nur an
Server-Hersteller ausgeliefert werden.<br />
<br />
 Quad-Data-Rate nennt sich eine Technik f&#252;r Static Random
Access Memories (SRAMs). Dabei erfolgt das Einschreiben und Lesen
von Daten getrennt, so dass Datenkollisionen ausgeschlossen
sind.<br />
<br />
 Au&#223;er Samsung unterst&#252;tzen unter anderem Micron
Technologies, Cypress Semiconductor, NEC und IDT diese Technik.
Samsung hat 16-Mbit-QDR-SRAMs entwickelt, die mit 200 Megahertz
getaktet sind. Die Speicherbausteine sind mit zwei getrennten Ports
versehen, die unabh&#228;ngig voneinander im Double-Data-Rate-Modus
betrieben werden und so die vierfache Geschwindigkeit von
herk&#246;mmlichen SRAMs erreichen. Die Bausteine sollen
Netzapplikationen beschleunigen.<br />
 <b>Systemspeicher</b><br />
 Von Fujitsu kommen die "GR-740"-Speichersysteme. Die Arrays lassen
sich auf eine Kapazit&#228;t von 16 TB ausbauen und verf&#252;gen
&#252;ber bis zu 16 Schnittstellen zu Host-Rechnern unter Solaris,
Windows 2000 und NT Server, Linux, HP-UX, AIX und zOS (OS/390). Die
Systeme sind als Direct-attached Storage (DASD) oder f&#252;r die
Benutzung in einem Speichernetz (SAN) zu bestellen.<br />
<br />
 <b>Know-how geb&#252;ndelt</b><br />
 Hewlett Packard (HP) kommt mit einem Paket aus Servern, Speichern
und Software, das zur Virtualisierung, dem Spiegeln der Daten sowie
f&#252;r Backup taugt. Die Speicherhardware mit dem Codenamen "Sava
1" besteht aus zwei "Net-Servern" (mit je zwei CPUs), auf denen die
Virtualisierungssoftware l&#228;uft, die durch die &#220;bernahme
von Stor-Apps ins Unternehmen kam. An einer Seite ist Sava
&#252;ber Fibre Channel mit zwei "Sure-Store"-Arrays (7100 und
7400) verbunden. Ein zweiter Ausgang klinkt die Hardware in ein SAN
ein oder verbindet sie mit Subsystemen von Dell, Hitachi, LSI Logic
oder EMC. <i>(IDG)</i><br />
<br />
 <b>Plug-and-Play darf nicht propriet&#228;r sein</b><br />
 Datenzentrierung Damit Anwender ihre Speichernetze mit Hard- und
Softwarekomponenten diverser Anbieter aufbauen k&#246;nnen, darf
dieser Ansatz nicht propriet&#228;r sein, sondern muss alle
g&#228;ngigen Management-Plattformen, Betriebssysteme sowie
bestehende und k&#252;nftige Standards unterst&#252;tzen.<br />
<br />
 Einen Schwerpunkt bildet die datenzentrische Verwaltung aller
Komponenten vom Host bis zur Applikation. Dazu kommen individuelle
Ansichten des gesamten SANs f&#252;r Echtzeit-Diagnosen. Alle
relevanten Informationen m&#252;ssen sich &#252;ber eine zentrale
Konsole einholen lassen. Und das gelingt in der Regel nur, wenn
Softwarehersteller und die Anbieter der Hardwarekomponenten
m&#246;glichst eng zusammenarbeiten. <i>(Gerald Sternagl,
Product-Marketing-Manager bei Veritas Software)</i><br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

