<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span class="txt-xl-black">Langfristig
gehen Daten verloren</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Das Aufbewahren von
Daten stellt Probleme. Die Datenmengen werden immer gr&#246;sser,
die Techniken der Speicherung veralten rasch und die Speichermedien
auch, wenn sie nicht sogar zu Staub zerfallen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 19.11.1999<br />
 <b>Rubrik:</b> Report<br />
 <b>Autor:</b> Mitch Betts, <a href="../../impressum"
class="txt-link-red">Corinne Schmidt</a><br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Alexander Graham Bell,
so heisst es, sagte in seinem ersten Telefongespr&#228;ch: "Mr.
Watson, kommen Sie her; ich brauche Sie." Es ist nicht
&#252;berliefert, was Ray Tomlinson in seinem ersten
Netzwerk-E-mail 1972 schrieb. Er erinnert sich nicht mehr genau und
er hat es auch nicht gespeichert.<br />
<br />
 "Der Grund, weshalb dieses E-mail f&#252;r die Geschichte
verlorenging, ist, weil es damals nicht wert schien, es zu
speichern", sagt Tomlinson, Chefingenieur bei der GTE-Tochter BBN
Technologies. Im Nachhinein w&#228;re es aber recht nett, wenn man
dieses St&#252;ck Geschichte aufbewahrt h&#228;tte, sagt er, doch
man kann halt nicht alles speichern - und auch nicht wieder
abrufen. "Selbst wenn Backup-B&#228;nder existierten, w&#228;ren
sie wohl nicht mehr lesbar. Sie waren nur Magnetb&#228;nder und
nach sieben oder acht Jahren f&#228;llt die Oxidbeschichtung ab,
speziell von den B&#228;ndern aus dieser Zeit", sagt er.<br />
<br />
 Und hier ist der Haken: Digitale Information - von der historisch
wertvollen bis zur wirtschaftlich relevanten - l&#228;uft Gefahr zu
verschwinden oder unzugreifbar zu werden, weil die Speichermedien
wie beispielsweise Magnetb&#228;nder erodieren. Weitere Schuldige
sind die ewig &#228;ndernden Datenformate und die Tatsache, dass
Software und Hardware so rasch veralten. Bedeutende Teile des
US-Census von 1960 beispielsweise k&#246;nnten nur noch mit einem
Univac Typ II-A-Bandlaufwerk gelesen werden. Dieses ist jedoch 16
Jahre nach der Z&#228;hlung bereits ein Museumsst&#252;ck, wie ein
Bericht des Council on Library and Information Resources (CLIR) in
Washington schreibt. Es brauchte wesentliche Rettungsaktionen, um
die rohen Daten auf Industriestandard-B&#228;nder zu
&#252;berschreiben.<br />
<br />
 Es gibt einen Grund f&#252;r den Ausdruck "maschinenlesbare
Daten". Daten von Landsat-Satelliten von vor 1979 sind nicht
lesbar, weil sie auf antiken Xerox-Computern gespeichert wurden,
die nicht mehr laufen, schreibt die Zeitschrift Science. Und nur
schon einen PC zu finden, der ein Wordperfect-4.0-File auf einer
5,25-Diskette lesen kann und weder Fussnoten noch Formatierung
verliert, grenzt an ein Wunder.<br />
<br />
 Historiker, Bibliothekare und Archivare - die eine nat&#252;rliche
Affinit&#228;t zu wirklich altem Zeug haben - schlagen Alarm wegen
des Verlustes an kulturellen wie auch wissenschaftlichen oder
politischen Aufzeichnungen. Doch die digitale Aufbewahrung wird
auch in Industrien zum Sorgenkind, die feststellen, dass sie ihre
Daten immer l&#228;nger und l&#228;nger aufbewahren m&#252;ssen
wegen Vorschriften oder aus gesch&#228;ftlichen Gr&#252;nden.<br />
<br />
 Pharmafirmen sind ein gutes Beispiel daf&#252;r. Sie m&#252;ssen
ihre Aufzeichnungen &#252;ber neue Medikamente so lange
aufbehalten, bis das Medikament auf dem Markt ist. Aufzeichnungen
&#252;ber medizinische Unternehmungen m&#252;ssen w&#228;hrend der
ganzen Lebensdauer des Patienten aufbewahrt werden, wie Jeff
Rothenberg sagt, Computerwissenschaftler bei der Rand Corporation,
einem kalifornischen Denksilo.<br />
<br />
 Und nun geben Firmen Millionen von Dollar aus, um Daten-Warehouses
aufzubauen, die die lebensl&#228;nglichen Aufzeichnungen &#252;ber
Kundenaktivit&#228;ten enthalten sollen. "Wir sorgen uns schon
dar&#252;ber, wie gross in zehn oder zwanzig Jahren die
Wahrscheinlichkeit sein wird, dass diese Daten wieder abgerufen
werden k&#246;nnen", sagt Joe Bruscato, Chefarchitekt f&#252;r
Data-Warehousing beim Versicherungsunternehmen Blue Cross and Blue
Shield.<br />
<br />
 "Die Firmen unternehmen einfach nicht genug, um sicherzugehen,
dass vor Jahren abgelegte Daten weiterhin abgerufen werden
k&#246;nnen. Dies ist ein ernstzunehmendes Problem", sagt Bruscato.
"Genau wie Unternehmen gelernt haben, f&#252;r den Katastrophenfall
Pl&#228;ne bereitzuhalten, sollten sie auch Pl&#228;ne f&#252;r die
Datenkonservierung entwickeln."<br />
<br />
 Laut Analysten reicht die Qualit&#228;t der unternehmensweiten
Datenarchive vom idealen Aufbau mit optischen Jukeboxen und
B&#228;ndern in klimakontrollierten Gew&#246;lben bis zum
zuf&#228;lligen, undokumentierten Aufbewahren von Spulen im
feuchten Keller. Und einige Firmen archivieren &#252;berhaupt nicht
im Glauben, dass die Angestellten ohnehin alles ausdrucken, was
wirklich wichtig ist.<br />
<br />
 Doch kurzfristiges Denken und schlampiges Archivieren kann
f&#252;r die Firma zu Datenkatastrophen f&#252;hren, wenn sie
wertvolle Informationen verliert, weil sich das Magnetband
aufgel&#246;st hat oder weil sie nicht mehr &#252;ber die Programme
oder Ger&#228;te verf&#252;gt, um die Daten abzurufen.<br />
<br />
 Von der korrekten Behandlung der Speichermedien abgesehen
m&#252;ssen Firmen ein Team unterhalten, das sich um das
Datenmanagement k&#252;mmert, das ein zentrales Lager an Metadaten
unterh&#228;lt - eine Art Katalog der Unternehmensdaten und Formate
- und die Konversion zu neuen Speichermedien regelm&#228;ssig
durchf&#252;hrt, sagt Wendy Anne Ailor, Datenmanagerin bei einer
grossen Pharmafirma. Der Witz dabei sei, die Konversionen vor dem
Zerfall des Speichermediums durchzuf&#252;hren.<br />
<br />
 Manager sollten auch die Software- und Hardware-Versionen
aufzeichnen, die es zum Lesen und Bearbeiten der Daten braucht und
auf Serien achten die nicht weiter gef&#252;hrt werden.<br />
<br />
 Ailor sagt, ihre Firma habe auf einer Jukebox von Sony rund 1,5
Millionen Bilderfiles gespeichert. Doch Sony k&#252;ndigte vor zwei
Jahren an, dass sie den Support f&#252;r die zw&#246;lf Zoll
fassenden optischen Platten nach 2000 nicht mehr weiterf&#252;hren
werde. Also kopiert das Unternehmen nun die Bilder auf
5,25-Zoll-Platten von Hewlett-Packard.<br />
<br />
 Unternehmen m&#252;ssen auch ein "Applikationsarchiv" unterhalten,
mahnt Kris Newton, Analyst bei der Marktforschungsfirma Strategic
Research. Denn Benutzer, die alte Mainframesysteme auf Unix- oder
Windows NT konvertieren - beispielsweise, damit sie
Jahr-2000-gem&#228;ss werden - m&#252;ssen eine Kopie der alten
Applikationen behalten, damit sie die Altdaten lesen k&#246;nnen.
Und sie brauchen vielleicht einen Hardware-Emulator, weil sie den
alten Mainframe wohl kaum nur aus diesem Grund behalten
werden.<br />
<br />
 Die klassische L&#246;sung des Problems des Medienzerfalls ist,
die Daten auf neuere Speichermedien zu kopieren. Doch Migration ist
nicht die perfekte L&#246;sung.<br />
<br />
 "Wenn man Material von System zu System schiebt, ergeben sich
Gelegenheiten f&#252;r alle m&#246;glichen Arten von Fehlern -
zuf&#228;llige oder absichtliche", sagt Anne Gilliland-Swetland,
Assistenzprofessorin f&#252;r Informationsstudien an der
Universit&#228;t Kalifornien in Los Angeles. Sie ist auch
Co-Direktorin eines neuen Forschungsprojektes, das versucht,
Modellvorschriften zu formulieren, Standards und Strategien, damit
authentische elektronische Dateien w&#228;hrend langer Zeit
gespeichert werden k&#246;nnen.<br />
<br />
 <b>Ein Blick nach vorn</b><br />
 Das Wichtigste beim Entwurf eines Archivsystems ist, den Blick auf
die Zukunft zu richten und langfristig zu planen, sagt Kermit
Patton, Forscher bei SRI Consulting. "Die meisten Firmen neigen zu
kurzfristigen Perspektiven, deshalb denken sie nur daran, die Daten
auf die n&#228;chste Generation von Speichermedien zu
transplantieren", sagt Patton. "Wenn man das System und die
Datenstandards entwirft und dabei an mehrere Generationen denkt,
ist man in viel besserer Form."<br />
<br />
 Wir werden es nie wirklich wissen, wie lange die heutigen
Speichermedien Daten zuverl&#228;ssig behalten k&#246;nnen, bevor
nicht ein oder zwei Jahrzehnte verstrichen sind. Und wir werden
nicht sehen, ob die Daten verdorben sind oder l&#252;ckenhaft, bis
wir versuchen, sie zu lesen.<br />
<br />
 Dies passierte, als Techniker die Magnetb&#228;nder mit Daten aus
der Viking-Mission zum Mars von 1976 pr&#252;ften. Sie stellten
fest, dass zehn bis zwanzig Prozent der B&#228;nder wesentliche
Fehler enthielten, schreibt der CLIR-Bericht. Die Techniker nannten
Magnetb&#228;nder als "katastrophales" Archivmedium.<br />
<br />
 "Man sieht, wenn B&#252;cher zerfallen, aber es gibt keine
M&#246;glichkeit, ein Magnetband zu betrachten und Fehler darauf zu
fin-<br />
<br />
 den - man muss die B&#228;nder erst laufen lassen. Das ist sehr
arbeitsintensiv", sagt Abby Smith, Konservationsexpertin beim CLIR.
"Deshalb werden wir nicht wissen, wie gross das Problem ist, bis zu
dem Zeitpunkt, wenn wir die Information brauchen." <i>(Mitch Betts,
Mitarbeiter der US-Zeitschrift Computerworld)</i><br />
<br />
 <b>Hege und Pflege von Magnetspeichermedien</b><br />
<br />
 Magnetspeichermedien sind zwar l&#228;ngst nicht so langlebig wie
sorgsam geh&#252;tete Papierdaten. Doch sie gestatten das Speichern
zahlreicher Ereignisse und Werke, die auf Papier nicht festzuhalten
sind. Sie stellen auch spezielle Anforderungen an Pflege und
Aufbewahrung.<br />
<br />
 Audio- und Video-Sammlungen m&#252;ssen in klimakontrollierten
R&#228;umen aufbewahrt werden, wenn sie l&#228;nger als ein paar
Jahrzehnte halten sollen. Information, die unbeschr&#228;nkt lange
aufbewahrt werden muss, muss regelm&#228;ssig von alten auf neue
Medien &#252;berspielt werden. Nicht nur wegen der
beschr&#228;nkten Stabilit&#228;t der Medien, sondern auch, weil
die Aufzeichnungstechniken sich &#228;ndern und alte Methoden nicht
weitergef&#252;hrt werden. Bereits heute plagen uns die
unterschiedlichsten Formate wie U-matic, VHS, S-VHS, acht
Millimeterfilm und Betacam wie auch B&#228;nderarten wie Eisenoxid,
Chromdioxid, aufgedampfte und pulverbeschichtete B&#228;nder.<br />
<br />
 Ein Magnetband besteht aus einer d&#252;nnen Schicht, die ein
magnetisches Signal aufnimmt und von einem dickeren Film unterlegt
ist. Die Magnetschicht gleicht einer Schicht Gel&#233;e mit
Fruchtst&#252;cken darin. Die Fr&#252;chte (das Pigment) werden vom
Bindemittel (Gelee) zusammengehalten. Das Bindemittel hat auch die
Aufgabe, eine glatte Oberfl&#228;che f&#252;r den reibungslosen
Transport des Bandes durch das Laufwerk zu gew&#228;hrleisten. Alle
drei Komponenten - die magnetischen Partikel, das Bindemittel und
der St&#252;tzfilm - sind m&#246;gliche Ausfallsquellen. Nach
Studien der Magnetic-Media Industries Association of Japan
h&#228;ngt die Lebenszeit eines Magnetbandes unter normalen
Bedingungen vom Bindemittel ab und nicht von den
Magnetpartikeln.<br />
<br />
 <b>Der Umgang mit digitaler Information</b><br />
<br />
 Die Vision digitaler Bibliotheken, die unser Erbe auf immer und
ewig wahren, baut derzeit auf technologischem Treibsand. Bisher
gibt es keine lebensf&#228;hige langfristige Strategie um
sicherzugehen, dass digitale Informationen auch in Zukunft lesbar
sein werden. Nicht nur leiden digitale Dokumente wegen des Zerfalls
und Veralterung der Speichermedien an Verlusten, sie werden auch
unlesbar, wenn Software oder Hardware verlorengehen oder
veralten.<br />
<br />
 als L&#246;sungen gelten das Ausdrucken auf Papier, der Glaube an
Standards, das Verwenden von Software und Hardware aus Museen oder
die "&#220;bersetzung" der Daten, damit sie von zuk&#252;nftigen
Softwaregenerationen gelesen werden k&#246;nnen. F&#252;r Jeff
Rothenberg, Forschungswissenschaftler bei der Rand Corporation,
sind dies alles kurzsichtige, m&#252;hselige und letztendlich
unn&#252;tze Bem&#252;hungen. Die Emulation dagegen verspricht eine
kosteng&#252;nstige Wahrung von Originaldokumenten indem ihre
urspr&#252;ngliche Software von zuk&#252;nftigen Computern emuliert
wird.<br />
<br />
 <b>Das Problem der Langlebigkeit</b><br />
 Es ist heute allgemein bekannt, dass die physische Lebenszeit
digitaler Speichermedien oft &#252;berraschend kurz ist. Die
technologische Veralterung dieser Medien und ihrer
Wiedergabeger&#228;te stellt ein ernsthaftes Problem dar.
Dar&#252;ber hinaus bestehen die meisten digitalen Dokumente und
Artefakte nur codiert und k&#246;nnen nur von bestimmter Software
oder Hardware wiedergegeben werden. Dies ist ein paradoxes Problem
angesichts der Tatsache, dass sich digitale Dokumente perfekt
kopieren lassen, was irrt&#252;mlicherweise oft f&#252;r ihr ewiges
Bestehen garantieren soll. Derzeit besteht keine langfristig
lebensf&#228;hige technische L&#246;sung f&#252;r dieses
Problem.<br />
<br />
 Neben den technischen Aspekten gibt es auch administrative,
organisatorische und firmenpolitische Themen, die die Verwaltung
digitalen Materials umkreisen. Digitale Dokumente unterscheiden
sich von Papierdokumenten in ihrer Erzeugung, &#220;bermittlung,
Speicherung, Wartung, dem Zugriff auf sie und ihre Verwaltung. Als
wesentlich gilt die stark verk&#252;rzte Lebenszeit digitaler
Information, wenn ihre Wiedergabe nicht gew&#228;hrleistet
ist.<br />
<br />
 Die Aufbewahrung digitaler Dokumente stellt eine Reihe von
Anforderungen. All diese Dokumente enthalten eine einmalige
Sammlung von Kernattributen, die bewahrt werden m&#252;ssen. Dazu
z&#228;hlt die F&#228;higkeit, perfekt kopiert zu werden, ohne
geographische Hindernisse darauf zugreifen zu k&#246;nnen,
praktisch kostenlos verteilt werden zu k&#246;nnen und
maschinenlesbar zu sein, damit auf sie zugegriffen, sie durchsucht
und verarbeitet werden kann von automatischen Mechanismen, die sie
modifizieren, neu formatieren. Ihr Inhalt sollte in s&#228;mtlichen
Phasen geknetet und maltr&#228;tiert werden k&#246;nnen. Auch
m&#252;ssen neuere, "digital geborene" Dokumentformate wie
Hypertext und Hypermedien ihre einmalige Funktionalit&#228;t
behalten einschliesslich ihrer F&#228;higkeit, Informationen aus
verschiedenen Quellen wie B&#252;chern, Post, Telefonnachrichten,
Bildern und Video zu beziehen. <i>(cs)</i><br />
<br />
 <b>Das Vermeiden einer Krise</b><br />
 Die Aufbewahrung wichtiger historischer Daten in Wissenschaft,
Gesundheitswesen, Produktion Finanz- und anderen Bereichen steht
vor einer umfangreichen Krise, warnen Mitarbeiter und
Wissenschaftler* der Earth and Space Data Computing Division der
Nasa. In den letzten f&#252;nfzig Jahren hat sich die
Informationsrevolution auf die Daten eingeschossen, ihre Sammlung,
das Aufbewahren, das Abrufen, &#220;bermitteln, die Analyse und
Pr&#228;sentation, schreibt Peter Drucker im Forbes Magazine. Die
Umwandlung langfristig historischer Datenaufzeichnungen in
Informationskonzepte ist laut Drucker das n&#228;chste Stadium in
dieser Revolution hin zum Aufbau der neuen, informationsbasierten,
wissenschaftlichen und unternehmerischen Basis.<br />
<br />
 Im Mittelpunkt der Datentransformation in wissensbasierte
Information liegt das Verst&#228;ndnis, wie ein langfristiges
Archiv digitaler Daten in einem Massenspeichersystem aufbewahrt
werden kann. So wie sich diese Systeme durch neue Software und
Hardware weiterentwickeln, muss ihre &#220;berlebensf&#228;higkeit,
Zuverl&#228;ssigkeit und Weiterf&#252;hrbarkeit garantiert werden.
Dies stellt ebenso grosse Herausforderungen wie das
Jahr-2000-Problem. Entgegen diesem, in dem eine Krise zu einem
bestimmten Zeitpunkt entsteht, stellen grosse Datenlager Probleme
dar, deren Ernsthaftigkeit sich erst nach l&#228;ngerer Zeit
manifestiert. Da es Jahrzehnte dauern k&#246;nnte, eine grosse
Datenmenge zur weiteren Aufbewahrung auf ein neues Medium zu
&#252;bertragen, die Lebenserwartung des Speichermediums selber
jedoch nur ein Jahrzehnt betr&#228;gt, k&#246;nnte sich der
Transfer vor einem unrettbaren Datenverlust als unm&#246;glich
erweisen.<br />
<br />
 Im Laufe der letzten zwanzig Jahre sind wichtige wissenschaftliche
oder Unternehmensdaten verloren gegangen oder w&#228;ren es,
h&#228;tten nicht bedeutende finanzielle Investitionen zu ihrer
Rettung beigetragen. Als Beispiel gilt die Anstrengung von Nasa,
NSF und Noaa, Daten im Wert von acht Jahren aus einem obsoleten
System zu retten. Diese herkulische Anstrengung gipfelte in der
Rettung von wertvollen 20j&#228;hrigen Satellitenaufzeichnungen
&#252;ber die globale Erw&#228;rmung.<br />
<br />
 Als weiteres Muster ist die Erfahrung des Cern zu nennen. Nach
einem im Januar letzten Jahres erschienenen Artikel von Mark
Ferelli ist derzeit am Cern eine der gr&#246;ssten Anstrengungen im
Datensammeln am Laufen. J&#228;hrlich werden &#252;ber 20 Terabyte
Daten aus vier Experimenten gesammelt. Diese Rate wird bald einmal
auf 200 Terabyte j&#228;hrlich ansteigen, bei einem Maximum von
einem Petabyte pro Jahr. All diese Daten werden auf Platten
gesammelt und auf Bandkassetten &#252;bertragen. Die
Wissenschaftler sind daran, Daten auf alten Bandformaten
einzusammeln. W&#228;hrend sechs Monaten haben sie 200 MByte
fassende 3480-B&#228;nder auf &#252;ber 20000 B&#228;nder mit 800
MByte Kapazit&#228;t f&#252;r die Archive kopiert. Das Cern steht
vor einer endlosen Aufgabe und hat eine Reihe von Systemen
zusammengetragen, die aber keines davon als langfristige
L&#246;sung betrachtet werden darf.<br />
<br />
 <b>Die nahe Zukunft</b><br />
 Das Datenwachstum in j&#252;ngster Vergangenheit hat
atemberaubende Proportionen angenommen. In den letzten zehn Jahren
hat sich die Dichte der Speicherb&#228;nder nach Mooreschem Gesetz
gesteigert, sich also alle 18 Monate verdoppelt. In derselben Zeit
jedoch hat das Tempo des Datentransfers nur rund 1,3 mal zugenommen
und ist deshalb um mindestens den Faktor 3 hinter das Wachstum der
Datendichte zur&#252;ckgefallen. Parallel zur wachsenden
Aufzeichnungsdichte haben auch die Speicheranforderungen
zugenommen. Laut einem Artikel in der Computer Technology Review
sollen die Speicheranforderungen einer Fortune-1000-Firma bis ins
Jahr 2000 von zehn Terabyte in 1997 auf ein Petabyte zunehmen. In
den n&#228;chsten f&#252;nf Jahren soll ein typisches grosses
Datenbanksystem f&#252;r eine US-Regierungsabteilung t&#228;glich
f&#252;nf Terabyte Daten erhalten, online 300 Terabyte unterhalten
mit einer Zugriffszeit von 15 bis 60 Sekunden, und zwischen 15 bis
100 Petabyte archivieren. Ausserdem werden datenintensive Programme
wie das Erdbeobachtungssystem der Nasa (EOS) enorm grosse
wissenschaftliche Datenbanken mit sehr hohen Speicheranforderungen
unterhalten.<br />
<br />
 Die Technologie von Massenspeichern ist zwar in einigen Bereichen
beeindruckend, hat aber mit den Wachstumsanforderungen anderer
Gebiete nur knapp Schritt gehalten. Heute fasst eine einzige
Kassette auf 128 Spuren zehn GByte, was im Vergleich zu den
Speicherb&#228;ndern von 1960, die ein MByte fassten, einer
10000fachen Steigerung in 30 Jahren entspricht. Heute sind
Magnetb&#228;nder f&#252;r ein GByte pro Dollar und einer
Lebenszeit von zehn Jahren erh&#228;ltlich. Optische B&#228;nder
versprechen gr&#246;ssere Kapazit&#228;ten in einer einzigen
Speichereinheit, eine hohe Volumendichte und geringe Kosten pro
GByte. Ein optisches Band entspricht dem Volumen von 250 bis 500
Magnetb&#228;ndern. Doch die optische Bandtechnik beginnt erst
jetzt, ihr Marktpotential zu entfalten. Auch revolution&#228;re
Medien wie optische Speichersysteme, holographische Speichersysteme
und biologische Speicher wie das Halobacterium haben sich noch
nicht als kommerziell lebensf&#228;hig erwiesen. Doch die
Aussichten der gewaltigen Kapazit&#228;tssteigerungen mit Abruf-
und Transfergeschwindigkeiten, die um einiges h&#246;her liegen als
heute, scheinen in Reichweite zu treten.<br />
<br />
 <b>Die weitere Zukunft</b><br />
 Im Laufe der kommenden 15 Jahre werden die Wissenschaftler die
Breite der auf Halbleiter einge&#228;tzten Linien auf unter ein
zehntel Mikron reduzieren. Elektrische Signale, die darauf reisen,
werden dann so wenige Elektronen enthalten, dass das
Hinzuf&#252;gen oder Wegnehmen eines einzigen Elektrons einen
Unterschied in den Computerfunktionen ausmacht. Forscher entwickeln
nun Quantumpunkte, die ungez&#228;hmte Elektronen einfangen und
ihnen nur dann erlauben abzuhauen, wenn sie ein genau dosierter
externer Energieschub anpiekst. Solche Quantengef&#228;ngnisse
k&#246;nnten zu kleinen Hochleistungslasern f&#252;hren, die das
15000fache an Daten auf einem Computerchip unterbringen, der so
gross ist wie heutige Prozessoren.<br />
<br />
 Aktuelle Speicherkapazit&#228;ten in Nanotechnologie fassen 125
MByte pro Quadratzoll. Das National Storage Industry Consortium
(NISC) hofft, es bis 2000 auf eine Produktion von 1,25 GByte pro
Quadratzoll zu bringen. Dies k&#246;nnte m&#246;glich werden, weil
w&#228;hrend der letzten f&#252;nf Jahre ein Wachstum von 60
Prozent pro Jahr stattfand. Wenn dieser Trend anh&#228;lt, werden
die Kapazit&#228;ten 12,5 GByte pro Quadratzoll in 2005 und 125
GByte in 2010 erreichen.<br />
<br />
 Holographische Speicher k&#246;nnten bis 125 GByte in einen
Kubikzentimeter packen. Im Grunde hat sich diese Technik schon
etwas eingeb&#252;rgert. Leider gibt es noch keine guten
Aufzeichnungsmedien. Die Hologramme sind schwer zu stabilisieren
und der Laserstrahl schwer zu steuern. Das System f&#252;r die
Filewartung l&#228;uft z&#228;h und wenn mehr Hologramme ins System
kommen, verblassen die alten.<br />
<br />
 Die Rome Laboratories untersuchen dreidimensionale
Zweiphoton-photochromatische Speichertechniken, wie sie von der
Universit&#228;t von S&#252;dkalifornien in San Diego entwickelt
wurden, die in einem W&#252;rfel aufbewahrte Datenseiten lesen.
Dreidimensionale W&#252;rfelspeicher lassen sich erst realisieren,
wenn einige Komponenten das Reifestadium erreicht haben. Das
Hindernis bei der Implementation ist, dass niemand ein passendes
Medium gefunden hat, welches auf Licht so empfindlich ist, dass man
keinen Hochleistungslaser braucht, um das Hologramm zu &#228;tzen,
und doch stabil genug ist, dass es nicht verblasst. Auch sollte das
Medium ein hohes Signal-zu-L&#228;rm-Verh&#228;ltnis haben - ein
physikalisches und chemisches Problem also.<br />
<br />
 Das &#196;tzen von Elektronen auf HD-ROM (High Density-Read Only
Memory) wurde vom Los Alamos National Laboratory gepr&#252;ft. Die
Technik erm&#246;glicht das Applizieren von L&#246;chern und
Erhebungen im Nanometerbereich. Mit einem Elektronenstrahl, der
eine 150stel Milliarde eines Zoll breit ist, kann auf einem zehn
Mikron dicken Stahlband aufgezeichnet werden bis zu einem
Fassungsverm&#246;gen von 50 Terabyte pro Quadratzoll. Anvisiert
werden 400 GByte bis 2003 bei einer praktischen Grenze von 1,4
Terabyte pro Quadratzoll. Lese- und Schreibgeschwindigkeiten
betragen zwei GByte, resp. vier MByte pro Sekunde bei einer
Zugriffszeit von 200 Millisekunden.<br />
<br />
 Auch biologische L&#246;sungen stehen zur Diskussion. Forscher
erw&#228;gen Speichermedien, die auf den Fluoreszenzeigenschaften
von Halobacterium aufbauen, das in den Lagunen ausserhalb der Bucht
von San Francisco oder im schillernden &#220;berzug von Quallen
vorkommt. <i>(cs)</i><br />
<br />
 <b>Speichermedien</b><br />
 Computerarbeiter brauchen immer gr&#246;ssere Speicher. Trotz
fallender Kosten f&#252;r diese Ger&#228;te ist das Ablegen von
noch mehr Daten auf herk&#246;mmlichen Magnetspeichern teuer und
auch kompliziert in der Verwaltung.<br />
<br />
 - Magnetoptische Systeme<br />
 Die schnell wachsende Firma braucht sofortigen Zugriff auf grosse
Mengen gespeicherter Daten. Dokumente, Grafiken, Bilder, was auch
immer, f&#252;r sie bieten optische Plattenlaufwerke und Jukeboxen
einen kosteng&#252;nstigen Weg, grosse Datenmengen online zu
unterhalten und sie sparen wertvolle Zeit, indem sie dem Benutzer
eine maximale Produktivit&#228;t erm&#246;glichen. Optische Platten
sind f&#252;r langfristige Datenlagerung geeignet. Die Platten sind
weniger empfindlich auf magnetische Interferenzen und schlechte
Behandlung als andere Speichermedien und sie k&#246;nnen ohne
Datenverlust und Wartung bis zu hundert Jahre lang aufbewahrt
werden.<br />
<br />
 In optischen Jukeboxen k&#246;nnen Hunderte von Gigabytes
gespeichert werden und die Kapazit&#228;t l&#228;sst sich einfach
und schrittweise erh&#246;hen, indem zus&#228;tzliche Platten in
die Jukebox gef&#252;llt werden oder eine weitere Jukebox
angef&#252;gt wird. F&#252;r speicherhungrige Applikationen wie
Bildermanagement, Netzwerkdatenmanagement, Online-Archive und
automatisches Backup sind optische Systeme sicher und
preiswert.<br />
<br />
 - CD-ROM<br />
 Auf einer CD haben rund 10 000 A4-Seiten Text oder rund 450
Disketten Platz. Die Vorz&#252;ge von CDs f&#252;r Archivierung und
Speicherung sind ihre geringen Kosten, Kleinheit und ihr
100j&#228;hriges Leben. Wenn man Informationen verteilen muss, ist
auch ihre tiefe Marktdurchdringung von Vorteil. Praktisch jeder PC
hat heute ein CD-Laufwerk. Ihre Nachteile sind die geringen
Transferraten und langsamen Zugriffszeiten und ihre einmalige
Beschreibbarkeit.<br />
<br />
 CD-ROM sind die ideale L&#246;sung f&#252;r das Ablegen
historischer Dokumente, hoch aufgel&#246;ster Bilder und f&#252;r
das Verteilen von Katalogen, technischer Information und
Softwareprogrammen.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

