<html>
<head>
<title>Computerworld.ch: Dossier</title>
<meta name="keywords" lang="de"
content="computerworld, computerworld.ch, computer, world, zeitung, it, magazin, special, " />
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" type="text/css"
href="../../css/default.css" />
<meta name="rights" content="copyright by computerworld.ch" />
<meta http-equiv="Content-Language" content="de-ch" />
<meta name="description"
content="Die Schweizer Website f&#252;r Informatik Technologie und Internet" />
<meta name="robots" content="index,follow" />
<meta name="copyright" content="computerworld.ch" />
<meta name="language" content="de-ch" />
</head>
<body bgcolor="#FFFFFF">
<a id="" name=""></a> 

<table>
<tr><!-- OBENSTEHENDES NICHT MITKOPIEREN -->
<!-- DOSSIER TABLE BEGINS HERE -->
<td width="440" valign="top">
<!-- MOEGLICHER ORT FUER RECTANGLE BANNER -->
<table border="0" cellpadding="0" cellspacing="0" width="440">
<tr>
<td width="440" height="5" colspan="2"><img
src="../../img/layout/trans1x1.gif" width="1" height="5" /></td>
</tr>

<tr>
<td valign="top" height="30"><span
class="txt-xl-black">Speicher-Hype und Wirklichkeit</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black"><i>Die Virtualisierung
von heterogenen Speicherressourcen in SAN (Storage Area Networks)
und regelbasiertes Speichern verdienen ihre Namen erst, wenn sie
wirklich hersteller&#252;bergreifend eingesetzt werden
k&#246;nnen.</i></span></td>
</tr>

<tr>
<td valign="top"><span class="txt-s-black"><br />
<b>Erscheinungsdatum:</b> 19.11.1999<br />
 <b>Rubrik:</b> Hintergrund<br />
 <b>Autor:</b> <a href="../../impressum" class="txt-link-red">Beat
Hochuli</a><br />
<br />
</span></td>
</tr>

<tr>
<td valign="top"><span class="txt-m-black">Automatisierung,
Virtualisierung, regelbasiertes Speichern (Policy-Based Storage;
PBS) - seit nunmehr zwei Jahren herrscht wahrlich kein Mangel an
vollmundigen Versprechungen seitens der Speicherschwergewichte und
der in ihrem Kielwasser segelnden unz&#228;hligen Start-ups an die
Adresse der mit immer gewaltigeren Komplexit&#228;tsproblemen
konfrontierten Storage-Administratoren. Die Crux dabei ist, dass
diese Beschw&#246;rungen eines Speicherparadieses den
IT-Verantwortlichen in den Unternehmen das Leben eher erschweren
als erleichtern. Denn w&#228;hrend sich unter dem Allerweltsbegriff
Automatisierung jedermann etwas vostellen kann - und sei es nur ein
Tool f&#252;r ein beschr&#228;nktes Verfahren - gibt es f&#252;r
Virtualisierung und PBS seitens der Hersteller keine einheitliche
Definition. &#220;bersichtlicher wird die Sache auch dadurch nicht,
dass Virtualisierung als Teil von PBS gesehen werden kann - und
umgekehrt.<br />
<br />
 <b>Virtueller Wildwuchs</b><br />
 Grob gesagt bietet Virtualisierung die M&#246;glichkeit,
heterogene Speichersubsysteme innerhalb von SAN (Storage Area
Networks) und NAS (Network Attached Storage) zu "poolen" und diesen
Pool als eine einzige Einheit zu verwalten. Dabei wird der logische
Datenzugriff von der physischen Datenstruktur getrennt.
Grunds&#228;tzlich sind heute zwei verschiedene
Virtualisierungsarchitekturen im Gespr&#228;ch - In-band und
Out-of-band.<br />
<br />
 Bei der ersten befindet sich die Virtualisierungslogik auf einem
Server, der zwischen dem Applikations/Datenbank-Host und der
Switch-Infrastruktur liegt. S&#228;mtliche logischen Abfragen
werden durch diesen Server geschleust und in physische
Speicher-Abfragebefehle &#252;bersetzt. Der Vorteil dieser Methode
liegt darin, dass sie eine extrem ausgefeilte Datenmanipulation
erm&#246;glicht. Der Nachteil: Sowohl Daten als auch Metadaten
m&#252;ssen den Virtualisierungsserver passieren, was diesen zu
einem potenziellen Flaschenhals macht.<br />
 In der Out-of-band-Architektur wird die dedizierte
Virtualisierungs-Engine direkt mit der Switch-Infrastruktur des
SAN?und via LAN mit den Applikationsservern verbunden, wobei bei
diesem Ansatz nur die Metadaten durch die Engine geschleust werden.
Der Vorteil liegt hier in der Einfachheit, den tieferen Kosten und
in der Verhinderung eventueller Flaschenh&#228;lse. Nachteilig
wirken sich bei der Out-of-band-Methode die geringere
Funktionalit&#228;t und die beschr&#228;nkten M&#246;glichkeiten
bei der Datenmanipulation aus, da die Virtualisierungs-Engine die
Daten selbst nicht kontrolliert.<br />
<br />
 So viel zur reinen Theorie. Die gegenw&#228;rtige Praxis sieht
allerdings anders aus. Die Be-obachter der Speicherszene sind sich
einig, dass sowohl die SAN im Allgemeinen als auch die
Virtualisierungstechniken im Speziellen noch unausgereift sind, und
unter den Anwendern und denen, die es werden m&#246;chten,
h&#246;chste Verwirrung dar&#252;ber herrscht, welche Hersteller
tats&#228;chlich "echte" Virtualisierung anbieten k&#246;nnen - und
in welchem Umfang. Denn eines gilt es unmissverst&#228;ndlich
festzuhalten: Das Ganze macht nur dann Sinn, wenn wirklich
komplexe, heterogene und hersteller&#252;bergreifende
Speicherinfrastrukturen virtualisiert werden k&#246;nnen. Der
Branchenvereinigung SNIA (Storage Networking Industry Association),
die f&#252;r die Standardisierung der Virtualisierungstechniken
zust&#228;ndig ist, geh&#246;ren zwar alle wichtigen
Speichergr&#246;ssen an. Dennoch schm&#252;cken diese und auch die
vielen Start-ups ihre Produkte mit dem Virtualisierungslabel,
obwohl es sich dabei jeweils um v&#246;llig unterschiedliche
Ans&#228;tze auf allen m&#246;glichen Ebenen handelt - von
einzelnen Steuerungschips bis hin zur mehr oder weniger
&#252;bergreifender Verwaltungssoftware.<br />
<br />
 Wie ist diesem Wildwuchs beizukommen? Steve Duplessie, Analyst bei
der Marktforscherin Enterprise Storage Group, hat eine einfache
Antwort parat, weiss aber auch, dass sie einem frommen Wunsch
&#228;hnelt: "Zu allererst muss jeder Hersteller klipp und klar
sagen, was er unter Virtualisierung versteht, welche Funktionen er
anbietet und welche Probleme damit gel&#246;st werden k&#246;nnen."
Informationen zur Vertr&#228;glichkeit der eigenen
Virtualisierungsware mit Speichertechniken - Hardware und Software
- der Konkurrenz gen&#252;gt dabei nicht. Denn ein noch
gr&#246;sseres Problem stellt die Interoperabilit&#228;t von
Virtualisierungstechniken &#252;ber Betriebssystemgrenzen hinweg
dar. Eine L&#246;sung kann beispielsweise f&#252;r eine homogene
Windows-Umgebung taugen - und v&#246;llig unbrauchbar werden, wenn
zus&#228;tzlich eine mit Unix betriebene Sektion verwaltet werden
soll. Ein weiteres Problem sieht Anders Lofgren, Analyst bei der
Giga Information Group, in der Verbindung von
Virtualisierungstechniken mit bestehenden
Speicherverwaltungs-Applikationen. "Das m&#252;ssen sich die
Anwenderfirmen gut &#252;berlegen. Denn viele Funktionen der
heutigen Virtualisierungsprodukte ersetzen einfach Anwendungen, die
sich bew&#228;hrt haben und mit denen die Unternehmen
gl&#252;cklich sind", gibt er zu bedenken.<br />
<br />
 <b>Regelbasiertes Dickicht</b><br />
 Branchenkenner wie Lofgren und Duplessie, aber auch die
IT-Verantwortlichen, hoffen jetzt auf die Durchschlagskraft des von
der SNIA ausgearbeiteten Standardvorschlags CIM (Common Information
Model; siehe Kasten). Dieser und das Rahmenwerk SMIS (Storage
Management Interface Specifications, vormals Bluefin) ist Experten
zufolge auch vonn&#246;ten, um das gegenw&#228;rtige Durcheinander
im weiten Feld des regelbasierten Speicherns auszur&#228;umen. Denn
&#228;hnlich wie bei der Virtualisierung verkaufen die Hersteller
mittlerweile praktisch alles unter dem PBS-Label (Policy-based
Storage), ohne klar zu umreissen, was sie darunter verstehen. Zwar
existiert eine allgemein akzeptierte Definition von PBS, die aber
mehr als genug Spielraum f&#252;r Interpretationen l&#228;sst. Sie
lautet: PBS-Dienste erm&#246;glichen es einem IT-Verantwortlichen,
die Zuweisung von Speicherressourcen an Applikationen, Anwender und
Medien zu automatisieren.<br />
<br />
 Der Fokus liegt dabei nicht wie bis anhin auf der Verwaltung von
Ger&#228;ten, sondern auf dem Management von Regeln, die festlegen,
was die Ger&#228;te tun sollen. So haben sie beispielsweise
daf&#252;r zu sorgen, dass der Finanzabteilung eines Unternehmens
immer so viel Speicherplatz zur Verf&#252;gung steht, wie sie
braucht. Gleichzeitig m&#252;ssen sie schauen, dass f&#252;r das
Personalwesen immer 100 GByte reserviert sind.<br />
<br />
 Wie von der Virtualisierung l&#228;sst sich vom PBS sagen, dass es
keine klar abgegrenzte Produktekategorie darstellt, sondern
vielmehr in &#252;bergeordneten Funktionen f&#252;r die Verwaltung
von SAN und NAS besteht. Zweitens kann man festhalten, dass
regelbasiertes Management von Systemen keineswegs revolution&#228;r
ist, da es bereits in der guten alten Mainframe-&#196;ra gang und
g&#228;be war - neu ist es lediglich in der Storage-Arena. Drittens
schliesslich muss betont werden, dass ein PBS, das diesen Namen
wirklich verdient, zum jetzigen Zeitpunkt genausowenig realisiert
werden kann wie Virtualisierung - aus demselben Grund: dem Mangel
an Interoperabilit&#228;t zwischen den Speicher- und
Betriebssystemen verschiedener Hersteller.<br />
<br />
 Die grossen Speicherspezialisten stellen zwar
plattform&#252;bergreifendes automatisches Speichermanagement in
Aussicht, der gegenw&#228;rtige Stand der Dinge ist allerdings eher
ern&#252;chternd. Am weitesten d&#252;rfte EMC mit ihrer
Auto-IS-Strategie sein, die aber immer noch auf einer
propriet&#228;ren Middleware aufbaut. Ausserdem darf in der
gesamten PBS-Diskussion nicht &#252;bersehen werden, dass bei
Ausdr&#252;cken wie "Automated Storage Provisioning" (automatische
Speicherzuteilung) - auch bei EMC spricht man gern und viel davon -
keineswegs Einigkeit herrscht.<br />
<br />
 Tatsache ist, dass sich in der PBS-Arena neben den gestandenen
Riesen auch zahlreiche Start-ups tummeln. Dass es sich dabei
praktisch um dieselben wie im Vitualisierungsgehege handelt,
verwundert nach dem Gesagten nicht. Dass viele von ihnen je nach
Schlagwort-Konjunktur ihre Business-Pl&#228;ne alle drei Monate
&#228;ndern, auch nicht. Und noch weniger die Aussage von Nancy
Marrone von der Enterprise Storage Group, die &#252;berzeugt ist,
dass im Virtualisierungs- und PBS-Gesch&#228;ft in den
n&#228;chsten Monaten und Jahren massiv ausgesiebt wird. "Es ist
absolut unm&#246;glich, dass so viele Unternehmen in dieser Sparte
&#252;berleben k&#246;nnen", erkl&#228;rt sie.<br />
<br />
</span> </td>
</tr>
</table>

<!-- DOSSIER TABLE ENDS HERE -->
</td>
<!-- CONTENT TABLE ENDS HERE -->
<!-- UNTENSTEHENDES NICHT MITKOPIEREN -->
</tr>
</table>
</body>
</html>

